{
  "timestamp": "2026-01-02T00:00:23.038687",
  "query": "රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්රධාන කාර්යයක් බොහෝමයක් රජවරුන් විශාල වැව් ඇළ මාර්ග ඉදි අතරින් වැඩි",
  "results": [
    {
      "url": "https://www.facebook.com/100081616779069/posts/%E0%B6%85%E0%B6%B1%E0%B7%94%E0%B6%BB%E0%B7%8F%E0%B6%B0%E0%B6%B4%E0%B7%94%E0%B6%BB_%E0%B6%BB%E0%B7%8F%E0%B6%A2%E0%B6%B0%E0%B7%8F%E0%B6%B1%E0%B7%92%E0%B6%BA%E0%B6%BB%E0%B6%A2%E0%B6%BB%E0%B6%A7-%E0%B6%BB%E0%B7%8F%E0%B6%A2%E0%B6%B0%E0%B7%8F%E0%B6%B1%E0%B7%92%E0%B6%BA%E0%B7%9A-%E0%B6%85%E0%B6%9C%E0%B6%B1%E0%B7%94%E0%B7%80%E0%B6%BB-%E0%B6%BD%E0%B7%99%E0%B7%83-%E0%B6%85%E0%B6%B1%E0%B7%94%E0%B6%BB%E0%B7%8F%E0%B6%B0%E0%B6%B4%E0%B7%94%E0%B6%BB-%E0%B7%83%E0%B7%84-%E0%B7%83%E0%B7%93%E0%B6%9C%E0%B7%92%E0%B6%BB%E0%B7%92%E0%B6%BA-%E0%B6%B4%E0%B7%90%E0%B7%80%E0%B6%AD%E0%B7%92-%E0%B6%BA%E0%B7%94%E0%B6%9C%E0%B6%BA-%E0%B6%85%E0%B6%B1%E0%B7%94%E0%B6%BB/208023664077074/",
      "title": "#අනුරාධපුර_රාජධානිය රජරට රාජධානියේ අගනුවර ...",
      "snippet": "Sep 5, 2020 ... රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්රධාන කාර්යයක් විය. බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර, ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ ...",
      "paragraphs": [
        "සිහල දීපය සැප්තැම්බර් සියල්ලන්ට විවෘත සමඟ බෙදාගන්නා ලදී අනුරාධපුර රාජධානිය රජරට රාජධානියේ අගනුවර ලෙස අනුරාධපුර සහ සීගිරිය පැවති යුගය අනුරාධපුර යුගය ලෙස සැලකේ අනුරාධපුර රාජධානිය අනුරාධපුර නගරයේ නමින් නම් කරන ලදී වර්ථමාන ශ් රී ලංකාවේ ප් රධන ගොඩබිම වන ලංකා දූපත හෙවත් ලක්දිව බිහිවූ ප් රථම සංවිධානාත්මක රාජධානිය වුයේ රජරට රාජධානියයි මෙම ලිපියෙහි ඉන්දික භාෂා පෙළ අඩංගුය යෝග් ය අනුවාද පහසුකම් නොමැත්තේ නම් ඔබ හට ඉන්දික භාෂා පෙළ වෙනුවට ප් රශ්නාර්ථලකුණු හෝ කොටු අස්ථානගත ස්වර හෝ දක්නට නොමැකි බැඳි දිස්විය හැකිය මුල් යුගයේ උපතිස්සනුවර අගනුවර වූ අතර පණ්ඩුකාභය රජ විසින් අනුරාධගම අගනුවර කරගෙන එය පුරවරයක් දකිවා සංවර්ධනය කරන ලදී රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්රධාන කාර්යයක් විය බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය මෙම ඉදිකිරීම් නිසා අනුරාධපුර යුගය මුළුල්ලේම රජරට ප්රදේශය තුළ විශාල එමෙන්ම සංකීර්ණ වාරිමාර්ග පද්ධතියක් බිහි විය රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්රධාන කාර්යයක් විය බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය මෙම ඉදිකිරීම් නිසා අනුරාධපුර යුගය මුළුල්ලේම රජරට ප්රදේශය තුළ විශාල එමෙන්ම සංකීර්ණ වාරිමාර්ග පද්ධතියක් බිහි විය එකල ඉදි කරන ලද මහා ස්ථුපයන් වූ රුවන්වැලිසෑය ජේතවණාරාමය මෙන්ම ලෝවාමහාපාය වැනි විශාල ගොඩනැගිලි මඟින් අනුරාධපුර යුගයේ තිබූ ගෘහ නිර්මාණ ශිල්පයේ දියුණුව මනාව පෙන්නුම් කරයි අගනුවර අනුරාධපුර ප් රධාන ලිපිය අනුරාධපුර පෞරාණික නගරය ඓතිහාසික මූලාශ්රයන්හි සඳහන් වන පරිදි අනුරාධපුර නගරය ආරම්භ වී ඇත්තේ ක් රි පූ සියවෙසහි වුවත් පුරාවිද්යාත්මක තොරතුරු අනුව එහි ඉතිහාසය ක් රි පූ වැනි සියවස තරම් ඈතට දිව යයි කරන ලද පුරා විද්යා කැණීම් වලදී වඩා පූර්ව කාලයන්හි විසූ ජනයා සම්බන්ධ සාක්ෂි ලැබී ඇතත් ක් රි පූ සියවසට එපිට කාලය පිළිබද තොරතුරු අත්තේ මද වශෙයනි අනුරාධපුරෙය් වැඩිදුර සිදු කරන ලද කැණීම් වලදී මෙම පුරවරෙය් පැවති ප්රාග් ඓතිහාසික ජනාවාසයන් පිළිබද තොරතුරු ලැබී ඇත ක් රි පූ දක්වා විහිදුණ ප්රාග් ඓතිහාසික ලෝහ යුගෙය්දී ලෝහ තාක්ෂණය කුඹල් කර්මාන්තය අහ්වයන් භාවිතය ගවයන් ඇති කිරීම සහ වී වගාවද පැවතුණ බව පෙනී යයි ක් රි පූ අතර කාලයේදී අනුරාධපුරයේ ජනාවාසය හෙක්ටයාර් ඉක්මවා වර්ධනය විය නගරය ඊසාන දිගින් සහ වයඹ දිගින් පිහිටි ප්රධාන වරායයන් අතර උපායමාර්ගිකව වැදගත් වන පරිදි පිහිටියේය වගා කළ හැකි සරු බිම් එය වටෙකාට පිහිටා තිබුණි ආක්රමණිකයන්ගෙන් නගරය ආරක්ෂා කළ ස්වභාවික පවුරක් වූ ඝන වනාන්තරය නගරය හාත්පස අවුරා විය ක් රි පූ සියවසෙහිදී පණ්ඩුකාභය රජතුමන් විසින් අනුරාධපුරය අගනගරය බවට පත් කරන ලද බවත් මනා සංවිධිත සැලසුමක් අනුව නගරය සහ එහි උප නගරයන්ද පිහිටුවන ලද බවත් කියැවේ අභය වාපි හෙවත් අභය වැවද එතුමන් විසින් කරවන ලදී කාලවේල සහ චිත්තරාජ නමැති යක්ෂයන් උදෙසා දෙවොල්ද කරවනු ලැබීය චේතියා නමැති යක්ෂණිය උදෙසා වෙළඹකගේ ස්වරූපයෙන් වූ පිළිරුවක් රාජ මාළිග පරිශ්රයේම ඉදි කරවන ලද අතර මේ සියළු යක්ෂ දේවතාවන් උදෙසා වාර්ෂිකව පුද පූජා පැවැත්වීමද සිදු විය නගරයේ සුසාන භූමිය වදක භූමිය පශ්චිම රාජිණියගේ දෙවොල වෙස්සවණ උදෙසා වූ නුග රුක ව්යාධදේව උදෙසා වූ තල් රුක යෝනයන් සඳහා වාස භූමිය ආත්ම පූජා මන්දිරය ආදිය පිහිටැවිය යුතු තැන්ද මෙතුමන් විසින් නියම කරන ලදී වහලුන් නොහොත් චණ්ඩාලයන් විසින් කළ යුතු කාර්යයන් නියම කෙරුණු අතර ඔවුන් උදෙසා ග්රාමයක් වෙන් කරන ලදී නිඝණ්ටයන් තැන තැන සරන තවුසන් ආජීවකයන් සහ බ්රාහ්මණයන් උදෙසා වාසස්ථාන ගොඩ නඟන ලදී ග්රාම සීමාද නීර්ණය කරනු ලැබීය අනුරාධපුරය අග නගරය බවට පත් කරමින් ක් රි පූ සියවස තරම් ඈත යුගයකදී පණ්ඩුකාභය රජතුමන් විසින් බිහි කරනු ලැබූ සම්ප්රදාය ඉතා වැදගත් වේ පික් පුරාණ පරිපාලණ ප් රදේශය අනුරාධපුර මධ් යතන යුගය නගරයට සහ පූජනීය ස්ථානයන්ට කරනු ලැබූ සනීපාරක්ෂක සහ පරිපාලනමය සම්පාදනයන් විසින් පෙන්නුම් කෙරෙනුයේ කාලාන්තරයක් තිසිසේ නගරය කිසියම් මධ්යගත සැලැස්මකට අනුව සංවර්ධනය කෙරුණු බවය පණ්ඩුකාභය රජතුමන්ගේ ඇවෑමෙන් එතුමන්ගේ පුත් මුටසීව රාජපදප්රාප්ත විය හැට වසරක් වූ එතුමන්ගේ රාජ්ය පාලන කාලය තුළ අනුරාධපුර නගරය තවදුරටත් අගනුවර වශයෙන් පවත්වා ගත් අතර බුදු සමය දිවයිනට හඳුන්වා දෙනු ලැබූ මුල් අවදියේදී වැදගත් කාර්යභාරයක් ඉටු කරනු ලැබූ මහාමේඝවන උද්යානය හෙවත් මහමෙවුනා උයන පිහිටුවාලීමද එසමයෙහි සිදුවිය බුදු රජාණන් වහන්සේගේ පිරිනිවන් පෑමෙන් වසර කට පසු ශ්රී ලංකාවට බුදු සමය හඳුන්වාදෙන ලද්දේ මුටසීව රජතුමන්ගේ ඇවැමෙන් රාජ්යත්වයට පත් එතුමන් පුත් දේවානම්පියතිස්ස රාජ්ය සමයෙහිදීය ඉන්දියාවෙහි වුසූ අශෝක අධිරාජයා දේවානම්පියතිස්ස රජතුමන්ගේ සමකාලීනයෙක් විය මෙම කාලය ක් රි පූ අතර කාලයයි ලංකාවෙහි රාජ්යත්වයෙහි ආරම්භය සහ ආසියාවෙහි විශිෂ්ඨතම ආගමක් වූ බුද්ධ ධර්මය මත පදනම් වූ ශිෂ්ඨාචාරයක ආරම්භයද සනිටුහන් කෙරෙන්නේ මෙසමයෙහිය සීගිරිය ප් රධාන ලිපිය සීගිරිය සීගිරිය ප් රෘඪ ඉතිහාසයකට නෑකම් කියන සිංහල දේශයේ තවත් අභිමානී නගරයක් වූ සිගිරිය අයත් වන්නේද රජරට රාජධානියටයි මෙහි පාලකයා වනුයේ කාශ් යප රජුයි කාශ් යප රජු මෙම ස්ථානය තෝරා ගැනීමට හේතුව වුයේ තම සොහොයුරු මුගලන් කුමරු කෙදිනක හෝ පැමිණ රාජ් ය පැහැරගනීයැයි තිබූ බියයි කලාගාරයක් බඳු මෙහි සීගිරි චිත් ර ඉන්දියාවේ අඡන්තා චිත් ර කලාවට සමාන කමක් දක්වයි මෙම චිත් ර පිලිබඳව අදහස් දක්වන පරණවිතානයන් පෙන්වා දෙන්නේ මෙම චිත් ර වලින් නිරූපණය වන්නේ මෙඝලතා හා චිජ්ජුලතා යන්න ය එනම් විදුලිය හා මේඝගර්ජනය යන ස්වභාවික සිදුවීම්ය මෙහි තවත් සුවිශේෂී අවධානයක් යොමුවන ස්ථානයක් ලෙස සීගිරි කැටපත් පවුර හඳුන්වාදිය හැකිය එහි ලියැවුණු කුරුටු ගී තුළින් හෙළ ගැමියාග ේ අදහස් මෙන් ම හෙළ සංස්කෘතිය පිළිබඳවද තොරතුරු හෙළිවෙබුදල්මි ආක් රමණ රජරට රාජධානියට අඛණ්ඩව පැවතුණු තර්ජනයක් වූයේ දකුණු ඉන්දීය ආක්රමණයන්ය එලෙස සිදු වූ ආක්රමණයන්ගෙන් සතුරන් පරදවා රජධානියේ පාලනය නැවත ලබාගත් දුටුගමුණු වළගම්භා ධාතුසේන වන විජයබාහු ලීලාවතී වැනි පාලකයන් කාගේත් අවධානයට ලක්විය අනෙකුත් පාලකයන් මතකයේ රැඳුනේ ඔවුන් විසින් සිදු කරන ලද හමුදා ජයග්රහණ නිසාය දකුණු ඉන්දියාවට එරෙහිව ආක්රමණයන් දියත් කළ පළවන ගජභාහු පන්ධ්යන් දේවියට පිහිට වීමට තම හමුදාවන් යැවූ දෙවන සේන එවැනි පාලකයන්ය රජරට රාජධානියට එරෙහිව ආක්රමණයන් කිහිපයක් සිදුවූ අතර ඒවා සියල්ලක්ම දියත් කරන ලද්දේ දකුණු ඉන්දියාණුවන් විසිණි ශ්රී ලංකා ඉතිහාසයේ පළමු වාර්තාගත ආක්රමණය සිදුවූයේ සූරතිස්ස ක් රි පූ රජු සමයේදීය එය සිදු කරන ලද්දේ සේන හා ගුත්තික යන දකුණු ඉන්දීය අශ්ව වෙළෙන්දන් දෙදෙනෙකු විසිනි අවුරුදු විසිදෙකක පාලන කාලයෙන් අනතුරුව අසේල ක් රි පූ විසින් ඔවුන් පරජය කරන ලදී ඉන් අනතුරුව පැවති තවත් ආක්රමණයක් හේතුවෙන් චෝළ රජකු වූ එලාර ක් රි පූ අසේල රජු පරදවා රටෙහි පාලකයා බවට පත් විය එලාර අවුරුදු ක් රට පාලනය කළ අතර ඔහුව පරජයට පත් කරන ලද්දේ දුටුගැමුණු විසිනි කෙසේ නමුත් මහාවංශ වාර්තා වලට අනුවඑළාර විසින් රට යුක්තිගරුක ලෙස සහ සධාරණ ලෙස පාලනය කළ බව කියැවේ ක් රි පූ දී ද් රවිඩ නායකයන් පස් දෙනෙකු වූ පූලහත්ත බාහිය පනයාමර පිලියාමර දතික විසින් රට නැවතත් ආක්රමණය කරන ලදී ඔවුන් ක්රි පූ දක්වා රට පාලනය කළ අතර වළගම්භා හට පරාජයට පත් විය පසුව ඇති වූ තවත් ආක්රමණයක් නිසා රටෙහි පාලනය දකුණු ඉන්දීය පාලකයන් සය දෙනෙකු වූ පණ්ඩු පාරින්ද තිරිතර දාතිය සහ පීතිය යටතට පත් විය ධාතුසේන විසින් ඔවුන් පරදවා නැවත බලය ලබා ගන්නා ලදී වන සේන සහ වන උදය රජ සමය තුළ දකුණු ඉන්දියාවෙන් බොහෝ ආක්රමණ සහ කොල්ලකෑම් එල්ල විය කෙසේ නමුත් මෙම ආක්රමණිකයන්ගෙන් කිසිවෙකු ඔවුන්ගේ පාලනය රටෙහි දකුණු ප්රදේශය වූ රුහුණ දක්වා දීර්ඝ කර නොගත්හ එබැවින් ශ්රී ලාංකීය පාලකයන් සහ උරුමක්කාරයන් ඔවුන්ගේ හමුදාවන් මෙම ප්රදේශය තුළ සංවිධානය කොට ගෙන ඔටුන්න නැවත ලබා ගැනීමට සමත් වූහ ශ්රී ලාංකීය ඉතිහාසය මුළුල්ලේම සතුරු ආක්රමණ වලින් රට බේරා ගත් අවස්තාවලදී රුහුණ මුල් වී ඉමහත් සේවයක් කරන ලදී කිත්සිරිමෙවන් රජ සමයේදී හේමමාලා කුමරිය සහ දන්ත කුමරු විසින් බුදුන් වහන්සේගේ දන්ත ධාතුව ලංකාවට වැඩම කරවන ලදී එම රජු විසින් දන්ත ධාතුව පෙරහැරකින් වඩම්මවා මන්දිරයක තැන්පත් කරන ලදී මෙම පෙරහැර වාර්ශිකව පවත්වන ලෙස රජු අණ කල අතර අදටත් එය චාරිත්රයක් ලෙස රටෙහි පවතී බුදුන් වහන්සේගේ දන්ත ධාතුව ඉතා ඉක්මනින්ම රටෙහි පූජනීය වස්තුවක් මෙන්ම රජ්ය භාවය තහවුරු කරන සංකේතයක් බවට පත් විය දන්ත ධාතුව ළඟ තබා ගන්නා පුද්ගලයා රටෙහි නියම පාලකයා විය එමනිසා බොහෝ විට එය රජ මාළිගාවෙහිම නිදන් කොට තබන ලදී වැසි ජල කලමණාකරන තාක්ෂණය රජරට රාජධානියේ ප්රධානතම ජයග්රහණය වූයේ වැසි ජලය මනාව කලමණාකරන කලහැකි වාරිමාර්ග බිහිවීමයි ඒ හේතුවෙන් වියළි කලාපයේ කෘෂිකාර්මික අවශ්යතාවන් සඳහා ජලය සැපයීම සිදු විය මෙම වාරිමාර්ග ඉදිකිරීම් මඟින් එම යුගයේ මිනිසුන් තුළ තිබූ උසස් තාක්ෂණික හා ඉංජිනේරු හැකියාවන් මනාව පිළිඹිබු කරයි තද පැහැති අකුරු පෙළ ලක්දිව සමකාලීන රාජධානි රුහුණු රාජධානිය තිස්ස රජ මෞර්ය අධිරාජ්යයට අවනතව දේවානම් පියතිස්ස නමින් මෞර්ය සම්ප්රදායනුකූලව නැවත ඔටුනු පැළඳීමත් සමගම රජ සොහොයුරු මහානාග කුමරු රුහුණට පලාගොස් මෞර්ය අධිරාජ්යයට අවනත නොවූ රුහුණු රාජධානිය පිහිටුවාගන්නා ලදී රජරට රාජධානිය ආක්රමණියන් අතට පත් බෝහෝ අවස්ථාවලදී රුහුණු රාජධානිය බලය රැකගැනීමට ස්වදේශික සිංහලයන් සමත්විය අනුරාධපුර අතහැරීම සංස්කරණය ගින් දිගටම වූ දකුණු ඉන්දීය ආක්රමණ වලින් තැවුණු නගරය අවසානයේදී ක් රි ව දී අතහැර දැමිණ මෙම මහා නගරය ක්රි පූ වන සියවසයෙහි සිට ක් රි ව දක්වා ලංකාවේ අඟනගරය ලෙස පැවතුනි එහි පසුබැස්ම ඇරඹියේ දකුණි ඉන්දීය ආක්රමණයන්ට එරෙහිව දිගින් දිගටම වූ යුද වැදීම නිසා රාජධානිය ආර්ථිකමය අතින් දුප්පත් වීමය ක් රි ව දී චෝල අක්රමණික හමුදාව අනුරාධපුරය අතහැර ඊට සාපේක්ෂව ආරක්ෂිත පොළොන්නරුවට පරිපාලන නගරය ගෙන ගියේය නටබුන් ගවේෂණය සහ සංරක් ෂණය සංස්කරණය නගරයට සහ එහි වූ වාරී සංකීරණයට වූ අති මහත් විනාශය හේතුවෙන් එය සම්පූර්ණයෙන්ම අතහැර අවුරුදු දහසකට ආසන්න කාලයක් ජරාවාස වන්නට හැරුණි පසුව වන සතවසරේදී බ්රිතාන්ය පරිපාලනය විසින් කැළෑ හෙළි කර නැවත ජනාවාස ඇති කෙරිණි පරිපාලනය සංස්කරණය රාජධානිය රජුගේ පාලනයට යටත් විය රාජ්යත්වයට සම්බන්ධ වූ කැප කිරීමේ උත්සව සහ පිළිවෙත් ක්රමයන් ආරම්භ වූයේ දේවානම්පිය තිස්ස රජු සමයේදීය එය එලෙස සිදු වූයේ ඉන්දියාවේ අශෝක රජුගෙන් ලැබූ ආභාශය හේතු කොට ගෙනය දුටුගැමුණු රජු විසින් ප්රථම වරට මුළු රටම තමන් යටතට පත් කොටගෙන රට එක්සේසත් කරන ලදී ඔටුන්නේ හිමිකාරිත්වයෙහි අනුපිළිවෙල සිදුවූයේ පිය පරම්පරාවට අනුකූලවය එය සිදු කළ නොහැකි අවස්තාවකදී පෙර රජුගේ වැඩිමහල් සහෝදරයාට ඔටුන්නේ හිමිකාරිත්වය උරුමයෙන් ලැබුණි සහෝදරයන් නොසිටියේ නම් වැඩිමහල් පුත්රයා හට ඔටුන්න උරුම විය අනුරාධපුර රාජධානියේ ආරම්භයේ සිට පාලකයෝ සතර දෙනෙකු රාජ්යය පලනය කරන ලදහ විජයගෙන් ආරම්භ කොට සුභරාජ දක්වා සිටි පාලකයන් සාමාන්යයෙන් හැඳින්වූයේ විජයන් රජ පෙළපතට අයත් අය ලෙසයි මෙම රජ පෙළපතට අයත් වූ පණ්ඩුකාභය අනුරාධපුර රාජධානියේ ප්රථම පාලකයා විය ළඹකන්න වංශයට අයත් වසභ විසින් බලය පැහැර ගන්නා තුරු විජයන් පෙළපත පැවතුණි වසභ විසින් ඔටුන්න හිමි කර ගැනීමත් සමඟ ළඹකන්න රජ පෙළපත ආරම්භ වූ අතර එම පෙලපතට අයත් පාලකයන් සියවස් තුනකට වඩා වැඩි කාලයක් රට පාලනය කරන ලදහ නව රජ පෙළපතක් ආරම්භ වූයේ දී ධාතුසේන කාලයේදීය එය මූරිය රජ පෙළපත විය ඇතැම් ඉතිහාසඥයන් විසින් මෙම රජ පෙළපතෙහි ආරම්භය ශාඛ්ය රජු ලෙස හැඳින්වූවත් ආරම්භක රජු තවමත් අවිනිශ්චිතය අනුරාධපුර යුගයේ පැවති අවසාන රජ පෙළපත වූයේ දෙවන ළඹකන්න රජ පෙළපතයි එය මානවම්මගෙන් ආරම්භ වූ අතර අනුරාධපුර රාජධානියේ අවසාන පාලකයා වූ වන මහින්ද දක්වා පැවතුණි සියලු ප්රතිචාර බෙදා ගැනීම් යි කැමතියි අදහස",
        "සිහල දීපය සැප්තැම්බර් සියල්ලන්ට විවෘත සමඟ බෙදාගන්නා ලදී",
        "සැප්තැම්බර් සියල්ලන්ට විවෘත සමඟ බෙදාගන්නා ලදී",
        "අනුරාධපුර රාජධානිය රජරට රාජධානියේ අගනුවර ලෙස අනුරාධපුර සහ සීගිරිය පැවති යුගය අනුරාධපුර යුගය ලෙස සැලකේ අනුරාධපුර රාජධානිය අනුරාධපුර නගරයේ නමින් නම් කරන ලදී වර්ථමාන ශ් රී ලංකාවේ ප් රධන ගොඩබිම වන ලංකා දූපත හෙවත් ලක්දිව බිහිවූ ප් රථම සංවිධානාත්මක රාජධානිය වුයේ රජරට රාජධානියයි මෙම ලිපියෙහි ඉන්දික භාෂා පෙළ අඩංගුය යෝග් ය අනුවාද පහසුකම් නොමැත්තේ නම් ඔබ හට ඉන්දික භාෂා පෙළ වෙනුවට ප් රශ්නාර්ථලකුණු හෝ කොටු අස්ථානගත ස්වර හෝ දක්නට නොමැකි බැඳි දිස්විය හැකිය මුල් යුගයේ උපතිස්සනුවර අගනුවර වූ අතර පණ්ඩුකාභය රජ විසින් අනුරාධගම අගනුවර කරගෙන එය පුරවරයක් දකිවා සංවර්ධනය කරන ලදී රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්රධාන කාර්යයක් විය බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය මෙම ඉදිකිරීම් නිසා අනුරාධපුර යුගය මුළුල්ලේම රජරට ප්රදේශය තුළ විශාල එමෙන්ම සංකීර්ණ වාරිමාර්ග පද්ධතියක් බිහි විය රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්රධාන කාර්යයක් විය බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය මෙම ඉදිකිරීම් නිසා අනුරාධපුර යුගය මුළුල්ලේම රජරට ප්රදේශය තුළ විශාල එමෙන්ම සංකීර්ණ වාරිමාර්ග පද්ධතියක් බිහි විය එකල ඉදි කරන ලද මහා ස්ථුපයන් වූ රුවන්වැලිසෑය ජේතවණාරාමය මෙන්ම ලෝවාමහාපාය වැනි විශාල ගොඩනැගිලි මඟින් අනුරාධපුර යුගයේ තිබූ ගෘහ නිර්මාණ ශිල්පයේ දියුණුව මනාව පෙන්නුම් කරයි අගනුවර අනුරාධපුර ප් රධාන ලිපිය අනුරාධපුර පෞරාණික නගරය ඓතිහාසික මූලාශ්රයන්හි සඳහන් වන පරිදි අනුරාධපුර නගරය ආරම්භ වී ඇත්තේ ක් රි පූ සියවෙසහි වුවත් පුරාවිද්යාත්මක තොරතුරු අනුව එහි ඉතිහාසය ක් රි පූ වැනි සියවස තරම් ඈතට දිව යයි කරන ලද පුරා විද්යා කැණීම් වලදී වඩා පූර්ව කාලයන්හි විසූ ජනයා සම්බන්ධ සාක්ෂි ලැබී ඇතත් ක් රි පූ සියවසට එපිට කාලය පිළිබද තොරතුරු අත්තේ මද වශෙයනි අනුරාධපුරෙය් වැඩිදුර සිදු කරන ලද කැණීම් වලදී මෙම පුරවරෙය් පැවති ප්රාග් ඓතිහාසික ජනාවාසයන් පිළිබද තොරතුරු ලැබී ඇත ක් රි පූ දක්වා විහිදුණ ප්රාග් ඓතිහාසික ලෝහ යුගෙය්දී ලෝහ තාක්ෂණය කුඹල් කර්මාන්තය අහ්වයන් භාවිතය ගවයන් ඇති කිරීම සහ වී වගාවද පැවතුණ බව පෙනී යයි ක් රි පූ අතර කාලයේදී අනුරාධපුරයේ ජනාවාසය හෙක්ටයාර් ඉක්මවා වර්ධනය විය නගරය ඊසාන දිගින් සහ වයඹ දිගින් පිහිටි ප්රධාන වරායයන් අතර උපායමාර්ගිකව වැදගත් වන පරිදි පිහිටියේය වගා කළ හැකි සරු බිම් එය වටෙකාට පිහිටා තිබුණි ආක්රමණිකයන්ගෙන් නගරය ආරක්ෂා කළ ස්වභාවික පවුරක් වූ ඝන වනාන්තරය නගරය හාත්පස අවුරා විය ක් රි පූ සියවසෙහිදී පණ්ඩුකාභය රජතුමන් විසින් අනුරාධපුරය අගනගරය බවට පත් කරන ලද බවත් මනා සංවිධිත සැලසුමක් අනුව නගරය සහ එහි උප නගරයන්ද පිහිටුවන ලද බවත් කියැවේ අභය වාපි හෙවත් අභය වැවද එතුමන් විසින් කරවන ලදී කාලවේල සහ චිත්තරාජ නමැති යක්ෂයන් උදෙසා දෙවොල්ද කරවනු ලැබීය චේතියා නමැති යක්ෂණිය උදෙසා වෙළඹකගේ ස්වරූපයෙන් වූ පිළිරුවක් රාජ මාළිග පරිශ්රයේම ඉදි කරවන ලද අතර මේ සියළු යක්ෂ දේවතාවන් උදෙසා වාර්ෂිකව පුද පූජා පැවැත්වීමද සිදු විය නගරයේ සුසාන භූමිය වදක භූමිය පශ්චිම රාජිණියගේ දෙවොල වෙස්සවණ උදෙසා වූ නුග රුක ව්යාධදේව උදෙසා වූ තල් රුක යෝනයන් සඳහා වාස භූමිය ආත්ම පූජා මන්දිරය ආදිය පිහිටැවිය යුතු තැන්ද මෙතුමන් විසින් නියම කරන ලදී වහලුන් නොහොත් චණ්ඩාලයන් විසින් කළ යුතු කාර්යයන් නියම කෙරුණු අතර ඔවුන් උදෙසා ග්රාමයක් වෙන් කරන ලදී නිඝණ්ටයන් තැන තැන සරන තවුසන් ආජීවකයන් සහ බ්රාහ්මණයන් උදෙසා වාසස්ථාන ගොඩ නඟන ලදී ග්රාම සීමාද නීර්ණය කරනු ලැබීය අනුරාධපුරය අග නගරය බවට පත් කරමින් ක් රි පූ සියවස තරම් ඈත යුගයකදී පණ්ඩුකාභය රජතුමන් විසින් බිහි කරනු ලැබූ සම්ප්රදාය ඉතා වැදගත් වේ පික් පුරාණ පරිපාලණ ප් රදේශය අනුරාධපුර මධ් යතන යුගය නගරයට සහ පූජනීය ස්ථානයන්ට කරනු ලැබූ සනීපාරක්ෂක සහ පරිපාලනමය සම්පාදනයන් විසින් පෙන්නුම් කෙරෙනුයේ කාලාන්තරයක් තිසිසේ නගරය කිසියම් මධ්යගත සැලැස්මකට අනුව සංවර්ධනය කෙරුණු බවය පණ්ඩුකාභය රජතුමන්ගේ ඇවෑමෙන් එතුමන්ගේ පුත් මුටසීව රාජපදප්රාප්ත විය හැට වසරක් වූ එතුමන්ගේ රාජ්ය පාලන කාලය තුළ අනුරාධපුර නගරය තවදුරටත් අගනුවර වශයෙන් පවත්වා ගත් අතර බුදු සමය දිවයිනට හඳුන්වා දෙනු ලැබූ මුල් අවදියේදී වැදගත් කාර්යභාරයක් ඉටු කරනු ලැබූ මහාමේඝවන උද්යානය හෙවත් මහමෙවුනා උයන පිහිටුවාලීමද එසමයෙහි සිදුවිය බුදු රජාණන් වහන්සේගේ පිරිනිවන් පෑමෙන් වසර කට පසු ශ්රී ලංකාවට බුදු සමය හඳුන්වාදෙන ලද්දේ මුටසීව රජතුමන්ගේ ඇවැමෙන් රාජ්යත්වයට පත් එතුමන් පුත් දේවානම්පියතිස්ස රාජ්ය සමයෙහිදීය ඉන්දියාවෙහි වුසූ අශෝක අධිරාජයා දේවානම්පියතිස්ස රජතුමන්ගේ සමකාලීනයෙක් විය මෙම කාලය ක් රි පූ අතර කාලයයි ලංකාවෙහි රාජ්යත්වයෙහි ආරම්භය සහ ආසියාවෙහි විශිෂ්ඨතම ආගමක් වූ බුද්ධ ධර්මය මත පදනම් වූ ශිෂ්ඨාචාරයක ආරම්භයද සනිටුහන් කෙරෙන්නේ මෙසමයෙහිය සීගිරිය ප් රධාන ලිපිය සීගිරිය සීගිරිය ප් රෘඪ ඉතිහාසයකට නෑකම් කියන සිංහල දේශයේ තවත් අභිමානී නගරයක් වූ සිගිරිය අයත් වන්නේද රජරට රාජධානියටයි මෙහි පාලකයා වනුයේ කාශ් යප රජුයි කාශ් යප රජු මෙම ස්ථානය තෝරා ගැනීමට හේතුව වුයේ තම සොහොයුරු මුගලන් කුමරු කෙදිනක හෝ පැමිණ රාජ් ය පැහැරගනීයැයි තිබූ බියයි කලාගාරයක් බඳු මෙහි සීගිරි චිත් ර ඉන්දියාවේ අඡන්තා චිත් ර කලාවට සමාන කමක් දක්වයි මෙම චිත් ර පිලිබඳව අදහස් දක්වන පරණවිතානයන් පෙන්වා දෙන්නේ මෙම චිත් ර වලින් නිරූපණය වන්නේ මෙඝලතා හා චිජ්ජුලතා යන්න ය එනම් විදුලිය හා මේඝගර්ජනය යන ස්වභාවික සිදුවීම්ය මෙහි තවත් සුවිශේෂී අවධානයක් යොමුවන ස්ථානයක් ලෙස සීගිරි කැටපත් පවුර හඳුන්වාදිය හැකිය එහි ලියැවුණු කුරුටු ගී තුළින් හෙළ ගැමියාග ේ අදහස් මෙන් ම හෙළ සංස්කෘතිය පිළිබඳවද තොරතුරු හෙළිවෙබුදල්මි ආක් රමණ රජරට රාජධානියට අඛණ්ඩව පැවතුණු තර්ජනයක් වූයේ දකුණු ඉන්දීය ආක්රමණයන්ය එලෙස සිදු වූ ආක්රමණයන්ගෙන් සතුරන් පරදවා රජධානියේ පාලනය නැවත ලබාගත් දුටුගමුණු වළගම්භා ධාතුසේන වන විජයබාහු ලීලාවතී වැනි පාලකයන් කාගේත් අවධානයට ලක්විය අනෙකුත් පාලකයන් මතකයේ රැඳුනේ ඔවුන් විසින් සිදු කරන ලද හමුදා ජයග්රහණ නිසාය දකුණු ඉන්දියාවට එරෙහිව ආක්රමණයන් දියත් කළ පළවන ගජභාහු පන්ධ්යන් දේවියට පිහිට වීමට තම හමුදාවන් යැවූ දෙවන සේන එවැනි පාලකයන්ය රජරට රාජධානියට එරෙහිව ආක්රමණයන් කිහිපයක් සිදුවූ අතර ඒවා සියල්ලක්ම දියත් කරන ලද්දේ දකුණු ඉන්දියාණුවන් විසිණි ශ්රී ලංකා ඉතිහාසයේ පළමු වාර්තාගත ආක්රමණය සිදුවූයේ සූරතිස්ස ක් රි පූ රජු සමයේදීය එය සිදු කරන ලද්දේ සේන හා ගුත්තික යන දකුණු ඉන්දීය අශ්ව වෙළෙන්දන් දෙදෙනෙකු විසිනි අවුරුදු විසිදෙකක පාලන කාලයෙන් අනතුරුව අසේල ක් රි පූ විසින් ඔවුන් පරජය කරන ලදී ඉන් අනතුරුව පැවති තවත් ආක්රමණයක් හේතුවෙන් චෝළ රජකු වූ එලාර ක් රි පූ අසේල රජු පරදවා රටෙහි පාලකයා බවට පත් විය එලාර අවුරුදු ක් රට පාලනය කළ අතර ඔහුව පරජයට පත් කරන ලද්දේ දුටුගැමුණු විසිනි කෙසේ නමුත් මහාවංශ වාර්තා වලට අනුවඑළාර විසින් රට යුක්තිගරුක ලෙස සහ සධාරණ ලෙස පාලනය කළ බව කියැවේ ක් රි පූ දී ද් රවිඩ නායකයන් පස් දෙනෙකු වූ පූලහත්ත බාහිය පනයාමර පිලියාමර දතික විසින් රට නැවතත් ආක්රමණය කරන ලදී ඔවුන් ක්රි පූ දක්වා රට පාලනය කළ අතර වළගම්භා හට පරාජයට පත් විය පසුව ඇති වූ තවත් ආක්රමණයක් නිසා රටෙහි පාලනය දකුණු ඉන්දීය පාලකයන් සය දෙනෙකු වූ පණ්ඩු පාරින්ද තිරිතර දාතිය සහ පීතිය යටතට පත් විය ධාතුසේන විසින් ඔවුන් පරදවා නැවත බලය ලබා ගන්නා ලදී වන සේන සහ වන උදය රජ සමය තුළ දකුණු ඉන්දියාවෙන් බොහෝ ආක්රමණ සහ කොල්ලකෑම් එල්ල විය කෙසේ නමුත් මෙම ආක්රමණිකයන්ගෙන් කිසිවෙකු ඔවුන්ගේ පාලනය රටෙහි දකුණු ප්රදේශය වූ රුහුණ දක්වා දීර්ඝ කර නොගත්හ එබැවින් ශ්රී ලාංකීය පාලකයන් සහ උරුමක්කාරයන් ඔවුන්ගේ හමුදාවන් මෙම ප්රදේශය තුළ සංවිධානය කොට ගෙන ඔටුන්න නැවත ලබා ගැනීමට සමත් වූහ ශ්රී ලාංකීය ඉතිහාසය මුළුල්ලේම සතුරු ආක්රමණ වලින් රට බේරා ගත් අවස්තාවලදී රුහුණ මුල් වී ඉමහත් සේවයක් කරන ලදී කිත්සිරිමෙවන් රජ සමයේදී හේමමාලා කුමරිය සහ දන්ත කුමරු විසින් බුදුන් වහන්සේගේ දන්ත ධාතුව ලංකාවට වැඩම කරවන ලදී එම රජු විසින් දන්ත ධාතුව පෙරහැරකින් වඩම්මවා මන්දිරයක තැන්පත් කරන ලදී මෙම පෙරහැර වාර්ශිකව පවත්වන ලෙස රජු අණ කල අතර අදටත් එය චාරිත්රයක් ලෙස රටෙහි පවතී බුදුන් වහන්සේගේ දන්ත ධාතුව ඉතා ඉක්මනින්ම රටෙහි පූජනීය වස්තුවක් මෙන්ම රජ්ය භාවය තහවුරු කරන සංකේතයක් බවට පත් විය දන්ත ධාතුව ළඟ තබා ගන්නා පුද්ගලයා රටෙහි නියම පාලකයා විය එමනිසා බොහෝ විට එය රජ මාළිගාවෙහිම නිදන් කොට තබන ලදී වැසි ජල කලමණාකරන තාක්ෂණය රජරට රාජධානියේ ප්රධානතම ජයග්රහණය වූයේ වැසි ජලය මනාව කලමණාකරන කලහැකි වාරිමාර්ග බිහිවීමයි ඒ හේතුවෙන් වියළි කලාපයේ කෘෂිකාර්මික අවශ්යතාවන් සඳහා ජලය සැපයීම සිදු විය මෙම වාරිමාර්ග ඉදිකිරීම් මඟින් එම යුගයේ මිනිසුන් තුළ තිබූ උසස් තාක්ෂණික හා ඉංජිනේරු හැකියාවන් මනාව පිළිඹිබු කරයි තද පැහැති අකුරු පෙළ ලක්දිව සමකාලීන රාජධානි රුහුණු රාජධානිය තිස්ස රජ මෞර්ය අධිරාජ්යයට අවනතව දේවානම් පියතිස්ස නමින් මෞර්ය සම්ප්රදායනුකූලව නැවත ඔටුනු පැළඳීමත් සමගම රජ සොහොයුරු මහානාග කුමරු රුහුණට පලාගොස් මෞර්ය අධිරාජ්යයට අවනත නොවූ රුහුණු රාජධානිය පිහිටුවාගන්නා ලදී රජරට රාජධානිය ආක්රමණියන් අතට පත් බෝහෝ අවස්ථාවලදී රුහුණු රාජධානිය බලය රැකගැනීමට ස්වදේශික සිංහලයන් සමත්විය අනුරාධපුර අතහැරීම සංස්කරණය ගින් දිගටම වූ දකුණු ඉන්දීය ආක්රමණ වලින් තැවුණු නගරය අවසානයේදී ක් රි ව දී අතහැර දැමිණ මෙම මහා නගරය ක්රි පූ වන සියවසයෙහි සිට ක් රි ව දක්වා ලංකාවේ අඟනගරය ලෙස පැවතුනි එහි පසුබැස්ම ඇරඹියේ දකුණි ඉන්දීය ආක්රමණයන්ට එරෙහිව දිගින් දිගටම වූ යුද වැදීම නිසා රාජධානිය ආර්ථිකමය අතින් දුප්පත් වීමය ක් රි ව දී චෝල අක්රමණික හමුදාව අනුරාධපුරය අතහැර ඊට සාපේක්ෂව ආරක්ෂිත පොළොන්නරුවට පරිපාලන නගරය ගෙන ගියේය නටබුන් ගවේෂණය සහ සංරක් ෂණය සංස්කරණය නගරයට සහ එහි වූ වාරී සංකීරණයට වූ අති මහත් විනාශය හේතුවෙන් එය සම්පූර්ණයෙන්ම අතහැර අවුරුදු දහසකට ආසන්න කාලයක් ජරාවාස වන්නට හැරුණි පසුව වන සතවසරේදී බ්රිතාන්ය පරිපාලනය විසින් කැළෑ හෙළි කර නැවත ජනාවාස ඇති කෙරිණි පරිපාලනය සංස්කරණය රාජධානිය රජුගේ පාලනයට යටත් විය රාජ්යත්වයට සම්බන්ධ වූ කැප කිරීමේ උත්සව සහ පිළිවෙත් ක්රමයන් ආරම්භ වූයේ දේවානම්පිය තිස්ස රජු සමයේදීය එය එලෙස සිදු වූයේ ඉන්දියාවේ අශෝක රජුගෙන් ලැබූ ආභාශය හේතු කොට ගෙනය දුටුගැමුණු රජු විසින් ප්රථම වරට මුළු රටම තමන් යටතට පත් කොටගෙන රට එක්සේසත් කරන ලදී ඔටුන්නේ හිමිකාරිත්වයෙහි අනුපිළිවෙල සිදුවූයේ පිය පරම්පරාවට අනුකූලවය එය සිදු කළ නොහැකි අවස්තාවකදී පෙර රජුගේ වැඩිමහල් සහෝදරයාට ඔටුන්නේ හිමිකාරිත්වය උරුමයෙන් ලැබුණි සහෝදරයන් නොසිටියේ නම් වැඩිමහල් පුත්රයා හට ඔටුන්න උරුම විය අනුරාධපුර රාජධානියේ ආරම්භයේ සිට පාලකයෝ සතර දෙනෙකු රාජ්යය පලනය කරන ලදහ විජයගෙන් ආරම්භ කොට සුභරාජ දක්වා සිටි පාලකයන් සාමාන්යයෙන් හැඳින්වූයේ විජයන් රජ පෙළපතට අයත් අය ලෙසයි මෙම රජ පෙළපතට අයත් වූ පණ්ඩුකාභය අනුරාධපුර රාජධානියේ ප්රථම පාලකයා විය ළඹකන්න වංශයට අයත් වසභ විසින් බලය පැහැර ගන්නා තුරු විජයන් පෙළපත පැවතුණි වසභ විසින් ඔටුන්න හිමි කර ගැනීමත් සමඟ ළඹකන්න රජ පෙළපත ආරම්භ වූ අතර එම පෙලපතට අයත් පාලකයන් සියවස් තුනකට වඩා වැඩි කාලයක් රට පාලනය කරන ලදහ නව රජ පෙළපතක් ආරම්භ වූයේ දී ධාතුසේන කාලයේදීය එය මූරිය රජ පෙළපත විය ඇතැම් ඉතිහාසඥයන් විසින් මෙම රජ පෙළපතෙහි ආරම්භය ශාඛ්ය රජු ලෙස හැඳින්වූවත් ආරම්භක රජු තවමත් අවිනිශ්චිතය අනුරාධපුර යුගයේ පැවති අවසාන රජ පෙළපත වූයේ දෙවන ළඹකන්න රජ පෙළපතයි එය මානවම්මගෙන් ආරම්භ වූ අතර අනුරාධපුර රාජධානියේ අවසාන පාලකයා වූ වන මහින්ද දක්වා පැවතුණි",
        "රජරට රාජධානියේ අගනුවර ලෙස අනුරාධපුර සහ සීගිරිය පැවති යුගය අනුරාධපුර යුගය ලෙස සැලකේ අනුරාධපුර රාජධානිය අනුරාධපුර නගරයේ නමින් නම් කරන ලදී වර්ථමාන ශ් රී ලංකාවේ ප් රධන ගොඩබිම වන ලංකා දූපත හෙවත් ලක්දිව බිහිවූ ප් රථම සංවිධානාත්මක රාජධානිය වුයේ රජරට රාජධානියයි",
        "මෙම ලිපියෙහි ඉන්දික භාෂා පෙළ අඩංගුය යෝග් ය අනුවාද පහසුකම් නොමැත්තේ නම් ඔබ හට ඉන්දික භාෂා පෙළ වෙනුවට ප් රශ්නාර්ථලකුණු හෝ කොටු අස්ථානගත ස්වර හෝ දක්නට නොමැකි බැඳි දිස්විය හැකිය මුල් යුගයේ උපතිස්සනුවර අගනුවර වූ අතර පණ්ඩුකාභය රජ විසින් අනුරාධගම අගනුවර කරගෙන එය පුරවරයක් දකිවා සංවර්ධනය කරන ලදී රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්රධාන කාර්යයක් විය බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය මෙම ඉදිකිරීම් නිසා අනුරාධපුර යුගය මුළුල්ලේම රජරට ප්රදේශය තුළ විශාල එමෙන්ම සංකීර්ණ වාරිමාර්ග පද්ධතියක් බිහි විය",
        "මෙම ලිපියෙහි ඉන්දික භාෂා පෙළ අඩංගුය යෝග් ය අනුවාද පහසුකම් නොමැත්තේ නම් ඔබ හට ඉන්දික භාෂා පෙළ වෙනුවට ප් රශ්නාර්ථලකුණු හෝ කොටු අස්ථානගත ස්වර හෝ දක්නට නොමැකි බැඳි දිස්විය හැකිය",
        "මුල් යුගයේ උපතිස්සනුවර අගනුවර වූ අතර පණ්ඩුකාභය රජ විසින් අනුරාධගම අගනුවර කරගෙන එය පුරවරයක් දකිවා සංවර්ධනය කරන ලදී රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්රධාන කාර්යයක් විය බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය මෙම ඉදිකිරීම් නිසා අනුරාධපුර යුගය මුළුල්ලේම රජරට ප්රදේශය තුළ විශාල එමෙන්ම සංකීර්ණ වාරිමාර්ග පද්ධතියක් බිහි විය",
        "රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්රධාන කාර්යයක් විය බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය මෙම ඉදිකිරීම් නිසා අනුරාධපුර යුගය මුළුල්ලේම රජරට ප්රදේශය තුළ විශාල එමෙන්ම සංකීර්ණ වාරිමාර්ග පද්ධතියක් බිහි විය එකල ඉදි කරන ලද මහා ස්ථුපයන් වූ රුවන්වැලිසෑය ජේතවණාරාමය මෙන්ම ලෝවාමහාපාය වැනි විශාල ගොඩනැගිලි මඟින් අනුරාධපුර යුගයේ තිබූ ගෘහ නිර්මාණ ශිල්පයේ දියුණුව මනාව පෙන්නුම් කරයි",
        "ප් රධාන ලිපිය අනුරාධපුර පෞරාණික නගරය ඓතිහාසික මූලාශ්රයන්හි සඳහන් වන පරිදි අනුරාධපුර නගරය ආරම්භ වී ඇත්තේ ක් රි පූ සියවෙසහි වුවත් පුරාවිද්යාත්මක තොරතුරු අනුව එහි ඉතිහාසය ක් රි පූ වැනි සියවස තරම් ඈතට දිව යයි කරන ලද පුරා විද්යා කැණීම් වලදී වඩා පූර්ව කාලයන්හි විසූ ජනයා සම්බන්ධ සාක්ෂි ලැබී ඇතත් ක් රි පූ සියවසට එපිට කාලය පිළිබද තොරතුරු අත්තේ මද වශෙයනි",
        "ඓතිහාසික මූලාශ්රයන්හි සඳහන් වන පරිදි අනුරාධපුර නගරය ආරම්භ වී ඇත්තේ ක් රි පූ සියවෙසහි වුවත් පුරාවිද්යාත්මක තොරතුරු අනුව එහි ඉතිහාසය ක් රි පූ වැනි සියවස තරම් ඈතට දිව යයි කරන ලද පුරා විද්යා කැණීම් වලදී වඩා පූර්ව කාලයන්හි විසූ ජනයා සම්බන්ධ සාක්ෂි ලැබී ඇතත් ක් රි පූ සියවසට එපිට කාලය පිළිබද තොරතුරු අත්තේ මද වශෙයනි",
        "අනුරාධපුරෙය් වැඩිදුර සිදු කරන ලද කැණීම් වලදී මෙම පුරවරෙය් පැවති ප්රාග් ඓතිහාසික ජනාවාසයන් පිළිබද තොරතුරු ලැබී ඇත ක් රි පූ දක්වා විහිදුණ ප්රාග් ඓතිහාසික ලෝහ යුගෙය්දී ලෝහ තාක්ෂණය කුඹල් කර්මාන්තය අහ්වයන් භාවිතය ගවයන් ඇති කිරීම සහ වී වගාවද පැවතුණ බව පෙනී යයි ක් රි පූ අතර කාලයේදී අනුරාධපුරයේ ජනාවාසය හෙක්ටයාර් ඉක්මවා වර්ධනය විය නගරය ඊසාන දිගින් සහ වයඹ දිගින් පිහිටි ප්රධාන වරායයන් අතර උපායමාර්ගිකව වැදගත් වන පරිදි පිහිටියේය වගා කළ හැකි සරු බිම් එය වටෙකාට පිහිටා තිබුණි ආක්රමණිකයන්ගෙන් නගරය ආරක්ෂා කළ ස්වභාවික පවුරක් වූ ඝන වනාන්තරය නගරය හාත්පස අවුරා විය",
        "ක් රි පූ සියවසෙහිදී පණ්ඩුකාභය රජතුමන් විසින් අනුරාධපුරය අගනගරය බවට පත් කරන ලද බවත් මනා සංවිධිත සැලසුමක් අනුව නගරය සහ එහි උප නගරයන්ද පිහිටුවන ලද බවත් කියැවේ අභය වාපි හෙවත් අභය වැවද එතුමන් විසින් කරවන ලදී කාලවේල සහ චිත්තරාජ නමැති යක්ෂයන් උදෙසා දෙවොල්ද කරවනු ලැබීය චේතියා නමැති යක්ෂණිය උදෙසා වෙළඹකගේ ස්වරූපයෙන් වූ පිළිරුවක් රාජ මාළිග පරිශ්රයේම ඉදි කරවන ලද අතර මේ සියළු යක්ෂ දේවතාවන් උදෙසා වාර්ෂිකව පුද පූජා පැවැත්වීමද සිදු විය නගරයේ සුසාන භූමිය වදක භූමිය පශ්චිම රාජිණියගේ දෙවොල වෙස්සවණ උදෙසා වූ නුග රුක ව්යාධදේව උදෙසා වූ තල් රුක යෝනයන් සඳහා වාස භූමිය ආත්ම පූජා මන්දිරය ආදිය පිහිටැවිය යුතු තැන්ද මෙතුමන් විසින් නියම කරන ලදී වහලුන් නොහොත් චණ්ඩාලයන් විසින් කළ යුතු කාර්යයන් නියම කෙරුණු අතර ඔවුන් උදෙසා ග්රාමයක් වෙන් කරන ලදී නිඝණ්ටයන් තැන තැන සරන තවුසන් ආජීවකයන් සහ බ්රාහ්මණයන් උදෙසා වාසස්ථාන ගොඩ නඟන ලදී ග්රාම සීමාද නීර්ණය කරනු ලැබීය අනුරාධපුරය අග නගරය බවට පත් කරමින් ක් රි පූ සියවස තරම් ඈත යුගයකදී පණ්ඩුකාභය රජතුමන් විසින් බිහි කරනු ලැබූ සම්ප්රදාය ඉතා වැදගත් වේ පික් පුරාණ පරිපාලණ ප් රදේශය අනුරාධපුර මධ් යතන යුගය නගරයට සහ පූජනීය ස්ථානයන්ට කරනු ලැබූ සනීපාරක්ෂක සහ පරිපාලනමය සම්පාදනයන් විසින් පෙන්නුම් කෙරෙනුයේ කාලාන්තරයක් තිසිසේ නගරය කිසියම් මධ්යගත සැලැස්මකට අනුව සංවර්ධනය කෙරුණු බවය පණ්ඩුකාභය රජතුමන්ගේ ඇවෑමෙන් එතුමන්ගේ පුත් මුටසීව රාජපදප්රාප්ත විය හැට වසරක් වූ එතුමන්ගේ රාජ්ය පාලන කාලය තුළ අනුරාධපුර නගරය තවදුරටත් අගනුවර වශයෙන් පවත්වා ගත් අතර බුදු සමය දිවයිනට හඳුන්වා දෙනු ලැබූ මුල් අවදියේදී වැදගත් කාර්යභාරයක් ඉටු කරනු ලැබූ මහාමේඝවන උද්යානය හෙවත් මහමෙවුනා උයන පිහිටුවාලීමද එසමයෙහි සිදුවිය බුදු රජාණන් වහන්සේගේ පිරිනිවන් පෑමෙන් වසර කට පසු ශ්රී ලංකාවට බුදු සමය හඳුන්වාදෙන ලද්දේ මුටසීව රජතුමන්ගේ ඇවැමෙන් රාජ්යත්වයට පත් එතුමන් පුත් දේවානම්පියතිස්ස රාජ්ය සමයෙහිදීය ඉන්දියාවෙහි වුසූ අශෝක අධිරාජයා දේවානම්පියතිස්ස රජතුමන්ගේ සමකාලීනයෙක් විය මෙම කාලය ක් රි පූ අතර කාලයයි ලංකාවෙහි රාජ්යත්වයෙහි ආරම්භය සහ ආසියාවෙහි විශිෂ්ඨතම ආගමක් වූ බුද්ධ ධර්මය මත පදනම් වූ ශිෂ්ඨාචාරයක ආරම්භයද සනිටුහන් කෙරෙන්නේ මෙසමයෙහිය",
        "සීගිරිය ප් රෘඪ ඉතිහාසයකට නෑකම් කියන සිංහල දේශයේ තවත් අභිමානී නගරයක් වූ සිගිරිය අයත් වන්නේද රජරට රාජධානියටයි මෙහි පාලකයා වනුයේ කාශ් යප රජුයි කාශ් යප රජු මෙම ස්ථානය තෝරා ගැනීමට හේතුව වුයේ තම සොහොයුරු මුගලන් කුමරු කෙදිනක හෝ පැමිණ රාජ් ය පැහැරගනීයැයි තිබූ බියයි කලාගාරයක් බඳු මෙහි සීගිරි චිත් ර ඉන්දියාවේ අඡන්තා චිත් ර කලාවට සමාන කමක් දක්වයි මෙම චිත් ර පිලිබඳව අදහස් දක්වන පරණවිතානයන් පෙන්වා දෙන්නේ මෙම චිත් ර වලින් නිරූපණය වන්නේ මෙඝලතා හා චිජ්ජුලතා යන්න ය එනම් විදුලිය හා මේඝගර්ජනය යන ස්වභාවික සිදුවීම්ය මෙහි තවත් සුවිශේෂී අවධානයක් යොමුවන ස්ථානයක් ලෙස සීගිරි කැටපත් පවුර හඳුන්වාදිය හැකිය එහි ලියැවුණු කුරුටු ගී තුළින් හෙළ ගැමියාග ේ අදහස් මෙන් ම හෙළ සංස්කෘතිය පිළිබඳවද තොරතුරු හෙළිවෙබුදල්මි",
        "රජරට රාජධානියට අඛණ්ඩව පැවතුණු තර්ජනයක් වූයේ දකුණු ඉන්දීය ආක්රමණයන්ය එලෙස සිදු වූ ආක්රමණයන්ගෙන් සතුරන් පරදවා රජධානියේ පාලනය නැවත ලබාගත් දුටුගමුණු වළගම්භා ධාතුසේන වන විජයබාහු ලීලාවතී වැනි පාලකයන් කාගේත් අවධානයට ලක්විය අනෙකුත් පාලකයන් මතකයේ රැඳුනේ ඔවුන් විසින් සිදු කරන ලද හමුදා ජයග්රහණ නිසාය දකුණු ඉන්දියාවට එරෙහිව ආක්රමණයන් දියත් කළ පළවන ගජභාහු පන්ධ්යන් දේවියට පිහිට වීමට තම හමුදාවන් යැවූ දෙවන සේන එවැනි පාලකයන්ය රජරට රාජධානියට එරෙහිව ආක්රමණයන් කිහිපයක් සිදුවූ අතර ඒවා සියල්ලක්ම දියත් කරන ලද්දේ දකුණු ඉන්දියාණුවන් විසිණි ශ්රී ලංකා ඉතිහාසයේ පළමු වාර්තාගත ආක්රමණය සිදුවූයේ සූරතිස්ස ක් රි පූ රජු සමයේදීය එය සිදු කරන ලද්දේ සේන හා ගුත්තික යන දකුණු ඉන්දීය අශ්ව වෙළෙන්දන් දෙදෙනෙකු විසිනි අවුරුදු විසිදෙකක පාලන කාලයෙන් අනතුරුව අසේල ක් රි පූ විසින් ඔවුන් පරජය කරන ලදී ඉන් අනතුරුව පැවති තවත් ආක්රමණයක් හේතුවෙන් චෝළ රජකු වූ එලාර ක් රි පූ අසේල රජු පරදවා රටෙහි පාලකයා බවට පත් විය එලාර අවුරුදු ක් රට පාලනය කළ අතර ඔහුව පරජයට පත් කරන ලද්දේ දුටුගැමුණු විසිනි කෙසේ නමුත් මහාවංශ වාර්තා වලට අනුවඑළාර විසින් රට යුක්තිගරුක ලෙස සහ සධාරණ ලෙස පාලනය කළ බව කියැවේ",
        "ක් රි පූ දී ද් රවිඩ නායකයන් පස් දෙනෙකු වූ පූලහත්ත බාහිය පනයාමර පිලියාමර දතික",
        "විසින් රට නැවතත් ආක්රමණය කරන ලදී ඔවුන් ක්රි පූ දක්වා රට පාලනය කළ අතර වළගම්භා හට පරාජයට පත් විය පසුව ඇති වූ තවත් ආක්රමණයක් නිසා රටෙහි පාලනය දකුණු ඉන්දීය පාලකයන් සය දෙනෙකු වූ පණ්ඩු පාරින්ද තිරිතර දාතිය සහ පීතිය යටතට පත් විය ධාතුසේන විසින් ඔවුන් පරදවා නැවත බලය ලබා ගන්නා ලදී වන සේන සහ වන උදය රජ සමය තුළ දකුණු ඉන්දියාවෙන් බොහෝ ආක්රමණ සහ කොල්ලකෑම් එල්ල විය",
        "කෙසේ නමුත් මෙම ආක්රමණිකයන්ගෙන් කිසිවෙකු ඔවුන්ගේ පාලනය රටෙහි දකුණු ප්රදේශය වූ රුහුණ දක්වා දීර්ඝ කර නොගත්හ එබැවින් ශ්රී ලාංකීය පාලකයන් සහ උරුමක්කාරයන් ඔවුන්ගේ හමුදාවන් මෙම ප්රදේශය තුළ සංවිධානය කොට ගෙන ඔටුන්න නැවත ලබා ගැනීමට සමත් වූහ ශ්රී ලාංකීය ඉතිහාසය මුළුල්ලේම සතුරු ආක්රමණ වලින් රට බේරා ගත් අවස්තාවලදී රුහුණ මුල් වී ඉමහත් සේවයක් කරන ලදී",
        "කිත්සිරිමෙවන් රජ සමයේදී හේමමාලා කුමරිය සහ දන්ත කුමරු විසින් බුදුන් වහන්සේගේ දන්ත ධාතුව ලංකාවට වැඩම කරවන ලදී එම රජු විසින් දන්ත ධාතුව පෙරහැරකින් වඩම්මවා මන්දිරයක තැන්පත් කරන ලදී මෙම පෙරහැර වාර්ශිකව පවත්වන ලෙස රජු අණ කල අතර අදටත් එය චාරිත්රයක් ලෙස රටෙහි පවතී බුදුන් වහන්සේගේ දන්ත ධාතුව ඉතා ඉක්මනින්ම රටෙහි පූජනීය වස්තුවක් මෙන්ම රජ්ය භාවය තහවුරු කරන සංකේතයක් බවට පත් විය දන්ත ධාතුව ළඟ තබා ගන්නා පුද්ගලයා රටෙහි නියම පාලකයා විය එමනිසා බොහෝ විට එය රජ මාළිගාවෙහිම නිදන් කොට තබන ලදී",
        "රජරට රාජධානියේ ප්රධානතම ජයග්රහණය වූයේ වැසි ජලය මනාව කලමණාකරන කලහැකි වාරිමාර්ග බිහිවීමයි ඒ හේතුවෙන් වියළි කලාපයේ කෘෂිකාර්මික අවශ්යතාවන් සඳහා ජලය සැපයීම සිදු විය මෙම වාරිමාර්ග ඉදිකිරීම් මඟින් එම යුගයේ මිනිසුන් තුළ තිබූ උසස් තාක්ෂණික හා ඉංජිනේරු හැකියාවන් මනාව පිළිඹිබු කරයි"
      ],
      "fetch_time": 1.3455801010131836,
      "error": null
    },
    {
      "url": "https://si.wikipedia.org/wiki/%E0%B6%85%E0%B6%B1%E0%B7%94%E0%B6%BB%E0%B7%8F%E0%B6%B0%E0%B6%B4%E0%B7%94%E0%B6%BB_%E0%B6%BA%E0%B7%94%E0%B6%9C%E0%B6%BA",
      "title": "අනුරාධපුර යුගය - විකිපීඩියා",
      "snippet": "රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්‍රධාන කාර්යයක් විය. බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර, ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය.",
      "paragraphs": [
        "විකිපීඩියා වෙතින් ප්රධාන ලිපියන් ශ්රී ලංකාවේ අතීතය සහ අනුරාධපුර රාජධානිය සැකිල්ල ලක්දිව අතීත රාජ්ය ඉන්දික භාෂා අක්ෂර අඩංගු යි රජරට රාජධානියේ රජරට රාජධානියේ අගනුවර ලෙස අනුරාධපුර සහ සීගිරිය පැවති යුගය අනුරාධපුර යුගය ලෙස සැලකේ අනුරාධපුර රාජධානිය ක්රි පූ අනුරාධපුර නගරය නමින් නම් කරන ලදී වර්ථමාන ශ්රී ලංකාවේ ප්රධාන ගොඩබිම වන ලංකා දූපත හෙවත් ලක්දිව බිහිවූ ප්රථම සංවිධානාත්මක රාජධානිය වුයේ රජරට රාජධානියයි මුල් යුගයේ උපතිස්සනුවර අගනුවර වූ අතර පණ්ඩුකාභය රජ විසින් අනුරාධගම අගනුවර කරගෙන එය පුරවරයක් දකිවා සංවර්ධනය කරන ලදී රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්රධාන කාර්යයක් විය බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය මෙම ඉදිකිරීම් නිසා අනුරාධපුර යුගය මුළුල්ලේම රජරට ප්රදේශය තුළ විශාල එමෙන්ම සංකීර්ණ වාරිමාර්ග පද්ධතියක් බිහි විය රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්රධාන කාර්යයක් විය බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය මෙම ඉදිකිරීම් නිසා අනුරාධපුර යුගය මුළුල්ලේම රජරට ප්රදේශය තුළ විශාල එමෙන්ම සංකීර්ණ වාරිමාර්ග පද්ධතියක් බිහි විය එකල ඉදි කරන ලද මහා ස්ථුපයන් වූ රුවන්වැලිසෑය ජේතවණාරාමය මෙන්ම ලෝවාමහාපාය වැනි විශාල ගොඩනැගිලි මඟින් අනුරාධපුර යුගයේ තිබූ ගෘහ නිර්මාණ ශිල්පයේ දියුණුව මනාව පෙන්නුම් කරයි අගනුවර සංස්කරණය අනුරාධපුර සංස්කරණය ප්රධාන ලිපිය අනුරාධපුර පෞරාණික නගරය ඓතිහාසික මූලාශ්රයන්හි සඳහන් වන පරිදි අනුරාධපුර නගරය ආරම්භ වී ඇත්තේ ක්රි පූ සියවෙසහි වුවත් පුරාවිද්යාත්මක තොරතුරු අනුව එහි ඉතිහාසය ක්රි පූ වැනි සියවස තරම් ඈතට දිව යයි කරන ලද පුරා විද්යා කැණීම් වලදී වඩා පූර්ව කාලයන්හි විසූ ජනයා සම්බන්ධ සාක්ෂි ලැබී ඇතත් ක්රි පූ සියවසට එපිට කාලය පිළිබද තොරතුරු අත්ෙත් මද වශෙයනි අනුරාධපුරෙය් වැඩිදුර සිදු කරන ලද කැණීම් වලදී මෙම පුරවරෙය් පැවති ප්රාග් ඓතිහාසික ජනාවාසයන් පිළිබද තොරතුරු ලැබී ඇත ක්රි පූ දක්වා විහිදුණ ප්රාග් ඓතිහාසික ලෝහ යුගෙය්දී ලෝහ තාක්ෂණය කුඹල් කර්මාන්තය අහ්වයන් භාවිතය ගවයන් ඇති කිරීම සහ වී වගාවද පැවතුණ බව පෙනී යයි ක්රි පූ අතර කාලයේදී අනුරාධපුරයේ ජනාවාසය හෙක්ටයාර් ඉක්මවා වර්ධනය විය නගරය ඊසාන දිගින් සහ වයඹ දිගින් පිහිටි ප්රධාන වරායයන් අතර උපායමාර්ගිකව වැදගත් වන පරිදි පිහිටියේය වගා කළ හැකි සරු බිම් එය වටෙකාට පිහිටා තිබුණි ආක්රමණිකයන්ගෙන් නගරය ආරක්ෂා කළ ස්වභාවික පවුරක් වූ ඝන වනාන්තරය නගරය හාත්පස අවුරා විය ක්රි පූ සියවසෙහිදී පණ්ඩුකාභය රජතුමන් විසින් අනුරාධපුරය අගනගරය බවට පත් කරන ලද බවත් මනා සංවිධිත සැලසුමක් අනුව නගරය සහ එහි උප නගරයන්ද පිහිටුවන ලද බවත් කියැවේ අභය වාපි හෙවත් අභය වැවද එතුමන් විසින් කරවන ලදී කාලවේල සහ චිත්තරාජ නමැති යක්ෂයන් උදෙසා දෙවොල්ද කරවනු ලැබීය චේතියා නමැති යක්ෂණිය උදෙසා වෙළඹකගේ ස්වරූපයෙන් වූ පිළිරුවක් රාජ මාළිග පරිශ්රයේම ඉදි කරවන ලද අතර මේ සියළු යක්ෂ දේවතාවන් උදෙසා වාර්ෂිකව පුද පූජා පැවැත්වීමද සිදු විය නගරයේ සුසාන භූමිය වදක භූමිය පශ්චිම රාජිණියගේ දෙවොල වෙස්සවණ උදෙසා වූ නුග රුක ව්යාධදේව උදෙසා වූ තල් රුක යෝනයන් සඳහා වාස භූමිය ආත්ම පූජා මන්දිරය ආදිය පිහිටැවිය යුතු තැන්ද මෙතුමන් විසින් නියම කරන ලදී වහලුන් නොහොත් චණ්ඩාලයන් විසින් කළ යුතු කාර්යයන් නියම කෙරුණු අතර ඔවුන් උදෙසා ග්රාමයක් වෙන් කරන ලදී නිඝණ්ටයන් තැන තැන සරන තවුසන් ආජීවකයන් සහ බ්රාහ්මණයන් උදෙසා වාසස්ථාන ගොඩ නඟන ලදී ග්රාම සීමාද නීර්ණය කරනු ලැබීය අනුරාධපුරය අග නගරය බවට පත් කරමින් ක්රි පූ සියවස තරම් ඈත යුගයකදී පණ්ඩුකාභය රජතුමන් විසින් බිහි කරනු ලැබූ සම්ප්රදාය ඉතා වැදගත් වේ පික් පුරාණ පරිපාලණ ප්රදේශය අනුරාධපුර මධ්යතන යුගය නගරයට සහ පූජනීය ස්ථානයන්ට කරනු ලැබූ සනීපාරක්ෂක සහ පරිපාලනමය සම්පාදනයන් විසින් පෙන්නුම් කෙරෙනුයේ කාලාන්තරයක් තිසිසේ නගරය කිසියම් මධ්යගත සැලැස්මකට අනුව සංවර්ධනය කෙරුණු බවය පණ්ඩුකාභය රජතුමන්ගේ ඇවෑමෙන් එතුමන්ගේ පුත් මුටසීව රාජපදප්රාප්ත විය හැට වසරක් වූ එතුමන්ගේ රාජ්ය පාලන කාලය තුළ අනුරාධපුර නගරය තවදුරටත් අගනුවර වශයෙන් පවත්වා ගත් අතර බුදු සමය දිවයිනට හඳුන්වා දෙනු ලැබූ මුල් අවදියේදී වැදගත් කාර්යභාරයක් ඉටු කරනු ලැබූ මහාමේඝවන උද්යානය හෙවත් මහමෙවුනා උයන පිහිටුවාලීමද එසමයෙහි සිදුවිය බුදු රජාණන් වහන්සේගේ පිරිනිවන් පෑමෙන් වසර කට පසු ශ්රී ලංකාවට බුදු සමය හඳුන්වාදෙන ලද්දේ මුටසීව රජතුමන්ගේ ඇවැමෙන් රාජ්යත්වයට පත් එතුමන් පුත් දේවානම්පියතිස්ස රාජ්ය සමයෙහිදීය ඉන්දියාවෙහි වුසූ අශෝක අධිරාජයා දේවානම්පියතිස්ස රජතුමන්ගේ සමකාලීනයෙක් විය මෙම කාලය ක්රි පූ අතර කාලයයි ලංකාවෙහි රාජ්යත්වයෙහි ආරම්භය සහ ආසියාවෙහි විශිෂ්ඨතම ආගමක් වූ බුද්ධ ධර්මය මත පදනම් වූ ශිෂ්ඨාචාරයක ආරම්භයද සනිටුහන් කෙරෙන්නේ මෙසමයෙහිය සීගිරිය සංස්කරණය ප්රධාන ලිපිය සීගිරිය සීගිරිය ප්රෞඪ ඉතිහාසයකට නෑකම් කියන සිංහල දේශයේ තවත් අභිමානී නගරයක් වූ සිගිරිය අයත් වන්නේද රජරට රාජධානියටයි මෙහි පාලකයා වනුයේ කාශ්යප රජුයි කාශ්යප රජු මෙම ස්ථානය තෝරා ගැනීමට හේතුව වුයේ තම සොහොයුරු මුගලන් කුමරු කෙදිනක හෝ පැමිණ රාජ්ය පැහැරගනීයැයි තිබූ බියයි කලාගාරයක් බඳු මෙහි සීගිරි චිත්ර ඉන්දියාවේ අඡන්තා චිත්ර කලාවට සමාන කමක් දක්වයි මෙම චිත්ර පිලිබඳව අදහස් දක්වන පරණවිතානයන් පෙන්වා දෙන්නේ මෙම චිත්ර වලින් නිරූපණය වන්නේ මෙඝලතා හා චිජ්ජුලතා යන්න ය එනම් විදුලිය හා මේඝගර්ජනය යන ස්වභාවික සිදුවීම්ය මෙහි තවත් සුවිශේෂී අවධානයක් යොමුවන ස්ථානයක් ලෙස සීගිරි කැටපත් පවුර හඳුන්වාදිය හැකිය එහි ලියැවුණු කුරුටු ගී තුළින් හෙළ ගැමියාගේ අදහස් මෙන් ම හෙළ සංස්කෘතිය පිළිබඳවද තොරතුරු හෙළිවේ ආක්රමණ සංස්කරණය රජරට රාජධානියට අඛණ්ඩව පැවතුණු තර්ජනයක් වූයේ දකුණු ඉන්දීය ආක්රමණයන්ය එලෙස සිදු වූ ආක්රමණයන්ගෙන් සතුරන් පරදවා රජධානියේ පාලනය නැවත ලබාගත් දුටුගමුණු වළගම්භා ධාතුසේන වන විජයබාහු ලීලාවතී වැනි පාලකයන් කාගේත් අවධානයට ලක්විය අනෙකුත් පාලකයන් මතකයේ රැඳුනේ ඔවුන් විසින් සිදු කරන ලද හමුදා ජයග්රහණ නිසාය දකුණු ඉන්දියාවට එරෙහිව ආක්රමණයන් දියත් කළ පළවන ගජභාහු පන්ධ්යන් දේවියට පිහිට වීමට තම හමුදාවන් යැවූ දෙවන සේන එවැනි පාලකයන්ය රජරට රාජධානියට එරෙහිව ආක්රමණයන් කිහිපයක් සිදුවූ අතර ඒවා සියල්ලක්ම දියත් කරන ලද්දේ දකුණු ඉන්දියාණුවන් විසිණි ශ්රී ලංකා ඉතිහාසයේ පළමු වාර්තාගත ආක්රමණය සිදුවූයේ සූරතිස්ස ක්රි පූ රජු සමයේදීය එය සිදු කරන ලද්දේ සේන හා ගුත්තික යන දකුණු ඉන්දීය අශ්ව වෙළෙන්දන් දෙදෙනෙකු විසිනි අවුරුදු විසිදෙකක පාලන කාලයෙන් අනතුරුව අසේල ක්රි පූ විසින් ඔවුන් පරජය කරන ලදී ඉන් අනතුරුව පැවති තවත් ආක්රමණයක් හේතුවෙන් චෝළ රජකු වූ එලාර ක්රි පූ අසේල රජු පරදවා රටෙහි පාලකයා බවට පත් විය එලාර අවුරුදු ක් රට පාලනය කළ අතර ඔහුව පරජයට පත් කරන ලද්දේ දුටුගැමුණු විසිනි කෙසේ නමුත් මහාවංශ වාර්තා වලට අනුව එළාර විසින් රට යුක්තිගරුක ලෙස සහ සධාරණ ලෙස පාලනය කළ බව කියැවේ ක්රි පූ දී ද්රවිඩ නායකයන් පස් දෙනෙකු වූ පූලහත්ත බාහිය පනයාමර පිලියාමර දතික විසින් රට නැවතත් ආක්රමණය කරන ලදී ඔවුන් ක්රි පූ දක්වා රට පාලනය කළ අතර වළගම්භා හට පරාජයට පත් විය පසුව ඇති වූ තවත් ආක්රමණයක් නිසා රටෙහි පාලනය දකුණු ඉන්දීය පාලකයන් සය දෙනෙකු වූ පණ්ඩු පාරින්ද තිරිතර දාතිය සහ පීතිය යටතට පත් විය ධාතුසේන විසින් ඔවුන් පරදවා නැවත බලය ලබා ගන්නා ලදී වන සේන ක්රි පූ සහ වන උදය ක්රි පූ රජ සමය තුළ දකුණු ඉන්දියාවෙන් බොහෝ ආක්රමණ සහ කොල්ලකෑම් එල්ල විය කෙසේ නමුත් මෙම ආක්රමණිකයන්ගෙන් කිසිවෙකු ඔවුන්ගේ පාලනය රටෙහි දකුණු ප්රදේශය වූ රුහුණ දක්වා දීර්ඝ කර නොගත්හ එබැවින් ශ්රී ලාංකීය පාලකයන් සහ උරුමක්කාරයන් ඔවුන්ගේ හමුදාවන් මෙම ප්රදේශය තුළ සංවිධානය කොට ගෙන ඔටුන්න නැවත ලබා ගැනීමට සමත් වූහ ශ්රී ලාංකීය ඉතිහාසය මුළුල්ලේම සතුරු ආක්රමණ වලින් රට බේරා ගත් අවස්තාවලදී රුහුණ මුල් වී ඉමහත් සේවයක් කරන ලදී කිත්සිරිමෙවන් රජ සමයේදී හේමමාලා කුමරිය සහ දන්ත කුමරු විසින් බුදුන් වහන්සේගේ දන්ත ධාතුව ලංකාවට වැඩම කරවන ලදී එම රජු විසින් දන්ත ධාතුව පෙරහැරකින් වඩම්මවා මන්දිරයක තැන්පත් කරන ලදී මෙම පෙරහැර වාර්ශිකව පවත්වන ලෙස රජු අණ කල අතර අදටත් එය චාරිත්රයක් ලෙස රටෙහි පවතී බුදුන් වහන්සේගේ දන්ත ධාතුව ඉතා ඉක්මනින්ම රටෙහි පූජනීය වස්තුවක් මෙන්ම රජ්ය භාවය තහවුරු කරන සංකේතයක් බවට පත් විය දන්ත ධාතුව ළඟ තබා ගන්නා පුද්ගලයා රටෙහි නියම පාලකයා විය එමනිසා බොහෝ විට එය රජ මාළිගාවෙහිම නිදන් කොට තබන ලදී වැසි ජල කලමණාකරන තාක්ෂණය රජරට රාජධානියේ ප්රධානතම ජයග්රහණය වූයේ වැසි ජලය මනාව කලමණාකරන කලහැකි වාරිමාර්ග බිහිවීමයි ඒ හේතුවෙන් වියළි කලාපයේ කෘෂිකාර්මික අවශ්යතාවන් සඳහා ජලය සැපයීම සිදු විය මෙම වාරිමාර්ග ඉදිකිරීම් මඟින් එම යුගයේ මිනිසුන් තුළ තිබූ උසස් තාක්ෂණික හා ඉංජිනේරු හැකියාවන් මනාව පිළිඹිබු කරයි තද පැහැති අකුරු පෙළ ලක්දිව සමකාලීන රාජධානි රුහුණු රාජධානිය සංස්කරණය ප්රධාන ලිපිය රුහුණු රාජධානිය තිස්ස රජ මෞර්ය අධිරාජ්යයට අවනතව දේවානම් පියතිස්ස නමින් මෞර්ය සම්ප්රදායනුකූලව නැවත ඔටුනු පැළඳීමත් සමගම රජ සොහොයුරු මහානාග කුමරු රුහුණට පලාගොස් මෞර්ය අධිරාජ්යයට අවනත නොවූ රුහුණු රාජධානිය පිහිටුවාගන්නා ලදී රජරට රාජධානිය ආක්රමණියන් අතට පත් බෝහෝ අවස්ථාවලදී රුහුණු රාජධානිය බලය රැකගැනීමට ස්වදේශික සිංහලයන් සමත්විය අනුරාධපුර අතහැරීම සංස්කරණය දිගින් දිගටම වූ දකුණු ඉන්දීය ආක්රමණ වලින් තැවුණු නගරය අවසානයේදී ක්රි ව දී අතහැර දැමිණ මෙම මහා නගරය ක්රි පූ වන සියවසයෙහි සිට ක්රි ව දක්වා ලංකාවේ අඟනගරය ලෙස පැවතුනි එහි පසුබැස්ම ඇරඹියේ දකුණි ඉන්දීය ආක්රමණයන්ට එරෙහිව දිගින් දිගටම වූ යුද වැදීම නිස රාජධානිය ආර්ථිකමය අතින් දුප්පත් වීමය ක්රි ව දී චෝල අක්රමණික හමුදාව අනුරාධපුරය අතහැර ඊට සාපේක්ෂව ආරක්ෂිත පොළොන්නරුවට පරිපාලන නගරය ගෙන ගියේය නටබුන් ගවේෂණය සහ සංරක්ෂණය සංස්කරණය නගරයට සහ එහි වූ වාරී සංකීරණයට වූ අති මහත් විනාශය හේතුවෙන් එය සම්පූර්ණයෙන්ම අතහැර අවුරුදු දහසකට ආසන්න කාලයක් ජරාවාස වන්නට හැරුණි පසුව වන සතවසරේදී බ්රිතාන්ය පරිපාලනය විසින් කැළෑ හෙළි කර නැවත ජනාවාස ඇති කෙරිණි පරිපාලනය සංස්කරණය රාජධානිය රජුගේ පාලනයට යටත් විය රාජ්යත්වයට සම්බන්ධ වූ කැප කිරීමේ උත්සව සහ පිළිවෙත් ක්රමයන් ආරම්භ වූයේ දේවානම්පිය තිස්ස රජු සමයේදීය එය එලෙස සිදු වූයේ ඉන්දියාවේ අශෝක රජුගෙන් ලැබූ ආභාශය හේතු කොට ගෙනය දුටුගැමුණු රජු විසින් ප්රථම වරට මුළු රටම තමන් යටතට පත් කොටගෙන රට එක්සේසත් කරන ලදී ඔටුන්නේ හිමිකාරිත්වයෙහි අනුපිළිවෙල සිදුවූයේ පිය පරම්පරාවට අනුකූලවය එය සිදු කළ නොහැකි අවස්තාවකදී පෙර රජුගේ වැඩිමහල් සහෝදරයාට ඔටුන්නේ හිමිකාරිත්වය උරුමයෙන් ලැබුණි සහෝදරයන් නොසිටියේ නම් වැඩිමහල් පුත්රයා හට ඔටුන්න උරුම විය අනුරාධපුර රාජධානියේ ආරම්භයේ සිට පාලකයෝ සතර දෙනෙකු රාජ්යය පලනය කරන ලදහ විජයගෙන් ආරම්භ කොට සුභරාජ දක්වා සිටි පාලකයන් සාමාන්යයෙන් හැඳින්වූයේ විජයන් රජ පෙළපතට අයත් අය ලෙසයි මෙම රජ පෙළපතට අයත් වූ පණ්ඩුකාභය අනුරාධපුර රාජධානියේ ප්රථම පාලකයා විය ළඹකන්න වංශයට අයත් වසභ විසින් බලය පැහැර ගන්නා තුරු විජයන් පෙළපත පැවතුණි වසභ විසින් ඔටුන්න හිමි කර ගැනීමත් සමඟ ළඹකන්න රජ පෙළපත ආරම්භ වූ අතර එම පෙලපතට අයත් පාලකයන් සියවස් තුනකට වඩා වැඩි කාලයක් රට පාලනය කරන ලදහ නව රජ පෙළපතක් ආරම්භ වූයේ දී ධාතුසේන කාලයේදීය එය මූරිය රජ පෙළපත විය ඇතැම් ඉතිහාසඥයන් විසින් මෙම රජ පෙළපතෙහි ආරම්භය ශාඛ්ය රජු ලෙස හැඳින්වූවත් ආරම්භක රජු තවමත් අවිනිශ්චිතය අනුරාධපුර යුගයේ පැවති අවසාන රජ පෙළපත වූයේ දෙවන ළඹකන්න රජ පෙළපතයි එය මානවම්මගෙන් ආරම්භ වූ අතර අනුරාධපුර රාජධානියේ අවසාන පාලකයා වූ වන මහින්ද දක්වා පැවතුණි ආර්ථීකය සංස්කරණය සංස්කෘතිය සංස්කරණය සටහන් සංස්කරණය උපහරණ සංස්කරණය ආශ්රිත සංස්කරණය බණ්ඩාරනායක සේනක සීගිරිය මධ්යම සංස්කෘතික අරමුදල බස්නායක එච් ටී ශ්රී ලංකන් මොනාස්ටික් ආකිටෙක්චර් ශ්රී සත්ගුරු ප්රකාශන බ්ලේස් එල් ඊ ද ස්ටෝරි ඔෆ් ලංකා ඒෂියන් එඩියුකේෂනල් සර්විසර්ස් කොඩ්රිංටන් එච් ඩබ් සිලෝන් කොයින්ස් ඇන්ඩ් කරන්සි ඒෂියන් එඩියුකේෂනල් සර්විසර්ස් අනුරාධපුර යුගය වෙතින් සම්ප්රවේශනය කෙරිණි ප්රවර්ග වසර දී විසංස්ථාපිත රාජ්යයන් හා බල ප්රදේශ රජරට රාජධානිය ශ්රී ලංකාවේ ඉතිහාසය ක්රිපූ දී සංස්ථාපිත රාජ්යයන් හා බල ප්රදේශ අනුරාධපුර යුගය අනුරාධපුර",
        "ප්රධාන ලිපියන් ශ්රී ලංකාවේ අතීතය සහ අනුරාධපුර රාජධානිය සැකිල්ල ලක්දිව අතීත රාජ්ය ඉන්දික භාෂා අක්ෂර අඩංගු යි රජරට රාජධානියේ රජරට රාජධානියේ අගනුවර ලෙස අනුරාධපුර සහ සීගිරිය පැවති යුගය අනුරාධපුර යුගය ලෙස සැලකේ අනුරාධපුර රාජධානිය ක්රි පූ අනුරාධපුර නගරය නමින් නම් කරන ලදී වර්ථමාන ශ්රී ලංකාවේ ප්රධාන ගොඩබිම වන ලංකා දූපත හෙවත් ලක්දිව බිහිවූ ප්රථම සංවිධානාත්මක රාජධානිය වුයේ රජරට රාජධානියයි මුල් යුගයේ උපතිස්සනුවර අගනුවර වූ අතර පණ්ඩුකාභය රජ විසින් අනුරාධගම අගනුවර කරගෙන එය පුරවරයක් දකිවා සංවර්ධනය කරන ලදී රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්රධාන කාර්යයක් විය බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය මෙම ඉදිකිරීම් නිසා අනුරාධපුර යුගය මුළුල්ලේම රජරට ප්රදේශය තුළ විශාල එමෙන්ම සංකීර්ණ වාරිමාර්ග පද්ධතියක් බිහි විය රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්රධාන කාර්යයක් විය බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය මෙම ඉදිකිරීම් නිසා අනුරාධපුර යුගය මුළුල්ලේම රජරට ප්රදේශය තුළ විශාල එමෙන්ම සංකීර්ණ වාරිමාර්ග පද්ධතියක් බිහි විය එකල ඉදි කරන ලද මහා ස්ථුපයන් වූ රුවන්වැලිසෑය ජේතවණාරාමය මෙන්ම ලෝවාමහාපාය වැනි විශාල ගොඩනැගිලි මඟින් අනුරාධපුර යුගයේ තිබූ ගෘහ නිර්මාණ ශිල්පයේ දියුණුව මනාව පෙන්නුම් කරයි අගනුවර සංස්කරණය අනුරාධපුර සංස්කරණය ප්රධාන ලිපිය අනුරාධපුර පෞරාණික නගරය ඓතිහාසික මූලාශ්රයන්හි සඳහන් වන පරිදි අනුරාධපුර නගරය ආරම්භ වී ඇත්තේ ක්රි පූ සියවෙසහි වුවත් පුරාවිද්යාත්මක තොරතුරු අනුව එහි ඉතිහාසය ක්රි පූ වැනි සියවස තරම් ඈතට දිව යයි කරන ලද පුරා විද්යා කැණීම් වලදී වඩා පූර්ව කාලයන්හි විසූ ජනයා සම්බන්ධ සාක්ෂි ලැබී ඇතත් ක්රි පූ සියවසට එපිට කාලය පිළිබද තොරතුරු අත්ෙත් මද වශෙයනි අනුරාධපුරෙය් වැඩිදුර සිදු කරන ලද කැණීම් වලදී මෙම පුරවරෙය් පැවති ප්රාග් ඓතිහාසික ජනාවාසයන් පිළිබද තොරතුරු ලැබී ඇත ක්රි පූ දක්වා විහිදුණ ප්රාග් ඓතිහාසික ලෝහ යුගෙය්දී ලෝහ තාක්ෂණය කුඹල් කර්මාන්තය අහ්වයන් භාවිතය ගවයන් ඇති කිරීම සහ වී වගාවද පැවතුණ බව පෙනී යයි ක්රි පූ අතර කාලයේදී අනුරාධපුරයේ ජනාවාසය හෙක්ටයාර් ඉක්මවා වර්ධනය විය නගරය ඊසාන දිගින් සහ වයඹ දිගින් පිහිටි ප්රධාන වරායයන් අතර උපායමාර්ගිකව වැදගත් වන පරිදි පිහිටියේය වගා කළ හැකි සරු බිම් එය වටෙකාට පිහිටා තිබුණි ආක්රමණිකයන්ගෙන් නගරය ආරක්ෂා කළ ස්වභාවික පවුරක් වූ ඝන වනාන්තරය නගරය හාත්පස අවුරා විය ක්රි පූ සියවසෙහිදී පණ්ඩුකාභය රජතුමන් විසින් අනුරාධපුරය අගනගරය බවට පත් කරන ලද බවත් මනා සංවිධිත සැලසුමක් අනුව නගරය සහ එහි උප නගරයන්ද පිහිටුවන ලද බවත් කියැවේ අභය වාපි හෙවත් අභය වැවද එතුමන් විසින් කරවන ලදී කාලවේල සහ චිත්තරාජ නමැති යක්ෂයන් උදෙසා දෙවොල්ද කරවනු ලැබීය චේතියා නමැති යක්ෂණිය උදෙසා වෙළඹකගේ ස්වරූපයෙන් වූ පිළිරුවක් රාජ මාළිග පරිශ්රයේම ඉදි කරවන ලද අතර මේ සියළු යක්ෂ දේවතාවන් උදෙසා වාර්ෂිකව පුද පූජා පැවැත්වීමද සිදු විය නගරයේ සුසාන භූමිය වදක භූමිය පශ්චිම රාජිණියගේ දෙවොල වෙස්සවණ උදෙසා වූ නුග රුක ව්යාධදේව උදෙසා වූ තල් රුක යෝනයන් සඳහා වාස භූමිය ආත්ම පූජා මන්දිරය ආදිය පිහිටැවිය යුතු තැන්ද මෙතුමන් විසින් නියම කරන ලදී වහලුන් නොහොත් චණ්ඩාලයන් විසින් කළ යුතු කාර්යයන් නියම කෙරුණු අතර ඔවුන් උදෙසා ග්රාමයක් වෙන් කරන ලදී නිඝණ්ටයන් තැන තැන සරන තවුසන් ආජීවකයන් සහ බ්රාහ්මණයන් උදෙසා වාසස්ථාන ගොඩ නඟන ලදී ග්රාම සීමාද නීර්ණය කරනු ලැබීය අනුරාධපුරය අග නගරය බවට පත් කරමින් ක්රි පූ සියවස තරම් ඈත යුගයකදී පණ්ඩුකාභය රජතුමන් විසින් බිහි කරනු ලැබූ සම්ප්රදාය ඉතා වැදගත් වේ පික් පුරාණ පරිපාලණ ප්රදේශය අනුරාධපුර මධ්යතන යුගය නගරයට සහ පූජනීය ස්ථානයන්ට කරනු ලැබූ සනීපාරක්ෂක සහ පරිපාලනමය සම්පාදනයන් විසින් පෙන්නුම් කෙරෙනුයේ කාලාන්තරයක් තිසිසේ නගරය කිසියම් මධ්යගත සැලැස්මකට අනුව සංවර්ධනය කෙරුණු බවය පණ්ඩුකාභය රජතුමන්ගේ ඇවෑමෙන් එතුමන්ගේ පුත් මුටසීව රාජපදප්රාප්ත විය හැට වසරක් වූ එතුමන්ගේ රාජ්ය පාලන කාලය තුළ අනුරාධපුර නගරය තවදුරටත් අගනුවර වශයෙන් පවත්වා ගත් අතර බුදු සමය දිවයිනට හඳුන්වා දෙනු ලැබූ මුල් අවදියේදී වැදගත් කාර්යභාරයක් ඉටු කරනු ලැබූ මහාමේඝවන උද්යානය හෙවත් මහමෙවුනා උයන පිහිටුවාලීමද එසමයෙහි සිදුවිය බුදු රජාණන් වහන්සේගේ පිරිනිවන් පෑමෙන් වසර කට පසු ශ්රී ලංකාවට බුදු සමය හඳුන්වාදෙන ලද්දේ මුටසීව රජතුමන්ගේ ඇවැමෙන් රාජ්යත්වයට පත් එතුමන් පුත් දේවානම්පියතිස්ස රාජ්ය සමයෙහිදීය ඉන්දියාවෙහි වුසූ අශෝක අධිරාජයා දේවානම්පියතිස්ස රජතුමන්ගේ සමකාලීනයෙක් විය මෙම කාලය ක්රි පූ අතර කාලයයි ලංකාවෙහි රාජ්යත්වයෙහි ආරම්භය සහ ආසියාවෙහි විශිෂ්ඨතම ආගමක් වූ බුද්ධ ධර්මය මත පදනම් වූ ශිෂ්ඨාචාරයක ආරම්භයද සනිටුහන් කෙරෙන්නේ මෙසමයෙහිය සීගිරිය සංස්කරණය ප්රධාන ලිපිය සීගිරිය සීගිරිය ප්රෞඪ ඉතිහාසයකට නෑකම් කියන සිංහල දේශයේ තවත් අභිමානී නගරයක් වූ සිගිරිය අයත් වන්නේද රජරට රාජධානියටයි මෙහි පාලකයා වනුයේ කාශ්යප රජුයි කාශ්යප රජු මෙම ස්ථානය තෝරා ගැනීමට හේතුව වුයේ තම සොහොයුරු මුගලන් කුමරු කෙදිනක හෝ පැමිණ රාජ්ය පැහැරගනීයැයි තිබූ බියයි කලාගාරයක් බඳු මෙහි සීගිරි චිත්ර ඉන්දියාවේ අඡන්තා චිත්ර කලාවට සමාන කමක් දක්වයි මෙම චිත්ර පිලිබඳව අදහස් දක්වන පරණවිතානයන් පෙන්වා දෙන්නේ මෙම චිත්ර වලින් නිරූපණය වන්නේ මෙඝලතා හා චිජ්ජුලතා යන්න ය එනම් විදුලිය හා මේඝගර්ජනය යන ස්වභාවික සිදුවීම්ය මෙහි තවත් සුවිශේෂී අවධානයක් යොමුවන ස්ථානයක් ලෙස සීගිරි කැටපත් පවුර හඳුන්වාදිය හැකිය එහි ලියැවුණු කුරුටු ගී තුළින් හෙළ ගැමියාගේ අදහස් මෙන් ම හෙළ සංස්කෘතිය පිළිබඳවද තොරතුරු හෙළිවේ ආක්රමණ සංස්කරණය රජරට රාජධානියට අඛණ්ඩව පැවතුණු තර්ජනයක් වූයේ දකුණු ඉන්දීය ආක්රමණයන්ය එලෙස සිදු වූ ආක්රමණයන්ගෙන් සතුරන් පරදවා රජධානියේ පාලනය නැවත ලබාගත් දුටුගමුණු වළගම්භා ධාතුසේන වන විජයබාහු ලීලාවතී වැනි පාලකයන් කාගේත් අවධානයට ලක්විය අනෙකුත් පාලකයන් මතකයේ රැඳුනේ ඔවුන් විසින් සිදු කරන ලද හමුදා ජයග්රහණ නිසාය දකුණු ඉන්දියාවට එරෙහිව ආක්රමණයන් දියත් කළ පළවන ගජභාහු පන්ධ්යන් දේවියට පිහිට වීමට තම හමුදාවන් යැවූ දෙවන සේන එවැනි පාලකයන්ය රජරට රාජධානියට එරෙහිව ආක්රමණයන් කිහිපයක් සිදුවූ අතර ඒවා සියල්ලක්ම දියත් කරන ලද්දේ දකුණු ඉන්දියාණුවන් විසිණි ශ්රී ලංකා ඉතිහාසයේ පළමු වාර්තාගත ආක්රමණය සිදුවූයේ සූරතිස්ස ක්රි පූ රජු සමයේදීය එය සිදු කරන ලද්දේ සේන හා ගුත්තික යන දකුණු ඉන්දීය අශ්ව වෙළෙන්දන් දෙදෙනෙකු විසිනි අවුරුදු විසිදෙකක පාලන කාලයෙන් අනතුරුව අසේල ක්රි පූ විසින් ඔවුන් පරජය කරන ලදී ඉන් අනතුරුව පැවති තවත් ආක්රමණයක් හේතුවෙන් චෝළ රජකු වූ එලාර ක්රි පූ අසේල රජු පරදවා රටෙහි පාලකයා බවට පත් විය එලාර අවුරුදු ක් රට පාලනය කළ අතර ඔහුව පරජයට පත් කරන ලද්දේ දුටුගැමුණු විසිනි කෙසේ නමුත් මහාවංශ වාර්තා වලට අනුව එළාර විසින් රට යුක්තිගරුක ලෙස සහ සධාරණ ලෙස පාලනය කළ බව කියැවේ ක්රි පූ දී ද්රවිඩ නායකයන් පස් දෙනෙකු වූ පූලහත්ත බාහිය පනයාමර පිලියාමර දතික විසින් රට නැවතත් ආක්රමණය කරන ලදී ඔවුන් ක්රි පූ දක්වා රට පාලනය කළ අතර වළගම්භා හට පරාජයට පත් විය පසුව ඇති වූ තවත් ආක්රමණයක් නිසා රටෙහි පාලනය දකුණු ඉන්දීය පාලකයන් සය දෙනෙකු වූ පණ්ඩු පාරින්ද තිරිතර දාතිය සහ පීතිය යටතට පත් විය ධාතුසේන විසින් ඔවුන් පරදවා නැවත බලය ලබා ගන්නා ලදී වන සේන ක්රි පූ සහ වන උදය ක්රි පූ රජ සමය තුළ දකුණු ඉන්දියාවෙන් බොහෝ ආක්රමණ සහ කොල්ලකෑම් එල්ල විය කෙසේ නමුත් මෙම ආක්රමණිකයන්ගෙන් කිසිවෙකු ඔවුන්ගේ පාලනය රටෙහි දකුණු ප්රදේශය වූ රුහුණ දක්වා දීර්ඝ කර නොගත්හ එබැවින් ශ්රී ලාංකීය පාලකයන් සහ උරුමක්කාරයන් ඔවුන්ගේ හමුදාවන් මෙම ප්රදේශය තුළ සංවිධානය කොට ගෙන ඔටුන්න නැවත ලබා ගැනීමට සමත් වූහ ශ්රී ලාංකීය ඉතිහාසය මුළුල්ලේම සතුරු ආක්රමණ වලින් රට බේරා ගත් අවස්තාවලදී රුහුණ මුල් වී ඉමහත් සේවයක් කරන ලදී කිත්සිරිමෙවන් රජ සමයේදී හේමමාලා කුමරිය සහ දන්ත කුමරු විසින් බුදුන් වහන්සේගේ දන්ත ධාතුව ලංකාවට වැඩම කරවන ලදී එම රජු විසින් දන්ත ධාතුව පෙරහැරකින් වඩම්මවා මන්දිරයක තැන්පත් කරන ලදී මෙම පෙරහැර වාර්ශිකව පවත්වන ලෙස රජු අණ කල අතර අදටත් එය චාරිත්රයක් ලෙස රටෙහි පවතී බුදුන් වහන්සේගේ දන්ත ධාතුව ඉතා ඉක්මනින්ම රටෙහි පූජනීය වස්තුවක් මෙන්ම රජ්ය භාවය තහවුරු කරන සංකේතයක් බවට පත් විය දන්ත ධාතුව ළඟ තබා ගන්නා පුද්ගලයා රටෙහි නියම පාලකයා විය එමනිසා බොහෝ විට එය රජ මාළිගාවෙහිම නිදන් කොට තබන ලදී වැසි ජල කලමණාකරන තාක්ෂණය රජරට රාජධානියේ ප්රධානතම ජයග්රහණය වූයේ වැසි ජලය මනාව කලමණාකරන කලහැකි වාරිමාර්ග බිහිවීමයි ඒ හේතුවෙන් වියළි කලාපයේ කෘෂිකාර්මික අවශ්යතාවන් සඳහා ජලය සැපයීම සිදු විය මෙම වාරිමාර්ග ඉදිකිරීම් මඟින් එම යුගයේ මිනිසුන් තුළ තිබූ උසස් තාක්ෂණික හා ඉංජිනේරු හැකියාවන් මනාව පිළිඹිබු කරයි තද පැහැති අකුරු පෙළ ලක්දිව සමකාලීන රාජධානි රුහුණු රාජධානිය සංස්කරණය ප්රධාන ලිපිය රුහුණු රාජධානිය තිස්ස රජ මෞර්ය අධිරාජ්යයට අවනතව දේවානම් පියතිස්ස නමින් මෞර්ය සම්ප්රදායනුකූලව නැවත ඔටුනු පැළඳීමත් සමගම රජ සොහොයුරු මහානාග කුමරු රුහුණට පලාගොස් මෞර්ය අධිරාජ්යයට අවනත නොවූ රුහුණු රාජධානිය පිහිටුවාගන්නා ලදී රජරට රාජධානිය ආක්රමණියන් අතට පත් බෝහෝ අවස්ථාවලදී රුහුණු රාජධානිය බලය රැකගැනීමට ස්වදේශික සිංහලයන් සමත්විය අනුරාධපුර අතහැරීම සංස්කරණය දිගින් දිගටම වූ දකුණු ඉන්දීය ආක්රමණ වලින් තැවුණු නගරය අවසානයේදී ක්රි ව දී අතහැර දැමිණ මෙම මහා නගරය ක්රි පූ වන සියවසයෙහි සිට ක්රි ව දක්වා ලංකාවේ අඟනගරය ලෙස පැවතුනි එහි පසුබැස්ම ඇරඹියේ දකුණි ඉන්දීය ආක්රමණයන්ට එරෙහිව දිගින් දිගටම වූ යුද වැදීම නිස රාජධානිය ආර්ථිකමය අතින් දුප්පත් වීමය ක්රි ව දී චෝල අක්රමණික හමුදාව අනුරාධපුරය අතහැර ඊට සාපේක්ෂව ආරක්ෂිත පොළොන්නරුවට පරිපාලන නගරය ගෙන ගියේය නටබුන් ගවේෂණය සහ සංරක්ෂණය සංස්කරණය නගරයට සහ එහි වූ වාරී සංකීරණයට වූ අති මහත් විනාශය හේතුවෙන් එය සම්පූර්ණයෙන්ම අතහැර අවුරුදු දහසකට ආසන්න කාලයක් ජරාවාස වන්නට හැරුණි පසුව වන සතවසරේදී බ්රිතාන්ය පරිපාලනය විසින් කැළෑ හෙළි කර නැවත ජනාවාස ඇති කෙරිණි පරිපාලනය සංස්කරණය රාජධානිය රජුගේ පාලනයට යටත් විය රාජ්යත්වයට සම්බන්ධ වූ කැප කිරීමේ උත්සව සහ පිළිවෙත් ක්රමයන් ආරම්භ වූයේ දේවානම්පිය තිස්ස රජු සමයේදීය එය එලෙස සිදු වූයේ ඉන්දියාවේ අශෝක රජුගෙන් ලැබූ ආභාශය හේතු කොට ගෙනය දුටුගැමුණු රජු විසින් ප්රථම වරට මුළු රටම තමන් යටතට පත් කොටගෙන රට එක්සේසත් කරන ලදී ඔටුන්නේ හිමිකාරිත්වයෙහි අනුපිළිවෙල සිදුවූයේ පිය පරම්පරාවට අනුකූලවය එය සිදු කළ නොහැකි අවස්තාවකදී පෙර රජුගේ වැඩිමහල් සහෝදරයාට ඔටුන්නේ හිමිකාරිත්වය උරුමයෙන් ලැබුණි සහෝදරයන් නොසිටියේ නම් වැඩිමහල් පුත්රයා හට ඔටුන්න උරුම විය අනුරාධපුර රාජධානියේ ආරම්භයේ සිට පාලකයෝ සතර දෙනෙකු රාජ්යය පලනය කරන ලදහ විජයගෙන් ආරම්භ කොට සුභරාජ දක්වා සිටි පාලකයන් සාමාන්යයෙන් හැඳින්වූයේ විජයන් රජ පෙළපතට අයත් අය ලෙසයි මෙම රජ පෙළපතට අයත් වූ පණ්ඩුකාභය අනුරාධපුර රාජධානියේ ප්රථම පාලකයා විය ළඹකන්න වංශයට අයත් වසභ විසින් බලය පැහැර ගන්නා තුරු විජයන් පෙළපත පැවතුණි වසභ විසින් ඔටුන්න හිමි කර ගැනීමත් සමඟ ළඹකන්න රජ පෙළපත ආරම්භ වූ අතර එම පෙලපතට අයත් පාලකයන් සියවස් තුනකට වඩා වැඩි කාලයක් රට පාලනය කරන ලදහ නව රජ පෙළපතක් ආරම්භ වූයේ දී ධාතුසේන කාලයේදීය එය මූරිය රජ පෙළපත විය ඇතැම් ඉතිහාසඥයන් විසින් මෙම රජ පෙළපතෙහි ආරම්භය ශාඛ්ය රජු ලෙස හැඳින්වූවත් ආරම්භක රජු තවමත් අවිනිශ්චිතය අනුරාධපුර යුගයේ පැවති අවසාන රජ පෙළපත වූයේ දෙවන ළඹකන්න රජ පෙළපතයි එය මානවම්මගෙන් ආරම්භ වූ අතර අනුරාධපුර රාජධානියේ අවසාන පාලකයා වූ වන මහින්ද දක්වා පැවතුණි ආර්ථීකය සංස්කරණය සංස්කෘතිය සංස්කරණය සටහන් සංස්කරණය උපහරණ සංස්කරණය ආශ්රිත සංස්කරණය බණ්ඩාරනායක සේනක සීගිරිය මධ්යම සංස්කෘතික අරමුදල බස්නායක එච් ටී ශ්රී ලංකන් මොනාස්ටික් ආකිටෙක්චර් ශ්රී සත්ගුරු ප්රකාශන බ්ලේස් එල් ඊ ද ස්ටෝරි ඔෆ් ලංකා ඒෂියන් එඩියුකේෂනල් සර්විසර්ස් කොඩ්රිංටන් එච් ඩබ් සිලෝන් කොයින්ස් ඇන්ඩ් කරන්සි ඒෂියන් එඩියුකේෂනල් සර්විසර්ස් අනුරාධපුර යුගය වෙතින් සම්ප්රවේශනය කෙරිණි",
        "ප්රධාන ලිපියන් ශ්රී ලංකාවේ අතීතය සහ අනුරාධපුර රාජධානිය සැකිල්ල ලක්දිව අතීත රාජ්ය ඉන්දික භාෂා අක්ෂර අඩංගු යි රජරට රාජධානියේ රජරට රාජධානියේ අගනුවර ලෙස අනුරාධපුර සහ සීගිරිය පැවති යුගය අනුරාධපුර යුගය ලෙස සැලකේ අනුරාධපුර රාජධානිය ක්රි පූ අනුරාධපුර නගරය නමින් නම් කරන ලදී වර්ථමාන ශ්රී ලංකාවේ ප්රධාන ගොඩබිම වන ලංකා දූපත හෙවත් ලක්දිව බිහිවූ ප්රථම සංවිධානාත්මක රාජධානිය වුයේ රජරට රාජධානියයි මුල් යුගයේ උපතිස්සනුවර අගනුවර වූ අතර පණ්ඩුකාභය රජ විසින් අනුරාධගම අගනුවර කරගෙන එය පුරවරයක් දකිවා සංවර්ධනය කරන ලදී රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්රධාන කාර්යයක් විය බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය මෙම ඉදිකිරීම් නිසා අනුරාධපුර යුගය මුළුල්ලේම රජරට ප්රදේශය තුළ විශාල එමෙන්ම සංකීර්ණ වාරිමාර්ග පද්ධතියක් බිහි විය රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්රධාන කාර්යයක් විය බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය මෙම ඉදිකිරීම් නිසා අනුරාධපුර යුගය මුළුල්ලේම රජරට ප්රදේශය තුළ විශාල එමෙන්ම සංකීර්ණ වාරිමාර්ග පද්ධතියක් බිහි විය එකල ඉදි කරන ලද මහා ස්ථුපයන් වූ රුවන්වැලිසෑය ජේතවණාරාමය මෙන්ම ලෝවාමහාපාය වැනි විශාල ගොඩනැගිලි මඟින් අනුරාධපුර යුගයේ තිබූ ගෘහ නිර්මාණ ශිල්පයේ දියුණුව මනාව පෙන්නුම් කරයි අගනුවර සංස්කරණය අනුරාධපුර සංස්කරණය ප්රධාන ලිපිය අනුරාධපුර පෞරාණික නගරය ඓතිහාසික මූලාශ්රයන්හි සඳහන් වන පරිදි අනුරාධපුර නගරය ආරම්භ වී ඇත්තේ ක්රි පූ සියවෙසහි වුවත් පුරාවිද්යාත්මක තොරතුරු අනුව එහි ඉතිහාසය ක්රි පූ වැනි සියවස තරම් ඈතට දිව යයි කරන ලද පුරා විද්යා කැණීම් වලදී වඩා පූර්ව කාලයන්හි විසූ ජනයා සම්බන්ධ සාක්ෂි ලැබී ඇතත් ක්රි පූ සියවසට එපිට කාලය පිළිබද තොරතුරු අත්ෙත් මද වශෙයනි අනුරාධපුරෙය් වැඩිදුර සිදු කරන ලද කැණීම් වලදී මෙම පුරවරෙය් පැවති ප්රාග් ඓතිහාසික ජනාවාසයන් පිළිබද තොරතුරු ලැබී ඇත ක්රි පූ දක්වා විහිදුණ ප්රාග් ඓතිහාසික ලෝහ යුගෙය්දී ලෝහ තාක්ෂණය කුඹල් කර්මාන්තය අහ්වයන් භාවිතය ගවයන් ඇති කිරීම සහ වී වගාවද පැවතුණ බව පෙනී යයි ක්රි පූ අතර කාලයේදී අනුරාධපුරයේ ජනාවාසය හෙක්ටයාර් ඉක්මවා වර්ධනය විය නගරය ඊසාන දිගින් සහ වයඹ දිගින් පිහිටි ප්රධාන වරායයන් අතර උපායමාර්ගිකව වැදගත් වන පරිදි පිහිටියේය වගා කළ හැකි සරු බිම් එය වටෙකාට පිහිටා තිබුණි ආක්රමණිකයන්ගෙන් නගරය ආරක්ෂා කළ ස්වභාවික පවුරක් වූ ඝන වනාන්තරය නගරය හාත්පස අවුරා විය ක්රි පූ සියවසෙහිදී පණ්ඩුකාභය රජතුමන් විසින් අනුරාධපුරය අගනගරය බවට පත් කරන ලද බවත් මනා සංවිධිත සැලසුමක් අනුව නගරය සහ එහි උප නගරයන්ද පිහිටුවන ලද බවත් කියැවේ අභය වාපි හෙවත් අභය වැවද එතුමන් විසින් කරවන ලදී කාලවේල සහ චිත්තරාජ නමැති යක්ෂයන් උදෙසා දෙවොල්ද කරවනු ලැබීය චේතියා නමැති යක්ෂණිය උදෙසා වෙළඹකගේ ස්වරූපයෙන් වූ පිළිරුවක් රාජ මාළිග පරිශ්රයේම ඉදි කරවන ලද අතර මේ සියළු යක්ෂ දේවතාවන් උදෙසා වාර්ෂිකව පුද පූජා පැවැත්වීමද සිදු විය නගරයේ සුසාන භූමිය වදක භූමිය පශ්චිම රාජිණියගේ දෙවොල වෙස්සවණ උදෙසා වූ නුග රුක ව්යාධදේව උදෙසා වූ තල් රුක යෝනයන් සඳහා වාස භූමිය ආත්ම පූජා මන්දිරය ආදිය පිහිටැවිය යුතු තැන්ද මෙතුමන් විසින් නියම කරන ලදී වහලුන් නොහොත් චණ්ඩාලයන් විසින් කළ යුතු කාර්යයන් නියම කෙරුණු අතර ඔවුන් උදෙසා ග්රාමයක් වෙන් කරන ලදී නිඝණ්ටයන් තැන තැන සරන තවුසන් ආජීවකයන් සහ බ්රාහ්මණයන් උදෙසා වාසස්ථාන ගොඩ නඟන ලදී ග්රාම සීමාද නීර්ණය කරනු ලැබීය අනුරාධපුරය අග නගරය බවට පත් කරමින් ක්රි පූ සියවස තරම් ඈත යුගයකදී පණ්ඩුකාභය රජතුමන් විසින් බිහි කරනු ලැබූ සම්ප්රදාය ඉතා වැදගත් වේ පික් පුරාණ පරිපාලණ ප්රදේශය අනුරාධපුර මධ්යතන යුගය නගරයට සහ පූජනීය ස්ථානයන්ට කරනු ලැබූ සනීපාරක්ෂක සහ පරිපාලනමය සම්පාදනයන් විසින් පෙන්නුම් කෙරෙනුයේ කාලාන්තරයක් තිසිසේ නගරය කිසියම් මධ්යගත සැලැස්මකට අනුව සංවර්ධනය කෙරුණු බවය පණ්ඩුකාභය රජතුමන්ගේ ඇවෑමෙන් එතුමන්ගේ පුත් මුටසීව රාජපදප්රාප්ත විය හැට වසරක් වූ එතුමන්ගේ රාජ්ය පාලන කාලය තුළ අනුරාධපුර නගරය තවදුරටත් අගනුවර වශයෙන් පවත්වා ගත් අතර බුදු සමය දිවයිනට හඳුන්වා දෙනු ලැබූ මුල් අවදියේදී වැදගත් කාර්යභාරයක් ඉටු කරනු ලැබූ මහාමේඝවන උද්යානය හෙවත් මහමෙවුනා උයන පිහිටුවාලීමද එසමයෙහි සිදුවිය බුදු රජාණන් වහන්සේගේ පිරිනිවන් පෑමෙන් වසර කට පසු ශ්රී ලංකාවට බුදු සමය හඳුන්වාදෙන ලද්දේ මුටසීව රජතුමන්ගේ ඇවැමෙන් රාජ්යත්වයට පත් එතුමන් පුත් දේවානම්පියතිස්ස රාජ්ය සමයෙහිදීය ඉන්දියාවෙහි වුසූ අශෝක අධිරාජයා දේවානම්පියතිස්ස රජතුමන්ගේ සමකාලීනයෙක් විය මෙම කාලය ක්රි පූ අතර කාලයයි ලංකාවෙහි රාජ්යත්වයෙහි ආරම්භය සහ ආසියාවෙහි විශිෂ්ඨතම ආගමක් වූ බුද්ධ ධර්මය මත පදනම් වූ ශිෂ්ඨාචාරයක ආරම්භයද සනිටුහන් කෙරෙන්නේ මෙසමයෙහිය සීගිරිය සංස්කරණය ප්රධාන ලිපිය සීගිරිය සීගිරිය ප්රෞඪ ඉතිහාසයකට නෑකම් කියන සිංහල දේශයේ තවත් අභිමානී නගරයක් වූ සිගිරිය අයත් වන්නේද රජරට රාජධානියටයි මෙහි පාලකයා වනුයේ කාශ්යප රජුයි කාශ්යප රජු මෙම ස්ථානය තෝරා ගැනීමට හේතුව වුයේ තම සොහොයුරු මුගලන් කුමරු කෙදිනක හෝ පැමිණ රාජ්ය පැහැරගනීයැයි තිබූ බියයි කලාගාරයක් බඳු මෙහි සීගිරි චිත්ර ඉන්දියාවේ අඡන්තා චිත්ර කලාවට සමාන කමක් දක්වයි මෙම චිත්ර පිලිබඳව අදහස් දක්වන පරණවිතානයන් පෙන්වා දෙන්නේ මෙම චිත්ර වලින් නිරූපණය වන්නේ මෙඝලතා හා චිජ්ජුලතා යන්න ය එනම් විදුලිය හා මේඝගර්ජනය යන ස්වභාවික සිදුවීම්ය මෙහි තවත් සුවිශේෂී අවධානයක් යොමුවන ස්ථානයක් ලෙස සීගිරි කැටපත් පවුර හඳුන්වාදිය හැකිය එහි ලියැවුණු කුරුටු ගී තුළින් හෙළ ගැමියාගේ අදහස් මෙන් ම හෙළ සංස්කෘතිය පිළිබඳවද තොරතුරු හෙළිවේ ආක්රමණ සංස්කරණය රජරට රාජධානියට අඛණ්ඩව පැවතුණු තර්ජනයක් වූයේ දකුණු ඉන්දීය ආක්රමණයන්ය එලෙස සිදු වූ ආක්රමණයන්ගෙන් සතුරන් පරදවා රජධානියේ පාලනය නැවත ලබාගත් දුටුගමුණු වළගම්භා ධාතුසේන වන විජයබාහු ලීලාවතී වැනි පාලකයන් කාගේත් අවධානයට ලක්විය අනෙකුත් පාලකයන් මතකයේ රැඳුනේ ඔවුන් විසින් සිදු කරන ලද හමුදා ජයග්රහණ නිසාය දකුණු ඉන්දියාවට එරෙහිව ආක්රමණයන් දියත් කළ පළවන ගජභාහු පන්ධ්යන් දේවියට පිහිට වීමට තම හමුදාවන් යැවූ දෙවන සේන එවැනි පාලකයන්ය රජරට රාජධානියට එරෙහිව ආක්රමණයන් කිහිපයක් සිදුවූ අතර ඒවා සියල්ලක්ම දියත් කරන ලද්දේ දකුණු ඉන්දියාණුවන් විසිණි ශ්රී ලංකා ඉතිහාසයේ පළමු වාර්තාගත ආක්රමණය සිදුවූයේ සූරතිස්ස ක්රි පූ රජු සමයේදීය එය සිදු කරන ලද්දේ සේන හා ගුත්තික යන දකුණු ඉන්දීය අශ්ව වෙළෙන්දන් දෙදෙනෙකු විසිනි අවුරුදු විසිදෙකක පාලන කාලයෙන් අනතුරුව අසේල ක්රි පූ විසින් ඔවුන් පරජය කරන ලදී ඉන් අනතුරුව පැවති තවත් ආක්රමණයක් හේතුවෙන් චෝළ රජකු වූ එලාර ක්රි පූ අසේල රජු පරදවා රටෙහි පාලකයා බවට පත් විය එලාර අවුරුදු ක් රට පාලනය කළ අතර ඔහුව පරජයට පත් කරන ලද්දේ දුටුගැමුණු විසිනි කෙසේ නමුත් මහාවංශ වාර්තා වලට අනුව එළාර විසින් රට යුක්තිගරුක ලෙස සහ සධාරණ ලෙස පාලනය කළ බව කියැවේ ක්රි පූ දී ද්රවිඩ නායකයන් පස් දෙනෙකු වූ පූලහත්ත බාහිය පනයාමර පිලියාමර දතික විසින් රට නැවතත් ආක්රමණය කරන ලදී ඔවුන් ක්රි පූ දක්වා රට පාලනය කළ අතර වළගම්භා හට පරාජයට පත් විය පසුව ඇති වූ තවත් ආක්රමණයක් නිසා රටෙහි පාලනය දකුණු ඉන්දීය පාලකයන් සය දෙනෙකු වූ පණ්ඩු පාරින්ද තිරිතර දාතිය සහ පීතිය යටතට පත් විය ධාතුසේන විසින් ඔවුන් පරදවා නැවත බලය ලබා ගන්නා ලදී වන සේන ක්රි පූ සහ වන උදය ක්රි පූ රජ සමය තුළ දකුණු ඉන්දියාවෙන් බොහෝ ආක්රමණ සහ කොල්ලකෑම් එල්ල විය කෙසේ නමුත් මෙම ආක්රමණිකයන්ගෙන් කිසිවෙකු ඔවුන්ගේ පාලනය රටෙහි දකුණු ප්රදේශය වූ රුහුණ දක්වා දීර්ඝ කර නොගත්හ එබැවින් ශ්රී ලාංකීය පාලකයන් සහ උරුමක්කාරයන් ඔවුන්ගේ හමුදාවන් මෙම ප්රදේශය තුළ සංවිධානය කොට ගෙන ඔටුන්න නැවත ලබා ගැනීමට සමත් වූහ ශ්රී ලාංකීය ඉතිහාසය මුළුල්ලේම සතුරු ආක්රමණ වලින් රට බේරා ගත් අවස්තාවලදී රුහුණ මුල් වී ඉමහත් සේවයක් කරන ලදී කිත්සිරිමෙවන් රජ සමයේදී හේමමාලා කුමරිය සහ දන්ත කුමරු විසින් බුදුන් වහන්සේගේ දන්ත ධාතුව ලංකාවට වැඩම කරවන ලදී එම රජු විසින් දන්ත ධාතුව පෙරහැරකින් වඩම්මවා මන්දිරයක තැන්පත් කරන ලදී මෙම පෙරහැර වාර්ශිකව පවත්වන ලෙස රජු අණ කල අතර අදටත් එය චාරිත්රයක් ලෙස රටෙහි පවතී බුදුන් වහන්සේගේ දන්ත ධාතුව ඉතා ඉක්මනින්ම රටෙහි පූජනීය වස්තුවක් මෙන්ම රජ්ය භාවය තහවුරු කරන සංකේතයක් බවට පත් විය දන්ත ධාතුව ළඟ තබා ගන්නා පුද්ගලයා රටෙහි නියම පාලකයා විය එමනිසා බොහෝ විට එය රජ මාළිගාවෙහිම නිදන් කොට තබන ලදී වැසි ජල කලමණාකරන තාක්ෂණය රජරට රාජධානියේ ප්රධානතම ජයග්රහණය වූයේ වැසි ජලය මනාව කලමණාකරන කලහැකි වාරිමාර්ග බිහිවීමයි ඒ හේතුවෙන් වියළි කලාපයේ කෘෂිකාර්මික අවශ්යතාවන් සඳහා ජලය සැපයීම සිදු විය මෙම වාරිමාර්ග ඉදිකිරීම් මඟින් එම යුගයේ මිනිසුන් තුළ තිබූ උසස් තාක්ෂණික හා ඉංජිනේරු හැකියාවන් මනාව පිළිඹිබු කරයි තද පැහැති අකුරු පෙළ ලක්දිව සමකාලීන රාජධානි රුහුණු රාජධානිය සංස්කරණය ප්රධාන ලිපිය රුහුණු රාජධානිය තිස්ස රජ මෞර්ය අධිරාජ්යයට අවනතව දේවානම් පියතිස්ස නමින් මෞර්ය සම්ප්රදායනුකූලව නැවත ඔටුනු පැළඳීමත් සමගම රජ සොහොයුරු මහානාග කුමරු රුහුණට පලාගොස් මෞර්ය අධිරාජ්යයට අවනත නොවූ රුහුණු රාජධානිය පිහිටුවාගන්නා ලදී රජරට රාජධානිය ආක්රමණියන් අතට පත් බෝහෝ අවස්ථාවලදී රුහුණු රාජධානිය බලය රැකගැනීමට ස්වදේශික සිංහලයන් සමත්විය අනුරාධපුර අතහැරීම සංස්කරණය දිගින් දිගටම වූ දකුණු ඉන්දීය ආක්රමණ වලින් තැවුණු නගරය අවසානයේදී ක්රි ව දී අතහැර දැමිණ මෙම මහා නගරය ක්රි පූ වන සියවසයෙහි සිට ක්රි ව දක්වා ලංකාවේ අඟනගරය ලෙස පැවතුනි එහි පසුබැස්ම ඇරඹියේ දකුණි ඉන්දීය ආක්රමණයන්ට එරෙහිව දිගින් දිගටම වූ යුද වැදීම නිස රාජධානිය ආර්ථිකමය අතින් දුප්පත් වීමය ක්රි ව දී චෝල අක්රමණික හමුදාව අනුරාධපුරය අතහැර ඊට සාපේක්ෂව ආරක්ෂිත පොළොන්නරුවට පරිපාලන නගරය ගෙන ගියේය නටබුන් ගවේෂණය සහ සංරක්ෂණය සංස්කරණය නගරයට සහ එහි වූ වාරී සංකීරණයට වූ අති මහත් විනාශය හේතුවෙන් එය සම්පූර්ණයෙන්ම අතහැර අවුරුදු දහසකට ආසන්න කාලයක් ජරාවාස වන්නට හැරුණි පසුව වන සතවසරේදී බ්රිතාන්ය පරිපාලනය විසින් කැළෑ හෙළි කර නැවත ජනාවාස ඇති කෙරිණි පරිපාලනය සංස්කරණය රාජධානිය රජුගේ පාලනයට යටත් විය රාජ්යත්වයට සම්බන්ධ වූ කැප කිරීමේ උත්සව සහ පිළිවෙත් ක්රමයන් ආරම්භ වූයේ දේවානම්පිය තිස්ස රජු සමයේදීය එය එලෙස සිදු වූයේ ඉන්දියාවේ අශෝක රජුගෙන් ලැබූ ආභාශය හේතු කොට ගෙනය දුටුගැමුණු රජු විසින් ප්රථම වරට මුළු රටම තමන් යටතට පත් කොටගෙන රට එක්සේසත් කරන ලදී ඔටුන්නේ හිමිකාරිත්වයෙහි අනුපිළිවෙල සිදුවූයේ පිය පරම්පරාවට අනුකූලවය එය සිදු කළ නොහැකි අවස්තාවකදී පෙර රජුගේ වැඩිමහල් සහෝදරයාට ඔටුන්නේ හිමිකාරිත්වය උරුමයෙන් ලැබුණි සහෝදරයන් නොසිටියේ නම් වැඩිමහල් පුත්රයා හට ඔටුන්න උරුම විය අනුරාධපුර රාජධානියේ ආරම්භයේ සිට පාලකයෝ සතර දෙනෙකු රාජ්යය පලනය කරන ලදහ විජයගෙන් ආරම්භ කොට සුභරාජ දක්වා සිටි පාලකයන් සාමාන්යයෙන් හැඳින්වූයේ විජයන් රජ පෙළපතට අයත් අය ලෙසයි මෙම රජ පෙළපතට අයත් වූ පණ්ඩුකාභය අනුරාධපුර රාජධානියේ ප්රථම පාලකයා විය ළඹකන්න වංශයට අයත් වසභ විසින් බලය පැහැර ගන්නා තුරු විජයන් පෙළපත පැවතුණි වසභ විසින් ඔටුන්න හිමි කර ගැනීමත් සමඟ ළඹකන්න රජ පෙළපත ආරම්භ වූ අතර එම පෙලපතට අයත් පාලකයන් සියවස් තුනකට වඩා වැඩි කාලයක් රට පාලනය කරන ලදහ නව රජ පෙළපතක් ආරම්භ වූයේ දී ධාතුසේන කාලයේදීය එය මූරිය රජ පෙළපත විය ඇතැම් ඉතිහාසඥයන් විසින් මෙම රජ පෙළපතෙහි ආරම්භය ශාඛ්ය රජු ලෙස හැඳින්වූවත් ආරම්භක රජු තවමත් අවිනිශ්චිතය අනුරාධපුර යුගයේ පැවති අවසාන රජ පෙළපත වූයේ දෙවන ළඹකන්න රජ පෙළපතයි එය මානවම්මගෙන් ආරම්භ වූ අතර අනුරාධපුර රාජධානියේ අවසාන පාලකයා වූ වන මහින්ද දක්වා පැවතුණි ආර්ථීකය සංස්කරණය සංස්කෘතිය සංස්කරණය සටහන් සංස්කරණය උපහරණ සංස්කරණය ආශ්රිත සංස්කරණය බණ්ඩාරනායක සේනක සීගිරිය මධ්යම සංස්කෘතික අරමුදල බස්නායක එච් ටී ශ්රී ලංකන් මොනාස්ටික් ආකිටෙක්චර් ශ්රී සත්ගුරු ප්රකාශන බ්ලේස් එල් ඊ ද ස්ටෝරි ඔෆ් ලංකා ඒෂියන් එඩියුකේෂනල් සර්විසර්ස් කොඩ්රිංටන් එච් ඩබ් සිලෝන් කොයින්ස් ඇන්ඩ් කරන්සි ඒෂියන් එඩියුකේෂනල් සර්විසර්ස්",
        "ප්රධාන ලිපියන් ශ්රී ලංකාවේ අතීතය සහ අනුරාධපුර රාජධානිය",
        "සැකිල්ල ලක්දිව අතීත රාජ්ය ඉන්දික භාෂා අක්ෂර අඩංගු යි",
        "රජරට රාජධානියේ රජරට රාජධානියේ අගනුවර ලෙස අනුරාධපුර සහ සීගිරිය පැවති යුගය අනුරාධපුර යුගය ලෙස සැලකේ අනුරාධපුර රාජධානිය ක්රි පූ අනුරාධපුර නගරය නමින් නම් කරන ලදී වර්ථමාන ශ්රී ලංකාවේ ප්රධාන ගොඩබිම වන ලංකා දූපත හෙවත් ලක්දිව බිහිවූ ප්රථම සංවිධානාත්මක රාජධානිය වුයේ රජරට රාජධානියයි",
        "මුල් යුගයේ උපතිස්සනුවර අගනුවර වූ අතර පණ්ඩුකාභය රජ විසින් අනුරාධගම අගනුවර කරගෙන එය පුරවරයක් දකිවා සංවර්ධනය කරන ලදී රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්රධාන කාර්යයක් විය බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය මෙම ඉදිකිරීම් නිසා අනුරාධපුර යුගය මුළුල්ලේම රජරට ප්රදේශය තුළ විශාල එමෙන්ම සංකීර්ණ වාරිමාර්ග පද්ධතියක් බිහි විය",
        "රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්රධාන කාර්යයක් විය බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය මෙම ඉදිකිරීම් නිසා අනුරාධපුර යුගය මුළුල්ලේම රජරට ප්රදේශය තුළ විශාල එමෙන්ම සංකීර්ණ වාරිමාර්ග පද්ධතියක් බිහි විය එකල ඉදි කරන ලද මහා ස්ථුපයන් වූ රුවන්වැලිසෑය ජේතවණාරාමය මෙන්ම ලෝවාමහාපාය වැනි විශාල ගොඩනැගිලි මඟින් අනුරාධපුර යුගයේ තිබූ ගෘහ නිර්මාණ ශිල්පයේ දියුණුව මනාව පෙන්නුම් කරයි",
        "ඓතිහාසික මූලාශ්රයන්හි සඳහන් වන පරිදි අනුරාධපුර නගරය ආරම්භ වී ඇත්තේ ක්රි පූ සියවෙසහි වුවත් පුරාවිද්යාත්මක තොරතුරු අනුව එහි ඉතිහාසය ක්රි පූ වැනි සියවස තරම් ඈතට දිව යයි කරන ලද පුරා විද්යා කැණීම් වලදී වඩා පූර්ව කාලයන්හි විසූ ජනයා සම්බන්ධ සාක්ෂි ලැබී ඇතත් ක්රි පූ සියවසට එපිට කාලය පිළිබද තොරතුරු අත්ෙත් මද වශෙයනි",
        "අනුරාධපුරෙය් වැඩිදුර සිදු කරන ලද කැණීම් වලදී මෙම පුරවරෙය් පැවති ප්රාග් ඓතිහාසික ජනාවාසයන් පිළිබද තොරතුරු ලැබී ඇත ක්රි පූ දක්වා විහිදුණ ප්රාග් ඓතිහාසික ලෝහ යුගෙය්දී ලෝහ තාක්ෂණය කුඹල් කර්මාන්තය අහ්වයන් භාවිතය ගවයන් ඇති කිරීම සහ වී වගාවද පැවතුණ බව පෙනී යයි ක්රි පූ අතර කාලයේදී අනුරාධපුරයේ ජනාවාසය හෙක්ටයාර් ඉක්මවා වර්ධනය විය නගරය ඊසාන දිගින් සහ වයඹ දිගින් පිහිටි ප්රධාන වරායයන් අතර උපායමාර්ගිකව වැදගත් වන පරිදි පිහිටියේය වගා කළ හැකි සරු බිම් එය වටෙකාට පිහිටා තිබුණි ආක්රමණිකයන්ගෙන් නගරය ආරක්ෂා කළ ස්වභාවික පවුරක් වූ ඝන වනාන්තරය නගරය හාත්පස අවුරා විය",
        "ක්රි පූ සියවසෙහිදී පණ්ඩුකාභය රජතුමන් විසින් අනුරාධපුරය අගනගරය බවට පත් කරන ලද බවත් මනා සංවිධිත සැලසුමක් අනුව නගරය සහ එහි උප නගරයන්ද පිහිටුවන ලද බවත් කියැවේ අභය වාපි හෙවත් අභය වැවද එතුමන් විසින් කරවන ලදී කාලවේල සහ චිත්තරාජ නමැති යක්ෂයන් උදෙසා දෙවොල්ද කරවනු ලැබීය චේතියා නමැති යක්ෂණිය උදෙසා වෙළඹකගේ ස්වරූපයෙන් වූ පිළිරුවක් රාජ මාළිග පරිශ්රයේම ඉදි කරවන ලද අතර මේ සියළු යක්ෂ දේවතාවන් උදෙසා වාර්ෂිකව පුද පූජා පැවැත්වීමද සිදු විය නගරයේ සුසාන භූමිය වදක භූමිය පශ්චිම රාජිණියගේ දෙවොල වෙස්සවණ උදෙසා වූ නුග රුක ව්යාධදේව උදෙසා වූ තල් රුක යෝනයන් සඳහා වාස භූමිය ආත්ම පූජා මන්දිරය ආදිය පිහිටැවිය යුතු තැන්ද මෙතුමන් විසින් නියම කරන ලදී වහලුන් නොහොත් චණ්ඩාලයන් විසින් කළ යුතු කාර්යයන් නියම කෙරුණු අතර ඔවුන් උදෙසා ග්රාමයක් වෙන් කරන ලදී නිඝණ්ටයන් තැන තැන සරන තවුසන් ආජීවකයන් සහ බ්රාහ්මණයන් උදෙසා වාසස්ථාන ගොඩ නඟන ලදී ග්රාම සීමාද නීර්ණය කරනු ලැබීය අනුරාධපුරය අග නගරය බවට පත් කරමින් ක්රි පූ සියවස තරම් ඈත යුගයකදී පණ්ඩුකාභය රජතුමන් විසින් බිහි කරනු ලැබූ සම්ප්රදාය ඉතා වැදගත් වේ පික් පුරාණ පරිපාලණ ප්රදේශය අනුරාධපුර මධ්යතන යුගය නගරයට සහ පූජනීය ස්ථානයන්ට කරනු ලැබූ සනීපාරක්ෂක සහ පරිපාලනමය සම්පාදනයන් විසින් පෙන්නුම් කෙරෙනුයේ කාලාන්තරයක් තිසිසේ නගරය කිසියම් මධ්යගත සැලැස්මකට අනුව සංවර්ධනය කෙරුණු බවය පණ්ඩුකාභය රජතුමන්ගේ ඇවෑමෙන් එතුමන්ගේ පුත් මුටසීව රාජපදප්රාප්ත විය හැට වසරක් වූ එතුමන්ගේ රාජ්ය පාලන කාලය තුළ අනුරාධපුර නගරය තවදුරටත් අගනුවර වශයෙන් පවත්වා ගත් අතර බුදු සමය දිවයිනට හඳුන්වා දෙනු ලැබූ මුල් අවදියේදී වැදගත් කාර්යභාරයක් ඉටු කරනු ලැබූ මහාමේඝවන උද්යානය හෙවත් මහමෙවුනා උයන පිහිටුවාලීමද එසමයෙහි සිදුවිය බුදු රජාණන් වහන්සේගේ පිරිනිවන් පෑමෙන් වසර කට පසු ශ්රී ලංකාවට බුදු සමය හඳුන්වාදෙන ලද්දේ මුටසීව රජතුමන්ගේ ඇවැමෙන් රාජ්යත්වයට පත් එතුමන් පුත් දේවානම්පියතිස්ස රාජ්ය සමයෙහිදීය ඉන්දියාවෙහි වුසූ අශෝක අධිරාජයා දේවානම්පියතිස්ස රජතුමන්ගේ සමකාලීනයෙක් විය මෙම කාලය ක්රි පූ අතර කාලයයි ලංකාවෙහි රාජ්යත්වයෙහි ආරම්භය සහ ආසියාවෙහි විශිෂ්ඨතම ආගමක් වූ බුද්ධ ධර්මය මත පදනම් වූ ශිෂ්ඨාචාරයක ආරම්භයද සනිටුහන් කෙරෙන්නේ මෙසමයෙහිය",
        "සීගිරිය ප්රෞඪ ඉතිහාසයකට නෑකම් කියන සිංහල දේශයේ තවත් අභිමානී නගරයක් වූ සිගිරිය අයත් වන්නේද රජරට රාජධානියටයි මෙහි පාලකයා වනුයේ කාශ්යප රජුයි කාශ්යප රජු මෙම ස්ථානය තෝරා ගැනීමට හේතුව වුයේ තම සොහොයුරු මුගලන් කුමරු කෙදිනක හෝ පැමිණ රාජ්ය පැහැරගනීයැයි තිබූ බියයි කලාගාරයක් බඳු මෙහි සීගිරි චිත්ර ඉන්දියාවේ අඡන්තා චිත්ර කලාවට සමාන කමක් දක්වයි මෙම චිත්ර පිලිබඳව අදහස් දක්වන පරණවිතානයන් පෙන්වා දෙන්නේ මෙම චිත්ර වලින් නිරූපණය වන්නේ මෙඝලතා හා චිජ්ජුලතා යන්න ය එනම් විදුලිය හා මේඝගර්ජනය යන ස්වභාවික සිදුවීම්ය මෙහි තවත් සුවිශේෂී අවධානයක් යොමුවන ස්ථානයක් ලෙස සීගිරි කැටපත් පවුර හඳුන්වාදිය හැකිය එහි ලියැවුණු කුරුටු ගී තුළින් හෙළ ගැමියාගේ අදහස් මෙන් ම හෙළ සංස්කෘතිය පිළිබඳවද තොරතුරු හෙළිවේ",
        "රජරට රාජධානියට අඛණ්ඩව පැවතුණු තර්ජනයක් වූයේ දකුණු ඉන්දීය ආක්රමණයන්ය එලෙස සිදු වූ ආක්රමණයන්ගෙන් සතුරන් පරදවා රජධානියේ පාලනය නැවත ලබාගත් දුටුගමුණු වළගම්භා ධාතුසේන වන විජයබාහු ලීලාවතී වැනි පාලකයන් කාගේත් අවධානයට ලක්විය අනෙකුත් පාලකයන් මතකයේ රැඳුනේ ඔවුන් විසින් සිදු කරන ලද හමුදා ජයග්රහණ නිසාය දකුණු ඉන්දියාවට එරෙහිව ආක්රමණයන් දියත් කළ පළවන ගජභාහු පන්ධ්යන් දේවියට පිහිට වීමට තම හමුදාවන් යැවූ දෙවන සේන එවැනි පාලකයන්ය රජරට රාජධානියට එරෙහිව ආක්රමණයන් කිහිපයක් සිදුවූ අතර ඒවා සියල්ලක්ම දියත් කරන ලද්දේ දකුණු ඉන්දියාණුවන් විසිණි ශ්රී ලංකා ඉතිහාසයේ පළමු වාර්තාගත ආක්රමණය සිදුවූයේ සූරතිස්ස ක්රි පූ රජු සමයේදීය එය සිදු කරන ලද්දේ සේන හා ගුත්තික යන දකුණු ඉන්දීය අශ්ව වෙළෙන්දන් දෙදෙනෙකු විසිනි අවුරුදු විසිදෙකක පාලන කාලයෙන් අනතුරුව අසේල ක්රි පූ විසින් ඔවුන් පරජය කරන ලදී ඉන් අනතුරුව පැවති තවත් ආක්රමණයක් හේතුවෙන් චෝළ රජකු වූ එලාර ක්රි පූ අසේල රජු පරදවා රටෙහි පාලකයා බවට පත් විය එලාර අවුරුදු ක් රට පාලනය කළ අතර ඔහුව පරජයට පත් කරන ලද්දේ දුටුගැමුණු විසිනි කෙසේ නමුත් මහාවංශ වාර්තා වලට අනුව එළාර විසින් රට යුක්තිගරුක ලෙස සහ සධාරණ ලෙස පාලනය කළ බව කියැවේ",
        "විසින් රට නැවතත් ආක්රමණය කරන ලදී ඔවුන් ක්රි පූ දක්වා රට පාලනය කළ අතර වළගම්භා හට පරාජයට පත් විය පසුව ඇති වූ තවත් ආක්රමණයක් නිසා රටෙහි පාලනය දකුණු ඉන්දීය පාලකයන් සය දෙනෙකු වූ පණ්ඩු පාරින්ද තිරිතර දාතිය සහ පීතිය යටතට පත් විය ධාතුසේන විසින් ඔවුන් පරදවා නැවත බලය ලබා ගන්නා ලදී වන සේන ක්රි පූ සහ වන උදය ක්රි පූ රජ සමය තුළ දකුණු ඉන්දියාවෙන් බොහෝ ආක්රමණ සහ කොල්ලකෑම් එල්ල විය",
        "කෙසේ නමුත් මෙම ආක්රමණිකයන්ගෙන් කිසිවෙකු ඔවුන්ගේ පාලනය රටෙහි දකුණු ප්රදේශය වූ රුහුණ දක්වා දීර්ඝ කර නොගත්හ එබැවින් ශ්රී ලාංකීය පාලකයන් සහ උරුමක්කාරයන් ඔවුන්ගේ හමුදාවන් මෙම ප්රදේශය තුළ සංවිධානය කොට ගෙන ඔටුන්න නැවත ලබා ගැනීමට සමත් වූහ ශ්රී ලාංකීය ඉතිහාසය මුළුල්ලේම සතුරු ආක්රමණ වලින් රට බේරා ගත් අවස්තාවලදී රුහුණ මුල් වී ඉමහත් සේවයක් කරන ලදී",
        "කිත්සිරිමෙවන් රජ සමයේදී හේමමාලා කුමරිය සහ දන්ත කුමරු විසින් බුදුන් වහන්සේගේ දන්ත ධාතුව ලංකාවට වැඩම කරවන ලදී එම රජු විසින් දන්ත ධාතුව පෙරහැරකින් වඩම්මවා මන්දිරයක තැන්පත් කරන ලදී මෙම පෙරහැර වාර්ශිකව පවත්වන ලෙස රජු අණ කල අතර අදටත් එය චාරිත්රයක් ලෙස රටෙහි පවතී බුදුන් වහන්සේගේ දන්ත ධාතුව ඉතා ඉක්මනින්ම රටෙහි පූජනීය වස්තුවක් මෙන්ම රජ්ය භාවය තහවුරු කරන සංකේතයක් බවට පත් විය දන්ත ධාතුව ළඟ තබා ගන්නා පුද්ගලයා රටෙහි නියම පාලකයා විය එමනිසා බොහෝ විට එය රජ මාළිගාවෙහිම නිදන් කොට තබන ලදී",
        "රජරට රාජධානියේ ප්රධානතම ජයග්රහණය වූයේ වැසි ජලය මනාව කලමණාකරන කලහැකි වාරිමාර්ග බිහිවීමයි ඒ හේතුවෙන් වියළි කලාපයේ කෘෂිකාර්මික අවශ්යතාවන් සඳහා ජලය සැපයීම සිදු විය මෙම වාරිමාර්ග ඉදිකිරීම් මඟින් එම යුගයේ මිනිසුන් තුළ තිබූ උසස් තාක්ෂණික හා ඉංජිනේරු හැකියාවන් මනාව පිළිඹිබු කරයි",
        "තිස්ස රජ මෞර්ය අධිරාජ්යයට අවනතව දේවානම් පියතිස්ස නමින් මෞර්ය සම්ප්රදායනුකූලව නැවත ඔටුනු පැළඳීමත් සමගම රජ සොහොයුරු මහානාග කුමරු රුහුණට පලාගොස් මෞර්ය අධිරාජ්යයට අවනත නොවූ රුහුණු රාජධානිය පිහිටුවාගන්නා ලදී රජරට රාජධානිය ආක්රමණියන් අතට පත් බෝහෝ අවස්ථාවලදී රුහුණු රාජධානිය බලය රැකගැනීමට ස්වදේශික සිංහලයන් සමත්විය",
        "දිගින් දිගටම වූ දකුණු ඉන්දීය ආක්රමණ වලින් තැවුණු නගරය අවසානයේදී ක්රි ව දී අතහැර දැමිණ මෙම මහා නගරය ක්රි පූ වන සියවසයෙහි සිට ක්රි ව දක්වා ලංකාවේ අඟනගරය ලෙස පැවතුනි එහි පසුබැස්ම ඇරඹියේ දකුණි ඉන්දීය ආක්රමණයන්ට එරෙහිව දිගින් දිගටම වූ යුද වැදීම නිස රාජධානිය ආර්ථිකමය අතින් දුප්පත් වීමය ක්රි ව දී චෝල අක්රමණික හමුදාව අනුරාධපුරය අතහැර ඊට සාපේක්ෂව ආරක්ෂිත පොළොන්නරුවට පරිපාලන නගරය ගෙන ගියේය",
        "රාජධානිය රජුගේ පාලනයට යටත් විය රාජ්යත්වයට සම්බන්ධ වූ කැප කිරීමේ උත්සව සහ පිළිවෙත් ක්රමයන් ආරම්භ වූයේ දේවානම්පිය තිස්ස රජු සමයේදීය එය එලෙස සිදු වූයේ ඉන්දියාවේ අශෝක රජුගෙන් ලැබූ ආභාශය හේතු කොට ගෙනය දුටුගැමුණු රජු විසින් ප්රථම වරට මුළු රටම තමන් යටතට පත් කොටගෙන රට එක්සේසත් කරන ලදී ඔටුන්නේ හිමිකාරිත්වයෙහි අනුපිළිවෙල සිදුවූයේ පිය පරම්පරාවට අනුකූලවය එය සිදු කළ නොහැකි අවස්තාවකදී පෙර රජුගේ වැඩිමහල් සහෝදරයාට ඔටුන්නේ හිමිකාරිත්වය උරුමයෙන් ලැබුණි සහෝදරයන් නොසිටියේ නම් වැඩිමහල් පුත්රයා හට ඔටුන්න උරුම විය"
      ],
      "fetch_time": 0.4671440124511719,
      "error": null
    },
    {
      "url": "https://www.mahawansaya.com/era.php?id=3&lang=si",
      "title": "ශ්‍රී ලාංකේය ඉතිහාසය - රජවරු - ආණ්ඩුකාරවරු",
      "snippet": "රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්‍රධාන කාර්‍යයක් විය. බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර, ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය.",
      "paragraphs": [
        "මුල්පිටුව යුග ලංකාපුර යුගය තම්මැන්නා නුවර උපතිස්ස නුවර අනුරාධපුරය අනුරාධපුර චෝල පොලොන්නරුව දඹදෙණිය යාපහුව කුරුණෑගල ගම්පොල කෝට්ටේ සීතාවක නුවර ප්රාදේශ්රීය රුහුණ කැලණිය දැදිගම රයිගම යටත් විජිත පෘතුග්රීසි පාලනය පෘ කපිතාන්වරු පෘ කපිතාන්වරු මේජර් පෘ ආණ්ඩුකාරවරු ලන්දේසි පාලනය ලන්දේසි ආණ්ඩුකාරවරු ඉංග්රීසි පාලනය හමුදා ආණ්ඩුකාරවරු නේවාසික පාලකයා බ්රිතාන්ය ආණ්ඩුකාරවරු ලංකා විධායක සභාව බ්රිතාන්ය රජවරු සිලෝන් අධිපතීන් වින්ඩ්සෝර් වංශය වින්ඩ්සෝර් වංශය පොදු ආණ්ඩුකාරවරු රාජ වංශ විජය පරම්පරාව චෝල වංශය ද්රවිඩ පාලනය ලම්බකර්ණ වංශය මෞර්ය රාජ වංශය ලම්බකර්ණ මානවම්ම රාජ වංශ විජයබාහු වංශය කාලිංග වංශය ලෝකිස්සර පාන්ඩියන් වංශය සිරි සඟ බෝ වංශය දිනරාජ වංශය නායක්කාර වංශය විශ්වමුණි පරපුර රාවණ ක්රියා ගැටුම් ආගමික සාහිත්යය වාරිමාර්ග කෘෂිකර්මය ඉදිකිරීම් විශේෂ සිද්ධීන් වෙනත් පාලනය සමාජීය පාලකයෝ රජවරු ආණ්ඩුකාරවරු ආධිපත්යය රැජිණියන් කපිතාන්වරු රාජ කුමාරයා ඇමති වෙනත් ප්රාදේශ්රීය ර කපිතාන්වරු ලංකාපුර රජවරු ඡායාරූප අපිගැන අමතන්න සිංහල",
        "යුග ලංකාපුර යුගය තම්මැන්නා නුවර උපතිස්ස නුවර අනුරාධපුරය අනුරාධපුර චෝල පොලොන්නරුව දඹදෙණිය යාපහුව කුරුණෑගල ගම්පොල කෝට්ටේ සීතාවක නුවර",
        "ලංකාපුර යුගය තම්මැන්නා නුවර උපතිස්ස නුවර අනුරාධපුරය අනුරාධපුර චෝල පොලොන්නරුව දඹදෙණිය යාපහුව කුරුණෑගල ගම්පොල කෝට්ටේ සීතාවක නුවර",
        "යටත් විජිත පෘතුග්රීසි පාලනය පෘ කපිතාන්වරු පෘ කපිතාන්වරු මේජර් පෘ ආණ්ඩුකාරවරු ලන්දේසි පාලනය ලන්දේසි ආණ්ඩුකාරවරු ඉංග්රීසි පාලනය හමුදා ආණ්ඩුකාරවරු නේවාසික පාලකයා බ්රිතාන්ය ආණ්ඩුකාරවරු ලංකා විධායක සභාව බ්රිතාන්ය රජවරු සිලෝන් අධිපතීන් වින්ඩ්සෝර් වංශය වින්ඩ්සෝර් වංශය පොදු ආණ්ඩුකාරවරු",
        "පෘතුග්රීසි පාලනය පෘ කපිතාන්වරු පෘ කපිතාන්වරු මේජර් පෘ ආණ්ඩුකාරවරු ලන්දේසි පාලනය ලන්දේසි ආණ්ඩුකාරවරු ඉංග්රීසි පාලනය හමුදා ආණ්ඩුකාරවරු නේවාසික පාලකයා බ්රිතාන්ය ආණ්ඩුකාරවරු ලංකා විධායක සභාව බ්රිතාන්ය රජවරු සිලෝන් අධිපතීන් වින්ඩ්සෝර් වංශය වින්ඩ්සෝර් වංශය පොදු ආණ්ඩුකාරවරු",
        "රාජ වංශ විජය පරම්පරාව චෝල වංශය ද්රවිඩ පාලනය ලම්බකර්ණ වංශය මෞර්ය රාජ වංශය ලම්බකර්ණ මානවම්ම රාජ වංශ විජයබාහු වංශය කාලිංග වංශය ලෝකිස්සර පාන්ඩියන් වංශය සිරි සඟ බෝ වංශය දිනරාජ වංශය නායක්කාර වංශය විශ්වමුණි පරපුර රාවණ",
        "විජය පරම්පරාව චෝල වංශය ද්රවිඩ පාලනය ලම්බකර්ණ වංශය මෞර්ය රාජ වංශය ලම්බකර්ණ මානවම්ම රාජ වංශ විජයබාහු වංශය කාලිංග වංශය ලෝකිස්සර පාන්ඩියන් වංශය සිරි සඟ බෝ වංශය දිනරාජ වංශය නායක්කාර වංශය විශ්වමුණි පරපුර රාවණ",
        "ක්රියා ගැටුම් ආගමික සාහිත්යය වාරිමාර්ග කෘෂිකර්මය ඉදිකිරීම් විශේෂ සිද්ධීන් වෙනත් පාලනය සමාජීය",
        "ගැටුම් ආගමික සාහිත්යය වාරිමාර්ග කෘෂිකර්මය ඉදිකිරීම් විශේෂ සිද්ධීන් වෙනත් පාලනය සමාජීය",
        "පාලකයෝ රජවරු ආණ්ඩුකාරවරු ආධිපත්යය රැජිණියන් කපිතාන්වරු රාජ කුමාරයා ඇමති වෙනත් ප්රාදේශ්රීය ර කපිතාන්වරු ලංකාපුර රජවරු",
        "රජවරු ආණ්ඩුකාරවරු ආධිපත්යය රැජිණියන් කපිතාන්වරු රාජ කුමාරයා ඇමති වෙනත් ප්රාදේශ්රීය ර කපිතාන්වරු ලංකාපුර රජවරු",
        "අනුරාධපුරය වත්මන් ශ්රි ලංකාව පිහිටි භූමියේ ප්රථම සංවිධානාත්මක නවීන රාජධානිය වුයේ රජරට රාජධානියයි මුල් යුගයේ උපතිස්සනුවර අගනුවර වූ අතර පණ්ඩුකාභය රජ විසින් අනුරාධගම අගනුවර කරගෙන එය පුරවරයක් දකිවා සංවර්ධනය කරන ලදී රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්රධාන කාර්යයක් විය බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය මෙම ඉදිකිරීම් නිසා අනුරාධපුර යුගය මුළුල්ලේම රජරට ප්රදේශය තුළ විශාල එමෙන්ම සංකීර්ණ වාරිමාර්ග පද්ධතියක් බිහි විය රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්රධාන කාර්යයක් විය බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය මෙම ඉදිකිරීම් නිසා අනුරාධපුර යුගය මුළුල්ලේම රජරට ප්රදේශය තුළ විශාල එමෙන්ම සංකීර්ණ වාරිමාර්ග පද්ධතියක් බිහි විය එකල ඉදි කරන ලද මහා ස්ථුපයන් වූ රුවන්වැලිසෑය ජේතවණාරාමය මෙන්ම ලෝවාමහාපාය වැනි විශාල ගොඩනැගිලි මඟින් අනුරාධපුර යුගයේ තිබූ ගෘහ නිර්මාණ ශිල්පයේ දියුණුව මනාව පෙන්නුම් කරයි",
        "වත්මන් ශ්රි ලංකාව පිහිටි භූමියේ ප්රථම සංවිධානාත්මක නවීන රාජධානිය වුයේ රජරට රාජධානියයි",
        "මුල් යුගයේ උපතිස්සනුවර අගනුවර වූ අතර පණ්ඩුකාභය රජ විසින් අනුරාධගම අගනුවර කරගෙන එය පුරවරයක් දකිවා සංවර්ධනය කරන ලදී රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්රධාන කාර්යයක් විය බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය මෙම ඉදිකිරීම් නිසා අනුරාධපුර යුගය මුළුල්ලේම රජරට ප්රදේශය තුළ විශාල එමෙන්ම සංකීර්ණ වාරිමාර්ග පද්ධතියක් බිහි විය",
        "රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්රධාන කාර්යයක් විය බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය මෙම ඉදිකිරීම් නිසා අනුරාධපුර යුගය මුළුල්ලේම රජරට ප්රදේශය තුළ විශාල එමෙන්ම සංකීර්ණ වාරිමාර්ග පද්ධතියක් බිහි විය එකල ඉදි කරන ලද මහා ස්ථුපයන් වූ රුවන්වැලිසෑය ජේතවණාරාමය මෙන්ම ලෝවාමහාපාය වැනි විශාල ගොඩනැගිලි මඟින් අනුරාධපුර යුගයේ තිබූ ගෘහ නිර්මාණ ශිල්පයේ දියුණුව මනාව පෙන්නුම් කරයි",
        "පාලකයෝ පණ්ඩුකාභය රජතුමා මුටසීව රජතුමා දේවානම්පියතිස්ස රජතුමා උත්තිය රජතුමා මහාසිව රජතුමා සූරතිස්ස රජතුමා සේන හා ගුත්තික අසේල රජතුමා එළාර රජතුමා දුටුගැමුණු රජතුමා සද්ධාතිස්ස රජතුමා තුලත්ථන රජතුමා ලංජතිස්ස රජතුමා බල්ලාඨනාග රජතුමා වළගම්බා රජතුමා පුලහත්ත භාහිය පනයමාර පිලියමාර දාඨිය වළගම්බා රජතුමා මහසිළු මහාතිස්ස රජතුමා චෞර නාග රජතුමා කුඩා තිස්ස රජතුමා අනුලා රැජින නීලිය දාරුභාතික තිස්ස වටුක සිව කූඨකණ්ණ තිස්ස රජතුමා භාතික අභය රජතුමා මහාදාඨික මහානාග රජතුමා අමණ්ඩගාමණී අභය රජතුමා කණිරජානු තිස්ස රජතුමා චූලාභය රජතුමා සීවලී රැජින ලම්බකර්ණ ගෝත්රිකයෝ ඉලනාග රජතුමා චන්ද්රමුඛසිව රජතුමා යසලාලක තිස්ස රජතුමා සුභ රජතුමා වසභ රජතුමා වංකනාසික තිස්ස රජතුමා වන ගජබාහු රජතුමා මහල්ලකනාග රජතුමා භාතික තිස්ස රජතුමා කනිට්ඨතිස්ස රජතුමා බුජ්ජනාග රජතුමා කුංචනාග රජතුමා වන සිරිනාග රජතුමා වෝහාරිකතිස්ස රජතුමා අභයනාග රජතුමා වන සිරිනාග රජතුමා විජය කුමාර රජතුමා වන සංඝතිස්ස රජතුමා සිරි සංග බෝධි රජතුමා ගෝඨාභය රජතුමා වන ජෙට්ඨතිස්ස රජතුමා මහසෙන් රජතුමා කිත්සිරිමෙවන් රජතුමා වන ජෙට්ඨතිස්ස රජතුමා බුද්ධදාස රජතුමා වන උපතිස්ස රජතුමා මහානාම රජතුමා සෝත්තිසේන රජතුමා ජත්තගාහක ජන්තු රජතුමා මිත්තසේන රජතුමා පණ්ඩු රජතුමා පාරින්ද රජතුමා කුඩා පාරින්ද රජතුමා තිරිතර රජතුමා දාඨිය රජතුමා පීඨිය රජතුමා ධාතුසේන රජතුමා වන කස්සප රජතුමා මොග්ගල්ලාන රජතුමා කුමාරදාස රජතුමා කිත්තිසේන රජතුමා සිව රජතුමා වන උපතිස්ස සිලාකාල රජතුමා දාඨාපභූති රජතුමා වන මොග්ගල්ලාන රජතුමා කිත්සිරිමේඝ රජතුමා මහානාග රජතුමා වන අග්ගබෝධි රජතුමා වන අග්ගබෝධි රජතුමා වන මොග්ගල්ලාන රජතුමා වන සංඝතිස්ස රජතුමා සීලාමේඝවණ්ණ රජතුමා වන අග්ගබෝධි රජතුමා වන ජෙට්ඨතිස්ස රජතුමා වන අග්ගබෝධි රජතුමා දාඨෝපතිස්ස රජතුමා වන කස්සප රජතුමා වන දාඨෝපතිස්ස රජතුමා වන දප්පුල රජතුමා වන අග්ගබෝධි රජතුමා දත්ත රජතුමා හත්ථදාඨ රජතුමා මානවම්ම රජතුමා වන අග්ගබෝධි රජතුමා වන කස්සප රජතුමා වන මහින්ද රජතුමා වන අග්ගබෝධි රජතුමා වන අග්ගබෝධි රජතුමා වන මහින්ද රජතුමා වන දප්පුල රජතුමා වන මහින්ද රජතුමා වන අග්ගබෝධි රජතුමා වන දප්පුල රජතුමා වන අග්ගබෝධි රජතුමා වන සේන රජතුමා වනසේන රජතුමා වන උදය රජතුමා වන කස්සප රජතුමා වන කස්සප රජතුමා වන දප්පුල රජතුමා වන දප්පුල රජතුමා වන උදය රජතුමා වන සේන රජතුමා වන උදය රජතුමා වන සේන රජතුමා වන මහින්ද රජතුමා වන සේන රජතුමා වන මහින්ද රජතුමා",
        "පණ්ඩුකාභය රජතුමා මුටසීව රජතුමා දේවානම්පියතිස්ස රජතුමා උත්තිය රජතුමා මහාසිව රජතුමා සූරතිස්ස රජතුමා සේන හා ගුත්තික අසේල රජතුමා එළාර රජතුමා දුටුගැමුණු රජතුමා සද්ධාතිස්ස රජතුමා තුලත්ථන රජතුමා ලංජතිස්ස රජතුමා බල්ලාඨනාග රජතුමා වළගම්බා රජතුමා පුලහත්ත භාහිය පනයමාර පිලියමාර දාඨිය වළගම්බා රජතුමා මහසිළු මහාතිස්ස රජතුමා චෞර නාග රජතුමා කුඩා තිස්ස රජතුමා අනුලා රැජින නීලිය දාරුභාතික තිස්ස වටුක සිව කූඨකණ්ණ තිස්ස රජතුමා භාතික අභය රජතුමා මහාදාඨික මහානාග රජතුමා අමණ්ඩගාමණී අභය රජතුමා කණිරජානු තිස්ස රජතුමා චූලාභය රජතුමා සීවලී රැජින ලම්බකර්ණ ගෝත්රිකයෝ ඉලනාග රජතුමා චන්ද්රමුඛසිව රජතුමා යසලාලක තිස්ස රජතුමා සුභ රජතුමා වසභ රජතුමා වංකනාසික තිස්ස රජතුමා වන ගජබාහු රජතුමා මහල්ලකනාග රජතුමා භාතික තිස්ස රජතුමා කනිට්ඨතිස්ස රජතුමා බුජ්ජනාග රජතුමා කුංචනාග රජතුමා වන සිරිනාග රජතුමා වෝහාරිකතිස්ස රජතුමා අභයනාග රජතුමා වන සිරිනාග රජතුමා විජය කුමාර රජතුමා වන සංඝතිස්ස රජතුමා සිරි සංග බෝධි රජතුමා ගෝඨාභය රජතුමා වන ජෙට්ඨතිස්ස රජතුමා මහසෙන් රජතුමා කිත්සිරිමෙවන් රජතුමා වන ජෙට්ඨතිස්ස රජතුමා බුද්ධදාස රජතුමා වන උපතිස්ස රජතුමා",
        "මහානාම රජතුමා සෝත්තිසේන රජතුමා ජත්තගාහක ජන්තු රජතුමා මිත්තසේන රජතුමා පණ්ඩු රජතුමා පාරින්ද රජතුමා කුඩා පාරින්ද රජතුමා තිරිතර රජතුමා දාඨිය රජතුමා පීඨිය රජතුමා ධාතුසේන රජතුමා වන කස්සප රජතුමා මොග්ගල්ලාන රජතුමා කුමාරදාස රජතුමා කිත්තිසේන රජතුමා සිව රජතුමා වන උපතිස්ස සිලාකාල රජතුමා දාඨාපභූති රජතුමා වන මොග්ගල්ලාන රජතුමා කිත්සිරිමේඝ රජතුමා මහානාග රජතුමා වන අග්ගබෝධි රජතුමා වන අග්ගබෝධි රජතුමා වන මොග්ගල්ලාන රජතුමා වන සංඝතිස්ස රජතුමා සීලාමේඝවණ්ණ රජතුමා වන අග්ගබෝධි රජතුමා වන ජෙට්ඨතිස්ස රජතුමා වන අග්ගබෝධි රජතුමා දාඨෝපතිස්ස රජතුමා වන කස්සප රජතුමා වන දාඨෝපතිස්ස රජතුමා වන දප්පුල රජතුමා වන අග්ගබෝධි රජතුමා දත්ත රජතුමා හත්ථදාඨ රජතුමා මානවම්ම රජතුමා වන අග්ගබෝධි රජතුමා වන කස්සප රජතුමා වන මහින්ද රජතුමා වන අග්ගබෝධි රජතුමා වන අග්ගබෝධි රජතුමා වන මහින්ද රජතුමා වන දප්පුල රජතුමා වන මහින්ද රජතුමා වන අග්ගබෝධි රජතුමා වන දප්පුල රජතුමා වන අග්ගබෝධි රජතුමා වන සේන රජතුමා වනසේන රජතුමා වන උදය රජතුමා වන කස්සප රජතුමා වන කස්සප රජතුමා වන දප්පුල රජතුමා වන දප්පුල රජතුමා වන උදය රජතුමා වන සේන රජතුමා වන උදය රජතුමා වන සේන රජතුමා වන මහින්ද රජතුමා වන සේන රජතුමා වන මහින්ද රජතුමා",
        "ක්රියා රුවන්වැලිසෑය හෙවත් රුවන්වැලි දාගැබ දුටුගැමුණු රජතුමා මහමෙව්නාව උද්යානය මුටසීව රජතුමා ථුපාරාමය දාගැබ දේවානම්පියතිස්ස රජතුමා බුද්ධාගම වැලඳගැනීම දේවානම්පියතිස්ස රජතුමා ශ්රී මහා බෝධිය රෝපණය දේවානම්පියතිස්ස රජතුමා එළාර රජු පරාජය කිරීම් දුටුගැමුණු රජතුමා අසේල රජු පරාජය කිරීම එළාර රජතුමා සූරතිස්ස රජු පරාජය කිරීම සේන හා ගුත්තික පංච ද්රවිඩයන්ගේ ආක්රමණය වළගම්බා රජතුමා අභයගිරි විහාරය තැනීම වළගම්බා රජතුමා අභයගිරි ස්ථුපය තැනීම වළගම්බා රජතුමා ත්රිපිටකය ග්රන්ථාරූඪ කිරිම වළගම්බා රජතුමා බැමිණිතියා සාය මහා දුර්භික්ෂය වළගම්බා රජතුමා අනුරාධපුර අගනුවර ගොඩනැගීම පණ්ඩුකාභය රජතුමා ක්රමවත් සුසාන භුමි ඇති කිරීම පණ්ඩුකාභය රජතුමා නගර පාලකයකු පත්කිරීම නගර ගුත්තික පණ්ඩුකාභය රජතුමා අභය වැව බසවක්කුලම නිර්මාණය පණ්ඩුකාභය රජතුමා ග්රාම සීමා නියම කිරීම පණ්ඩුකාභය රජතුමා කසල සෝදකයන් පත් කිරීම පණ්ඩුකාභය රජතුමා සෞඛ්ය පිලිබඳ විධිමත් සැලැස්මක් ඇති කිරී පණ්ඩුකාභය රජතුමා ශ්රී ලංකාවේ ප්රථම මෞර්ය රාජවංශය ආරම්භ ක පණ්ඩුකාභය රජතුමා චේතියගිරි විහාරය ඉදිකිරීම දේවානම්පියතිස්ස රජතුමා මහමෙව්නාවේ මහා විහාරය ඉදිකිරීම දේවානම්පියතිස්ස රජතුමා කට අධික පිරිසක් පැවිදි කිරීම දේවානම්පියතිස්ස රජතුමා සඟමිත් තෙරණියෝ වැඩම කරවීම දේවානම්පියතිස්ස රජතුමා ලංකාවේ මෙහෙණි සස්න ආරම්භ කිරීම දේවානම්පියතිස්ස රජතුමා රුවන්වැලි සෑ බිමේ ගල් ටැඹ පිහිටුවීම දේවානම්පියතිස්ස රජතුමා වෙස්සගිරි විහාරය කරවීම දේවානම්පියතිස්ස රජතුමා උපාසිකා විහාරය කරවීම දේවානම්පියතිස්ස රජතුමා මහාපාලි බත් දන්සල පිහිටුවීම දේවානම්පියතිස්ස රජතුමා දඹකොළ විහාරය කරවීම දේවානම්පියතිස්ස රජතුමා ප්රාචීනාරාම විහාරය කරවීම දේවානම්පියතිස්ස රජතුමා ප්රථම වරට වැදගත් ලෙසට සිදු වූ රාජාභිෂේකය දේවානම්පියතිස්ස රජතුමා මිහිඳු මහරහතන් වහන්සේගේ පරිනිර්වාණය උත්තිය රජතුමා සංඝමිත්තා තෙරණියගේ පරිනිර්වාණය උත්තිය රජතුමා මිහිඳු මහා සෑය ඉදි කිරීම උත්තිය රජතුමා සංඝමිත්තා සෑය ඉදි කිරීම උත්තිය රජතුමා නාගරංජන විහාරය ඉදි කිරීම මහාසිව රජතුමා විහාර ක් ඉදි කිරීම සූරතිස්ස රජතුමා ලෝවාමහාපාය විහාරය කරවීම දුටුගැමුණු රජතුමා මිරිසවැටිය විහාරය කරවීම දුටුගැමුණු රජතුමා තුන්සිංහලයම ඵක්සේසත් කිරීම දුටුගැමුණු රජතුමා පදවිය වැව කරවීම සද්ධාතිස්ස රජතුමා කටුන්නරු වැව කරවීම සද්ධාතිස්ස රජතුමා මාලම වැව කරවීම සද්ධාතිස්ස රජතුමා දුරතිස් වැව කරවීම සද්ධාතිස්ස රජතුමා මුල්ගිරිගල විහාරය කරවීම සද්ධාතිස්ස රජතුමා ගින්නෙන් දැවී ගිය ලෝවාමහාපාය ප්රතිසංස් සද්ධාතිස්ස රජතුමා රුවන්වැලි සෑය නිම කිරීම සද්ධාතිස්ස රජතුමා රුවන්වැලි සෑයේ ඇත් පවුර කරවීම සද්ධාතිස්ස රජතුමා කල්ලක ලෙන් විහාරය කරවීම සද්ධාතිස්ස රජතුමා කුලුම්බලා විහාරය කරවීම සද්ධාතිස්ස රජතුමා පෙතංග වැලි විහාරය කරවීම සද්ධාතිස්ස රජතුමා වෙළඟවැටිය විහාරය කරවීම සද්ධාතිස්ස රජතුමා දුඹුල් වැතිස් විහාරය කරවීම සද්ධාතිස්ස රජතුමා මාතු විහාරය කරවීම සද්ධාතිස්ස රජතුමා කන්දර විහාරය කරවීම තුලත්ථන රජතුමා වැඩිමහල් සහෝදර ලජ්ජිතිස්ස විසින් මරා දමන ලදී තුලත්ථන රජතුමා මහා සෑයට ශෛලමය මල් ආසන තුනක් කරවීම ලංජතිස්ස රජතුමා ථූපාරාම භුමියේ ධාතු මන්දිරයක් කරවීම ලංජතිස්ස රජතුමා ථූපාරාම භුමියේ ශෛලමය දාගැබක් කරවීම ලංජතිස්ස රජතුමා රිටිගල විහාරය කරවීම ලංජතිස්ස රජතුමා අරිට්ඨ විහාරය කරවීම ලංජතිස්ස රජතුමා මිහින්තලේ කණ්ඨක දාගැබ ප්රතිසංස්කරණය කරවීම ලංජතිස්ස රජතුමා තම සහෝදරයා වන තුල්ලත්තන රජු මරා දැමීම ලංජතිස්ස රජතුමා මාමාවරු දෙනෙකු ඝාතනය කිරීම පණ්ඩුකාභය රජතුමා ඇත්කඳ විහාරය කරවීම සූරතිස්ස රජතුමා නැගෙනහිර පව් විහාරය කරවීම සූරතිස්ස රජතුමා කොලම්බාලක විහාරය කරවීම සූරතිස්ස රජතුමා ගිරිනිල් පනාකඩ විහාරය කරවීම සූරතිස්ස රජතුමා ලෝවා මහාපාය වටා ප්රාසාද ක් කරවීම බල්ලාඨනාග රජතුමා රුවන්වැලි සෑය වැලි මලුව වටා ගල් බැම්මක් බැඳීම බල්ලාඨනාග රජතුමා සේන සහ ගුත්තික මරා අසේල රජු රාජ්ය ලබා ගන්නා ලදී අසේල රජතුමා එළාර රජු විසින් අසේල රජු මරා දමන ලදී එළාර රජතුමා කුරුන්ද පාසක විහාරය කරවීම බල්ලාඨනාග රජතුමා බමුණු වංශික තිස්ස කැරැල්ලක් ආරම්භ කරන ලදී වළගම්බා රජතුමා දමිළයන් සෝමා දේවිය අල්ලා ඉන්දියාවට රැගෙන යාම වළගම්බා රජතුමා මන්දවාපි විහාරය කරවීය මහසිළු මහාතිස්ස රජතුමා අබාගල විහාරය කරවීය මහසිළු මහාතිස්ස රජතුමා වගුපවුගල විහාරය කරවීය මහසිළු මහාතිස්ස රජතුමා දිගබාගල විහාරය කරවීය මහසිළු මහාතිස්ස රජතුමා වාලගම විහාරය කරවීය මහසිළු මහාතිස්ස රජතුමා රජුට නවාතැන් නොදුන් විහාර ක් කඩා දැමීය චෞර නාග රජතුමා අනුලා බිසව රජුට වස දී මරා දැමීය චෞර නාග රජතුමා අනුලා බිසව රජුට වස දී මරා දැමීය කුඩා තිස්ස රජතුමා අනුලා බිසව වස දී මරා දැමීය සිව අනුලා බිසව වස දී මරා දැමීය වටුක අනුලා බිසව වස දී මරා දැමීය දාරුභාතික තිස්ස අනුලා බිසව වස දී මරා දැමීය නීලිය චෝර නාග රජු වස දී මරා දැමීය අනුලා රැජින තිස්ස රජුට වස දී මරා දැමීය අනුලා රැජින සිව රජුට වස දී මරා දැමීය අනුලා රැජින වටුක රජුට වස දී මරා දැමීය අනුලා රැජින නීලිය රජුට වස දී මරා දැමීය අනුලා රැජින දාරුබාතික තිස්ස රජුට වස දී මරා දැමීය අනුලා රැජින කුටකන්න තිස්ස රජු විසින් අනුලා බිසව මරා දැමීය කූඨකණ්ණ තිස්ස රජතුමා තෙලගාම විහාරය කරවීය කූඨකණ්ණ තිස්ස රජතුමා වර්ණක නම් වූ මහමොවූ ඇල නිර්මාණය කිරීම කූඨකණ්ණ තිස්ස රජතුමා ඇම්බදුග්ග වැව කරවීය කූඨකණ්ණ තිස්ස රජතුමා භයෝදුප්පල වැව කරවීය කූඨකණ්ණ තිස්ස රජතුමා නගරය වටා සත් රියන් පවුරක් කරවීය කූඨකණ්ණ තිස්ස රජතුමා පවුර වටා දිය අගලක් කරවීය කූඨකණ්ණ තිස්ස රජතුමා පද්මස්වර උද්යානය කරවීය කූඨකණ්ණ තිස්ස රජතුමා රෝමයට දූතයන් යවා මුතු ගෙන්වා රුවන්වැලි සෑය සැරසවීය භාතික අභය රජතුමා රට පුරාම සත්ව ඝාතනය තහනම් කළේය භාතික අභය රජතුමා අධිකරණ කටයුතු සාර්ථකව කරන ලදී භාතික අභය රජතුමා අනුරාධපුරයේ සිට එක යොදුනක් දක්වා සුවදැති මල් පැලෑටි රෝපණය කරවීය භාතික අභය රජතුමා වසරක් පාසා රුවන්වැලි සෑ රදුන්ට හුණු පිරියාම මංගල්ය කරවීම භාතික අභය රජතුමා අටවිස්සක් මහා වෙසක් පූජාව කරවීය භාතික අභය රජතුමා රුවන්වැලි සෑ මළුව විශාල කරවීය මහාදාඨික මහානාග රජතුමා මිහින්තලේ සේල ස්ථූපය කරවීය මහාදාඨික මහානාග රජතුමා අනුරාධපුරයේ සතර දොරටුවෙහි දාන ශාලා ක් කරවීය මහාදාඨික මහානාග රජතුමා ලක්දිව පුරා පහන් පූජා පැවැත්විය මහාදාඨික මහානාග රජතුමා මුහුදෙහි යොදුනක් දුරට පහන් පූජාවක් කරවීය ගිරිහඬ පූජා මහාදාඨික මහානාග රජතුමා සිරකරුවෝ සියලු දෙනා නිදහස් කළේය මහාදාඨික මහානාග රජතුමා මිනිනාපවූ විහාරය කරවීය මහාදාඨික මහානාග රජතුමා කලන්දක විහාරය කරවීය මහාදාඨික මහානාග රජතුමා චූලනාග විහාරය කරවීය මහාදාඨික මහානාග රජතුමා මහා සෑ රදුන්ගේ ජත්රය මත තවත් ජත්රයක් කරවීය අමණ්ඩගාමණී අභය රජතුමා මහා සෑ රදුන්ගේ පිලිකඩ සහ මුදුන් පිලිකඩ කරවීය අමණ්ඩගාමණී අභය රජතුමා ලෝවාමහාපායෙහි ඇතුළු මිදුල් සහ ආලින්දය කරවීය අමණ්ඩගාමණී අභය රජතුමා ථූපාරාම පොහොගෙයහි ඇතුළු මිදුල් සහ ආලින්දය කරවීය අමණ්ඩගාමණී අභය රජතුමා සතුන් මැරීම තහනම් කරවීය අමණ්ඩගාමණී අභය රජතුමා රිදී විහාරය කරවීය අමණ්ඩගාමණී අභය රජතුමා මහානාම මන්දවාපි දකුණු දිග වැව කරවීය අමණ්ඩගාමණී අභය රජතුමා තම සහෝදර අමන්ද ගාමිණි මරා රජවිය කණිරජානු තිස්ස රජතුමා සෑගිරි විහාරයේ නමක් මරා දමන ලදී කණිරජානු තිස්ස රජතුමා දකුණු දිග චූලගල්ල විහාරය කරවීය චූලාභය රජතුමා තිසා වැව කරවීය ඉලනාග රජතුමා දුරතිසා වැව කරවීය ඉලනාග රජතුමා ඉසුරුමුණිය විහාරයට කුඹුරු විශාල ප්රමාණයක් දන් දෙන ලදී ඉලනාග රජතුමා මනිකාර ගමේ වැවක් තනවන ලදී චන්ද්රමුඛසිව රජතුමා තම සොයුරු චන්ද්රමුඛසිව මරා රජ විය යසලාලක තිස්ස රජතුමා සමාන රුව ඇති දොරටුපාලකයෙකු නිසා ජීවිතය අහිමි විය යසලාලක තිස්ස රජතුමා උපලදොනික වැව ප්රතිසංස්කරණය කරවීම සුභ රජතුමා උරුවෙල ගම අසල වල්ලි විහාරය කරවීම සුභ රජතුමා එක්ද්වාරික විහාරය කරවීම සුභ රජතුමා ගන්තෙර නන්දිග්රාමි විහාරය කරවීම සුභ රජතුමා සුභ පිරිවෙන කරවීම සුභ රජතුමා රාජ පිරිවෙන කරවීම සුභ රජතුමා සුහ රජු මරා රජකමට පත්විය වසභ රජතුමා වසර තුනකට වරක් සියළුම සඟුනට සිවුරු පිදීය වසභ රජතුමා ප්රදේශ ක දාන දෙන ලදී වසභ රජතුමා සෑගිරිය ථූපාරාමය මහා සෑය සහ ශ්රී මහා බෝධියේ දහසක් පහන් පූජා පැවැත්විය වසභ රජතුමා සිතුල් පව්ව විහාරයේ දාගැබ් ක් ඉදි කරවීය වසභ රජතුමා මහාවල්ලි ගොනු විහාරය ඉදි කරවීය වසභ රජතුමා මාගම අනුරාධරාම විහාරය ඉදි කරවීය වසභ රජතුමා මූවෙල විහාරය ඉදි කරවීය වසභ රජතුමා කුදුගල විහාරයේ පොහොය ගෙය ඉදි කරවීය වසභ රජතුමා ඉසුරුමුණි විහාරයේ පොහොය ගෙය ඉදි කරවීය වසභ රජතුමා ථූපාරාම විහාරයේ දා ගෙය ඉදි කරවීය වසභ රජතුමා මහාසෑයේ පිරිවෙන් කිහිපයක් ඉදි කරවීය වසභ රජතුමා වල්ලිසේර විහාරය ඉදි කරවීය වසභ රජතුමා මහා විහාරයේ සතරැස් ශාලාව ඉදි කරවීය වසභ රජතුමා මහා විහාරයේ බෝ මළුවේ පිළිම ගෙයක් ඉදි කරවීය වසභ රජතුමා අනුරාධපුර සතර දොරටුවෙහි දිළින්දන්ට දිළිඳු වැටුප් දෙන ලදී වසභ රජතුමා අනුරාධපුර සතර දොරටුවෙහි ගිලන් සංඝයාට ගිලන් වැටුප් දෙන ලදී වසභ රජතුමා මාසෙත් වැව කරවීය වසභ රජතුමා අග්නිවඩ්ඩමානවාපි වැව හබරණ වැව කරවීය වසභ රජතුමා මහානික්කවට්ටි වැව මානන්කුටිය වැව කරවීය වසභ රජතුමා කොහාලවාපි වැව මන්නාරම අසල කොනහාල වැව කරවීය වසභ රජතුමා කාලිවාපි වැව කාලියවදන වැව කරවීය වසභ රජතුමා මහාවාපි වැව නොච්චියාගම වැව කරවීය වසභ රජතුමා වයන්තිවාපි වැව මහාවිලච්චිය වැව කරවීය වසභ රජතුමා කොලම්බ ගාමක වැව කරවීය වසභ රජතුමා අම්බිටි වැව කරවීය වසභ රජතුමා මාගම වැව කරවීය වසභ රජතුමා මාගම වැව කරවීය වසභ රජතුමා අලීසාර ඇල ඇලහැර ඇල කරවීය වසභ රජතුමා තව ඇලවල් කරවීය තවම හඳුනාගෙන නැත වසභ රජතුමා උමන්ජලවාතිකා හෙවත් ජලනල පද්ධති ඇති කළේය වසභ රජතුමා කලිකාලන්ගේ හමුදාව නගරය කොල්ලකා තරුණයක් ක් වහලුන් ලෙස ඉන්දියාවට ගෙනයන ලදී වංකනාසික තිස්ස රජතුමා ගෝන නදිය අසල මහාමංගල විහාරය කරවීය වංකනාසික තිස්ස රජතුමා සොලී දේශයේ සිටි සිංහල වහලුන් බේරාගෙන තවද සොලීන් ක්ද රැගෙන එන ලදී වන ගජබාහු රජතුමා සොලීන් සතුව තිබූ බුදුන් වහන්සේගේ පාත්රා ධාතුව රැගෙන එන ලදී වන ගජබාහු රජතුමා පත්තිනි ඇදහීම ලංකාවට ගෙන එන ලදී වන ගජබාහු රජතුමා පත්තිනි දෙවියන් වෙනුවෙන් ඇසල පෙරහැර ආරම්භ කිරීම වන ගජබාහු රජතුමා ගමුනුතිස් වැව කරවීය වන ගජබාහු රජතුමා රමක විහාරය කරවීය වන ගජබාහු රජතුමා අභයගිරි ථූපය විශාල කිරීම වන ගජබාහු රජතුමා අභයගිරියෙහි ගාමිණි පොකුණ කරවීය වන ගජබාහු රජතුමා නීලමහා යෝධයා මෙම රජුගේ සෙනෙවියා ලෙස කටයුතු කළේය වන ගජබාහු රජතුමා පේජලක විහාරය කරවීය මහල්ලකනාග රජතුමා කොටපබ්බත විහාරය කරවීය කොටගල් වෙහෙර මහල්ලකනාග රජතුමා දකපාසාණ විහාරය කරවීය උදපහන් විහාරය මහල්ලකනාග රජතුමා නාගදීපයේ සාලිපබ්බත විහාරය කරවීය ඇල්ගිරිය විහාරය මහල්ලකනාග රජතුමා තෙනවෙලි විහාරය කරවීය මහල්ලකනාග රජතුමා කොබ්බලනාග විහාරය කරවීය මහල්ලකනාග රජතුමා ගිරිනාලික විහාරය කරවීය මහල්ලකනාග රජතුමා ගවරතිස්ස විහාරය කරවීය භාතික තිස්ස රජතුමා භාතිය තිස්ස විහාරය කරවීය භාතික තිස්ස රජතුමා රුවන්වැලි සෑය වටා තාප්පයක් ඉදි කරවීය භාතික තිස්ස රජතුමා ථූපාරාමයේ පොහොය ගෙය කරවීය භාතික තිස්ස රජතුමා නාගදීපයේ පළුදාගෙය කරවීය භාතික තිස්ස රජතුමා මාමිනියා වැව කරවීය මහා ගාමිණි වැව භාතික තිස්ස රජතුමා රන්ධකන්ඩක වැව කරවීය භාතික තිස්ස රජතුමා මනිසෝම විහාරයෙහි මහා පිරිවෙන කරවීය කනිට්ඨතිස්ස රජතුමා අභයගිරි විහාරයෙහි රත්නප්රාසාදය කරවීය කනිට්ඨතිස්ස රජතුමා අම්බස්තල විහාරයෙහි වටදාගෙය කරවීය කනිට්ඨතිස්ස රජතුමා නාගදීප විහාරයෙහි වටදාගෙය කරවීය කනිට්ඨතිස්ස රජතුමා කැලණිය ආරාමයෙහි උපෝසතාගාරය කරවීය කනිට්ඨතිස්ස රජතුමා මන්ඩලගිරිය ආරාමයෙහි උපෝසතාගාරය කරවීය කනිට්ඨතිස්ස රජතුමා දූරතිස්සවාපිය ආරාමයෙහි උපෝසතාගාරය කරවීය කනිට්ඨතිස්ස රජතුමා කුක්කුට ගිරි පිරිවෙන් පෙළ කරවීය කනිට්ඨතිස්ස රජතුමා දක්ඛිණ විහාරයේ දන්හල කරවීය කනිට්ඨතිස්ස රජතුමා දක්ඛිණ විහාරයට යාමට මාර්ගයක් කරවීය කනිට්ඨතිස්ස රජතුමා දීඝවාපි ස්ථූපය ප්රතිසංස්කරණය කිරීම කනිට්ඨතිස්ස රජතුමා දීඝවාපි ස්ථූපයේ ධාතු නිධන් කිරීම කනිට්ඨතිස්ස රජතුමා භූතාරාම විහාරය කරවීය කනිට්ඨතිස්ස රජතුමා රාමගෝනක විහාරය කරවීය කනිට්ඨතිස්ස රජතුමා නන්තිස් ආරාමය කරවීය කනිට්ඨතිස්ස රජතුමා අනුලතිස්ස පර්වත විහාරය කරවීය කනිට්ඨතිස්ස රජතුමා නියෙල්තිස්ස ආරාමය කරවීය කනිට්ඨතිස්ස රජතුමා පිලපිටිය ස්තූපය කරවීය කනිට්ඨතිස්ස රජතුමා තම සහෝදරයා වන චූලනාග රජතුමා ඝාතනය කරවීය කුංචනාග රජතුමා කුන්චනාග රාජ්ය කාලයේ සාගතයකට ගොදුරු විය කුංචනාග රජතුමා අනුරාධපුරයේ මහාපාලි දානශාලාව වැඩි දියුණු කිරීම කුංචනාග රජතුමා රුවන්වැලි සෑයේ රන් ආලේපිත ජත්රයක් කරවීය වන සිරිනාග රජතුමා ලෝවාමහාපාය ප්රතිසංස්කරණය කොට මහල් ක් ලෙස තැනීම වන සිරිනාග රජතුමා සිරි මහා බෝධියේ සතර දිසාවල තිබූ පඩිපෙළ ප්රතිසංස්කරණය කරවීය වන සිරිනාග රජතුමා අභයගිරි විහාරයේ ජත්රය කරවීය වෝහාරිකතිස්ස රජතුමා දක්ෂිණ මූල විහාරයේ ජත්රය කරවීය වෝහාරිකතිස්ස රජතුමා මිරිසවැටි විහාරයේ ජත්රය කරවීය වෝහාරිකතිස්ස රජතුමා මහියංගන විහාරයේ ජත්රය කරවීය වෝහාරිකතිස්ස රජතුමා තිස්සමහාරාම විහාරයේ ජත්රය කරවීය වෝහාරිකතිස්ස රජතුමා නාගදීපයේ තිස්ස විහාරයේ ජත්රය කරවීය වෝහාරිකතිස්ස රජතුමා කැළණි විහාරයේ ජත්රය කරවීය වෝහාරිකතිස්ස රජතුමා ගොලුනා සෙනෙවි විහාරයේ පවුර කරවීය වෝහාරිකතිස්ස රජතුමා දකුණු විහාරයේ පවුර කරවීය වෝහාරිකතිස්ස රජතුමා මිරිසවැටි විහාරයේ පවුර කරවීය වෝහාරිකතිස්ස රජතුමා පුත්තභාග විහාරයේ පවුර කරවීය වෝහාරිකතිස්ස රජතුමා ඉසුරුමුණි විහාරයේ පවුර කරවීය වෝහාරිකතිස්ස රජතුමා නාගදීපයේ තිස්ස විහාරයේ පවුර කරවීය වෝහාරිකතිස්ස රජතුමා අනුරාරාම විහාරයේ පොහොයගෙය කරවීය වෝහාරිකතිස්ස රජතුමා ණය සහිත භික්ෂූන් ණයෙන් නිදහස් කර මහා වෙසක් පූජාවක් පැවැත්වීය වෝහාරිකතිස්ස රජතුමා ලක්වැසි සියලු භික්ෂූන්ට තුන් සිවුරු පූජා කළේය වෝහාරිකතිස්ස රජතුමා අභයගිරියේ වයිතුල්ය වාදය ස්ථාපණය විය වෝහාරිකතිස්ස රජතුමා අභයගිරියේ වයිතුල්ය වාදය බිඳ හැර නිර්මල බුදු දහම ස්ථාපිත කරවීය වෝහාරිකතිස්ස රජතුමා ශ්රී මහා බෝධි ගෘහයෙහි ලෝහමය රූප දෙකක් කරවීය වෝහාරිකතිස්ස රජතුමා සතපන් ආරාමය කරවීය වෝහාරිකතිස්ස රජතුමා ශ්රී මහා බෝධිය වටා ගල් පිලිකඩ ඉදිකරවීය අභයනාග රජතුමා ලෝවාමහපායේ මණ්ඩපයක් ඉදිකරවීය අභයනාග රජතුමා භික්ෂු සංඝයා හට දෙලක්ෂයක් සිවුරු දන්දෙන ලදී අභයනාග රජතුමා ශ්රී මහා බෝධි ප්රාකාරය ප්රතිසංස්කරණය කරවීය වන සිරිනාග රජතුමා ශ්රී මහා බෝධි වැලි මළුවේ මණ්ඩපයක් කරවීය වන සිරිනාග රජතුමා රුවන්වැලි සෑයේ ජත්රයේ රන් ආලේප කළේය වන සංඝතිස්ස රජතුමා රුවන්වැලි සෑයේ හතරැස් කොටුවේ කහවනු ලක්ෂය බැගින් වටිනා මැණික් තැන්පත් කරවීය වන සංඝතිස්ස රජතුමා රුවන්වැලි සෑය අකුණු සැර වලින් ආරක්ෂා කිරීමට වජ්රචුම්බක සවිකිරීම වන සංඝතිස්ස රජතුමා අනුරාධපුර නගරයේ දොරටු සතරේ මහජනයාට කැඳ දානය දුන්නේය වන සංඝතිස්ස රජතුමා තම හිස දුගියෙකුට දන් දුනි සිරි සංග බෝධි රජතුමා ථූපාරාමයේ පොහොය ගෙය ප්රතිසංස්කරණය කරවීය ගෝඨාභය රජතුමා මනිසෝමාරාමයේ පොහොය ගෙය ප්රතිසංස්කරණය කරවීය ගෝඨාභය රජතුමා මිරිසවැටියේ පොහොය ගෙය ප්රතිසංස්කරණය කරවීය ගෝඨාභය රජතුමා මේඝවර්ණ විහාරය කරවීය ගෝඨාභය රජතුමා රටපුරා නටඹුන් වූ ආවාස ගෙවල් ප්රතිසංස්කරණය කරවීය ගෝඨාභය රජතුමා සංඝයා වහන්සේ කට චීවර පූජා කරන ලදී ගෝඨාභය රජතුමා අවුරුද්දක් පාසා වෙසක් උත්සවය පවත්වන ලදී ගෝඨාභය රජතුමා මහා විහාරයේ ශිලා මණ්ඩපයක් කරවීය ගෝඨාභය රජතුමා ලෝවාමහාපායේ නව ටැම් කරවීය ගෝඨාභය රජතුමා සිරි මහා බෝධියේ සෙල් පිලිකඩ කරවීය ගෝඨාභය රජතුමා සිරි මහා බෝධියේ උතුරු දොරටුවෙහි තොරණ කරවීය ගෝඨාභය රජතුමා සිරි මහා බෝධියේ සතර කොන වක්ර සහිත ටැම් සිටවීය ගෝඨාභය රජතුමා සිරි මහා බෝධියේ දොරටු තුනෙහි සෙල් පිළිම කරවීය ගෝඨාභය රජතුමා සිරි මහා බෝධියේ දකුණු දොරටුවෙහි සෙල්මුවා පළඟක් කරවීය ගෝඨාභය රජතුමා අත්තනගල්ලේ විහාරය කරවීය ගෝඨාභය රජතුමා අත්තනගල්ලේ පිරිවෙන කරවීය ගෝඨාභය රජතුමා අම්බස්තල ස්තූපයට චේතියඝරයක් කරවීය ගෝඨාභය රජතුමා මහසෙන් කුමරුට පක්ෂ වූවන් ඝාතනය කරන ලදී වන ජෙට්ඨතිස්ස රජතුමා එකල භාවිතා කල මුදල් වලින් කෝටියක් වියදම් කර පස් මහල් වූ ලෝවාමහාපාය සත් මහල් ලෙස තැනවීය වන ජෙට්ඨතිස්ස රජතුමා ලක්ෂයක් වටිනා මිනි රුවනක් පුදා මිනි පහනක් කරවීය වන ජෙට්ඨතිස්ස රජතුමා රුවන්වැලි සෑයට මහාර්ඝ මානික්ය දෙකක් පිදීය වන ජෙට්ඨතිස්ස රජතුමා ශ්රී මහා බෝධීන් වහන්සේ වටා තොරණ තුනක් කරවීය වන ජෙට්ඨතිස්ස රජතුමා පසින පබ්බත විහාරය කරවීය වන ජෙට්ඨතිස්ස රජතුමා කළු මැටි වැව චේතියගිරි විහාරයට පූජා කරන ලදී වන ජෙට්ඨතිස්ස රජතුමා වාර්ෂිකව වෙසක් උත්සවය ඉහලින් සැමරීය වන ජෙට්ඨතිස්ස රජතුමා ථූපාරාමයෙහි තිබූ මහා ගල් පිළිමය පස්චිමතිස්ස පර්වත ආරාමයෙහි නගාලීය වන ජෙට්ඨතිස්ස රජතුමා හෙළුන්ගම වැව කරවීය සොයාගෙන නැත වන ජෙට්ඨතිස්ස රජතුමා දෙමැටා වැව කරවීය සොයාගෙන නැත වන ජෙට්ඨතිස්ස රජතුමා වඩුගමු වැව කරවීය සොයාගෙන නැත වන ජෙට්ඨතිස්ස රජතුමා පිසැත්නා වැව කරවීය සොයාගෙන නැත වන ජෙට්ඨතිස්ස රජතුමා බමුණුගම වැව කරවීය සොයාගෙන නැත වන ජෙට්ඨතිස්ස රජතුමා ජේතවනාරාම විහාරය කරවීය මහසෙන් රජතුමා මින්නේරි විහාරය කරවීය මහසෙන් රජතුමා ගෝකන්න විහාරය කරවීය මහසෙන් රජතුමා රුහුණේ කලන්දක විහාරය කරවීය මහසෙන් රජතුමා රුහුණේ එකාපිල්ල විහාරය කරවීය මහසෙන් රජතුමා මුවගම් විහාරය කරවීය මහසෙන් රජතුමා හගසෙන්ගල විහාරය කරවීය මහසෙන් රජතුමා දාසෙන්ගල විහාරය කරවීය මහසෙන් රජතුමා රූපාරම්ම විහාරය කරවීය මහසෙන් රජතුමා ථෙරවාදී පොත්පත් ගිනි තබන ලදී මහසෙන් රජතුමා මහා විහාරය ඝෝණ නම් අමාත්යවරයා ලවා විනාශ කරවීය මහසෙන් රජතුමා සත් මහල් ප්රාසාදය බිඳ දැමීය මහසෙන් රජතුමා පශ්චිමතිස්ස ආරාමයෙහි තිබූ සෙල් ප්රතිමාව අභයගිරියේ නගාලීය මහසෙන් රජතුමා ඔහු විසින් විනාශ කල මහා විහාරය නැවත ගොඩනගන ලදී මහසෙන් රජතුමා මින්නේරිය වැව කරවීය මහසෙන් රජතුමා මාගම වැව කරවීය මහසෙන් රජතුමා ජල්ලුර වැව කරවීය මහසෙන් රජතුමා බානු වැව කරවීය මහසෙන් රජතුමා මාමිනියා වැව කරවීය මහසෙන් රජතුමා පරක වැව කරවීය මහසෙන් රජතුමා කුම්බලාක වැව කරවීය මහසෙන් රජතුමා රත්මල්කඩ වැව කරවීය මහසෙන් රජතුමා මාගලන් වැව කරවීය මහසෙන් රජතුමා මහාදාරගල්ලක වැව කරවීය මහසෙන් රජතුමා තිස්සවඩ්ඩමාන වැව කරවීය මහසෙන් රජතුමා ධම්මරම්ම වැව කරවීය මහසෙන් රජතුමා කාලපාසාන වැව කරවීය මහසෙන් රජතුමා මහාමුනි වැව කරවීය මහසෙන් රජතුමා කන්ඩක වැව කරවීය මහසෙන් රජතුමා වාහන වැව කරවීය මහසෙන් රජතුමා පබ්බත ඇල කරවීය මහසෙන් රජතුමා ධාන්ය බැංකුවක් ආරම්භ කරන ලදී කිත්සිරිමෙවන් රජතුමා වම් දළදා වහන්සේ ලංකාවට වැඩම කරවන ලදී කිත්සිරිමෙවන් රජතුමා මාලිගාවක් තනවා වම් දළදා වහන්සේ තැන්පත් කරන ලදී කිත්සිරිමෙවන් රජතුමා මිහිඳු පෙරහැර ආරම්භ කරන ලදී කිත්සිරිමෙවන් රජතුමා දඹදිව වන්දනාකරුවන්ට විශ්රාම ශාලාවක් කරවීය කිත්සිරිමෙවන් රජතුමා සුසාන භුමි ඇති කිරීම පණ්ඩුකාභය රජතුමා ගම්සභා ක්රමය ඇතිකිරීම පණ්ඩුකාභය රජතුමා ශත්ථාල්හක මෙහෙණවර ඉදි කරන ලදී දේවානම්පියතිස්ස රජතුමා මහාපාලී දන්හැල ඉදි කරනලදී දේවානම්පියතිස්ස රජතුමා නාගදීපයේ දඹකොළ වෙහෙර ඉදි කරනලදී දේවානම්පියතිස්ස රජතුමා තිස්ස මහාවිහාරය ඉදි කරනලදී දේවානම්පියතිස්ස රජතුමා ප්රාචීනාරාමය ඉදි කරනලදී දේවානම්පියතිස්ස රජතුමා ප්රථම වරට සංඝ බේදය ඇතිවීම වළගම්බා රජතුමා වලස් වැව කරවන ලදී දේවානම්පියතිස්ස රජතුමා තිසා වැව කරවන ලදී දේවානම්පියතිස්ස රජතුමා මෙහෙණි සසුන පිහිටුවීම දේවානම්පියතිස්ස රජතුමා අම්භස්තල දාගැබ නැතහොත් සේල චෛත්යය ගොඩනැගීම මහාදාඨික මහානාග රජතුමා කණ්ටක චේතිය ඉදිකිරිම සූරතිස්ස රජතුමා මහියංගනයේ සිටි ජත්ර නම් සෙනවියා මැරීය දුටුගැමුණු රජතුමා අම්බුටු නගරයේ අම්බුටු සෙනෙවියා මැරීය දුටුගැමුණු රජතුමා කොට්ටවදී දෙමල නායකයින් ක් මැරීය දුටුගැමුණු රජතුමා අතුරඹ දී මහතුන්ඩ සෙනෙවියා මැරීය දුටුගැමුණු රජතුමා දෙනගමදී ගවර නම සෙනෙවියා මැරීය දුටුගැමුණු රජතුමා හාලකොලදී මහා ඉස්සරිය සෙනෙවියා මැරීය දුටුගැමුණු රජතුමා පොල්වත්තහිදී නාලිකා සෙනෙවියා මැරීය දුටුගැමුණු රජතුමා දීඝාභයගල්ලහිදී දීඝාභය සෙනෙවියා මරා දමන ලදී දුටුගැමුණු රජතුමා කසාතොටහිදී වසකිංච සෙනෙවියා මැරීය දුටුගැමුණු රජතුමා වේට නගරයේදී වේට දෙමල නායකයා මරා දමන ලදී දුටුගැමුණු රජතුමා භාණක නගරයේදී එහි නායක භාණක මරාදමන ලදී දුටුගැමුණු රජතුමා වසිට්ට ගමේදී එහි දෙමල නායක වසිට්ට මරාදැමිය දුටුගැමුණු රජතුමා ගාමිණි ගමෙහිදී එහි දෙමල ප්රධානි ගාමිණී මරාදමන ලදී දුටුගැමුණු රජතුමා කුම්බ ග්රාමයේදී කුම්බ සෙනෙවියා මරාදමන ලදී දුටුගැමුණු රජතුමා නන්දික ග්රාමයේදී නන්දික දෙමල සෙනෙවියා මරාදමන ලදී දුටුගැමුණු රජතුමා භානුක ග්රාමයේදී භානුක දෙමලනායකයා මරාදමන ලදී දුටුගැමුණු රජතුමා තඹුන්නාග්රාමයේදී තඹුන්නා දෙමල නායකයා මරාදමන ලදී දුටුගැමුණු රජතුමා ගිරිනිල් නගරයේදී ගිරිනිල් දෙමල සෙනෙවියා මරාදමන ලදී දුටුගැමුණු රජතුමා මානෙල් නගරයේදී මානෙල් දෙමල සෙනෙවියා මරාදමන ලදී දුටුගැමුණු රජතුමා",
        "රුවන්වැලිසෑය හෙවත් රුවන්වැලි දාගැබ දුටුගැමුණු රජතුමා මහමෙව්නාව උද්යානය මුටසීව රජතුමා ථුපාරාමය දාගැබ දේවානම්පියතිස්ස රජතුමා බුද්ධාගම වැලඳගැනීම දේවානම්පියතිස්ස රජතුමා ශ්රී මහා බෝධිය රෝපණය දේවානම්පියතිස්ස රජතුමා එළාර රජු පරාජය කිරීම් දුටුගැමුණු රජතුමා අසේල රජු පරාජය කිරීම එළාර රජතුමා සූරතිස්ස රජු පරාජය කිරීම සේන හා ගුත්තික පංච ද්රවිඩයන්ගේ ආක්රමණය වළගම්බා රජතුමා අභයගිරි විහාරය තැනීම වළගම්බා රජතුමා අභයගිරි ස්ථුපය තැනීම වළගම්බා රජතුමා ත්රිපිටකය ග්රන්ථාරූඪ කිරිම වළගම්බා රජතුමා බැමිණිතියා සාය මහා දුර්භික්ෂය වළගම්බා රජතුමා අනුරාධපුර අගනුවර ගොඩනැගීම පණ්ඩුකාභය රජතුමා ක්රමවත් සුසාන භුමි ඇති කිරීම පණ්ඩුකාභය රජතුමා නගර පාලකයකු පත්කිරීම නගර ගුත්තික පණ්ඩුකාභය රජතුමා අභය වැව බසවක්කුලම නිර්මාණය පණ්ඩුකාභය රජතුමා ග්රාම සීමා නියම කිරීම පණ්ඩුකාභය රජතුමා කසල සෝදකයන් පත් කිරීම පණ්ඩුකාභය රජතුමා සෞඛ්ය පිලිබඳ විධිමත් සැලැස්මක් ඇති කිරී පණ්ඩුකාභය රජතුමා ශ්රී ලංකාවේ ප්රථම මෞර්ය රාජවංශය ආරම්භ ක පණ්ඩුකාභය රජතුමා චේතියගිරි විහාරය ඉදිකිරීම දේවානම්පියතිස්ස රජතුමා මහමෙව්නාවේ මහා විහාරය ඉදිකිරීම දේවානම්පියතිස්ස රජතුමා කට අධික පිරිසක් පැවිදි කිරීම දේවානම්පියතිස්ස රජතුමා සඟමිත් තෙරණියෝ වැඩම කරවීම දේවානම්පියතිස්ස රජතුමා ලංකාවේ මෙහෙණි සස්න ආරම්භ කිරීම දේවානම්පියතිස්ස රජතුමා රුවන්වැලි සෑ බිමේ ගල් ටැඹ පිහිටුවීම දේවානම්පියතිස්ස රජතුමා වෙස්සගිරි විහාරය කරවීම දේවානම්පියතිස්ස රජතුමා උපාසිකා විහාරය කරවීම දේවානම්පියතිස්ස රජතුමා මහාපාලි බත් දන්සල පිහිටුවීම දේවානම්පියතිස්ස රජතුමා දඹකොළ විහාරය කරවීම දේවානම්පියතිස්ස රජතුමා ප්රාචීනාරාම විහාරය කරවීම දේවානම්පියතිස්ස රජතුමා ප්රථම වරට වැදගත් ලෙසට සිදු වූ රාජාභිෂේකය දේවානම්පියතිස්ස රජතුමා මිහිඳු මහරහතන් වහන්සේගේ පරිනිර්වාණය උත්තිය රජතුමා සංඝමිත්තා තෙරණියගේ පරිනිර්වාණය උත්තිය රජතුමා මිහිඳු මහා සෑය ඉදි කිරීම උත්තිය රජතුමා සංඝමිත්තා සෑය ඉදි කිරීම උත්තිය රජතුමා නාගරංජන විහාරය ඉදි කිරීම මහාසිව රජතුමා විහාර ක් ඉදි කිරීම සූරතිස්ස රජතුමා ලෝවාමහාපාය විහාරය කරවීම දුටුගැමුණු රජතුමා මිරිසවැටිය විහාරය කරවීම දුටුගැමුණු රජතුමා තුන්සිංහලයම ඵක්සේසත් කිරීම දුටුගැමුණු රජතුමා පදවිය වැව කරවීම සද්ධාතිස්ස රජතුමා කටුන්නරු වැව කරවීම සද්ධාතිස්ස රජතුමා මාලම වැව කරවීම සද්ධාතිස්ස රජතුමා දුරතිස් වැව කරවීම සද්ධාතිස්ස රජතුමා මුල්ගිරිගල විහාරය කරවීම සද්ධාතිස්ස රජතුමා ගින්නෙන් දැවී ගිය ලෝවාමහාපාය ප්රතිසංස් සද්ධාතිස්ස රජතුමා රුවන්වැලි සෑය නිම කිරීම සද්ධාතිස්ස රජතුමා රුවන්වැලි සෑයේ ඇත් පවුර කරවීම සද්ධාතිස්ස රජතුමා කල්ලක ලෙන් විහාරය කරවීම සද්ධාතිස්ස රජතුමා කුලුම්බලා විහාරය කරවීම සද්ධාතිස්ස රජතුමා පෙතංග වැලි විහාරය කරවීම සද්ධාතිස්ස රජතුමා වෙළඟවැටිය විහාරය කරවීම සද්ධාතිස්ස රජතුමා දුඹුල් වැතිස් විහාරය කරවීම සද්ධාතිස්ස රජතුමා මාතු විහාරය කරවීම සද්ධාතිස්ස රජතුමා කන්දර විහාරය කරවීම තුලත්ථන රජතුමා වැඩිමහල් සහෝදර ලජ්ජිතිස්ස විසින් මරා දමන ලදී තුලත්ථන රජතුමා මහා සෑයට ශෛලමය මල් ආසන තුනක් කරවීම ලංජතිස්ස රජතුමා ථූපාරාම භුමියේ ධාතු මන්දිරයක් කරවීම ලංජතිස්ස රජතුමා ථූපාරාම භුමියේ ශෛලමය දාගැබක් කරවීම ලංජතිස්ස රජතුමා රිටිගල විහාරය කරවීම ලංජතිස්ස රජතුමා අරිට්ඨ විහාරය කරවීම ලංජතිස්ස රජතුමා මිහින්තලේ කණ්ඨක දාගැබ ප්රතිසංස්කරණය කරවීම ලංජතිස්ස රජතුමා තම සහෝදරයා වන තුල්ලත්තන රජු මරා දැමීම ලංජතිස්ස රජතුමා මාමාවරු දෙනෙකු ඝාතනය කිරීම පණ්ඩුකාභය රජතුමා ඇත්කඳ විහාරය කරවීම සූරතිස්ස රජතුමා නැගෙනහිර පව් විහාරය කරවීම සූරතිස්ස රජතුමා කොලම්බාලක විහාරය කරවීම සූරතිස්ස රජතුමා ගිරිනිල් පනාකඩ විහාරය කරවීම සූරතිස්ස රජතුමා ලෝවා මහාපාය වටා ප්රාසාද ක් කරවීම බල්ලාඨනාග රජතුමා රුවන්වැලි සෑය වැලි මලුව වටා ගල් බැම්මක් බැඳීම බල්ලාඨනාග රජතුමා සේන සහ ගුත්තික මරා අසේල රජු රාජ්ය ලබා ගන්නා ලදී අසේල රජතුමා එළාර රජු විසින් අසේල රජු මරා දමන ලදී එළාර රජතුමා කුරුන්ද පාසක විහාරය කරවීම බල්ලාඨනාග රජතුමා බමුණු වංශික තිස්ස කැරැල්ලක් ආරම්භ කරන ලදී වළගම්බා රජතුමා දමිළයන් සෝමා දේවිය අල්ලා ඉන්දියාවට රැගෙන යාම වළගම්බා රජතුමා මන්දවාපි විහාරය කරවීය මහසිළු මහාතිස්ස රජතුමා අබාගල විහාරය කරවීය මහසිළු මහාතිස්ස රජතුමා වගුපවුගල විහාරය කරවීය මහසිළු මහාතිස්ස රජතුමා දිගබාගල විහාරය කරවීය මහසිළු මහාතිස්ස රජතුමා වාලගම විහාරය කරවීය මහසිළු මහාතිස්ස රජතුමා රජුට නවාතැන් නොදුන් විහාර ක් කඩා දැමීය චෞර නාග රජතුමා අනුලා බිසව රජුට වස දී මරා දැමීය චෞර නාග රජතුමා අනුලා බිසව රජුට වස දී මරා දැමීය කුඩා තිස්ස රජතුමා අනුලා බිසව වස දී මරා දැමීය සිව අනුලා බිසව වස දී මරා දැමීය වටුක අනුලා බිසව වස දී මරා දැමීය දාරුභාතික තිස්ස අනුලා බිසව වස දී මරා දැමීය නීලිය චෝර නාග රජු වස දී මරා දැමීය අනුලා රැජින තිස්ස රජුට වස දී මරා දැමීය අනුලා රැජින සිව රජුට වස දී මරා දැමීය අනුලා රැජින වටුක රජුට වස දී මරා දැමීය අනුලා රැජින නීලිය රජුට වස දී මරා දැමීය අනුලා රැජින දාරුබාතික තිස්ස රජුට වස දී මරා දැමීය අනුලා රැජින කුටකන්න තිස්ස රජු විසින් අනුලා බිසව මරා දැමීය කූඨකණ්ණ තිස්ස රජතුමා තෙලගාම විහාරය කරවීය කූඨකණ්ණ තිස්ස රජතුමා වර්ණක නම් වූ මහමොවූ ඇල නිර්මාණය කිරීම කූඨකණ්ණ තිස්ස රජතුමා ඇම්බදුග්ග වැව කරවීය කූඨකණ්ණ තිස්ස රජතුමා භයෝදුප්පල වැව කරවීය කූඨකණ්ණ තිස්ස රජතුමා නගරය වටා සත් රියන් පවුරක් කරවීය කූඨකණ්ණ තිස්ස රජතුමා පවුර වටා දිය අගලක් කරවීය කූඨකණ්ණ තිස්ස රජතුමා පද්මස්වර උද්යානය කරවීය කූඨකණ්ණ තිස්ස රජතුමා රෝමයට දූතයන් යවා මුතු ගෙන්වා රුවන්වැලි සෑය සැරසවීය භාතික අභය රජතුමා රට පුරාම සත්ව ඝාතනය තහනම් කළේය භාතික අභය රජතුමා අධිකරණ කටයුතු සාර්ථකව කරන ලදී භාතික අභය රජතුමා අනුරාධපුරයේ සිට එක යොදුනක් දක්වා සුවදැති මල් පැලෑටි රෝපණය කරවීය භාතික අභය රජතුමා වසරක් පාසා රුවන්වැලි සෑ රදුන්ට හුණු පිරියාම මංගල්ය කරවීම භාතික අභය රජතුමා අටවිස්සක් මහා වෙසක් පූජාව කරවීය භාතික අභය රජතුමා රුවන්වැලි සෑ මළුව විශාල කරවීය මහාදාඨික මහානාග රජතුමා මිහින්තලේ සේල ස්ථූපය කරවීය මහාදාඨික මහානාග රජතුමා අනුරාධපුරයේ සතර දොරටුවෙහි දාන ශාලා ක් කරවීය මහාදාඨික මහානාග රජතුමා ලක්දිව පුරා පහන් පූජා පැවැත්විය මහාදාඨික මහානාග රජතුමා මුහුදෙහි යොදුනක් දුරට පහන් පූජාවක් කරවීය ගිරිහඬ පූජා මහාදාඨික මහානාග රජතුමා සිරකරුවෝ සියලු දෙනා නිදහස් කළේය මහාදාඨික මහානාග රජතුමා මිනිනාපවූ විහාරය කරවීය මහාදාඨික මහානාග රජතුමා කලන්දක විහාරය කරවීය මහාදාඨික මහානාග රජතුමා චූලනාග විහාරය කරවීය මහාදාඨික මහානාග රජතුමා මහා සෑ රදුන්ගේ ජත්රය මත තවත් ජත්රයක් කරවීය අමණ්ඩගාමණී අභය රජතුමා මහා සෑ රදුන්ගේ පිලිකඩ සහ මුදුන් පිලිකඩ කරවීය අමණ්ඩගාමණී අභය රජතුමා ලෝවාමහාපායෙහි ඇතුළු මිදුල් සහ ආලින්දය කරවීය අමණ්ඩගාමණී අභය රජතුමා ථූපාරාම පොහොගෙයහි ඇතුළු මිදුල් සහ ආලින්දය කරවීය අමණ්ඩගාමණී අභය රජතුමා සතුන් මැරීම තහනම් කරවීය අමණ්ඩගාමණී අභය රජතුමා රිදී විහාරය කරවීය අමණ්ඩගාමණී අභය රජතුමා මහානාම මන්දවාපි දකුණු දිග වැව කරවීය අමණ්ඩගාමණී අභය රජතුමා තම සහෝදර අමන්ද ගාමිණි මරා රජවිය කණිරජානු තිස්ස රජතුමා සෑගිරි විහාරයේ නමක් මරා දමන ලදී කණිරජානු තිස්ස රජතුමා දකුණු දිග චූලගල්ල විහාරය කරවීය චූලාභය රජතුමා තිසා වැව කරවීය ඉලනාග රජතුමා දුරතිසා වැව කරවීය ඉලනාග රජතුමා ඉසුරුමුණිය විහාරයට කුඹුරු විශාල ප්රමාණයක් දන් දෙන ලදී ඉලනාග රජතුමා මනිකාර ගමේ වැවක් තනවන ලදී චන්ද්රමුඛසිව රජතුමා තම සොයුරු චන්ද්රමුඛසිව මරා රජ විය යසලාලක තිස්ස රජතුමා සමාන රුව ඇති දොරටුපාලකයෙකු නිසා ජීවිතය අහිමි විය යසලාලක තිස්ස රජතුමා උපලදොනික වැව ප්රතිසංස්කරණය කරවීම සුභ රජතුමා උරුවෙල ගම අසල වල්ලි විහාරය කරවීම සුභ රජතුමා එක්ද්වාරික විහාරය කරවීම සුභ රජතුමා ගන්තෙර නන්දිග්රාමි විහාරය කරවීම සුභ රජතුමා සුභ පිරිවෙන කරවීම සුභ රජතුමා රාජ පිරිවෙන කරවීම සුභ රජතුමා සුහ රජු මරා රජකමට පත්විය වසභ රජතුමා වසර තුනකට වරක් සියළුම සඟුනට සිවුරු පිදීය වසභ රජතුමා ප්රදේශ ක දාන දෙන ලදී වසභ රජතුමා සෑගිරිය ථූපාරාමය මහා සෑය සහ ශ්රී මහා බෝධියේ දහසක් පහන් පූජා පැවැත්විය වසභ රජතුමා සිතුල් පව්ව විහාරයේ දාගැබ් ක් ඉදි කරවීය වසභ රජතුමා මහාවල්ලි ගොනු විහාරය ඉදි කරවීය වසභ රජතුමා මාගම අනුරාධරාම විහාරය ඉදි කරවීය වසභ රජතුමා මූවෙල විහාරය ඉදි කරවීය වසභ රජතුමා කුදුගල විහාරයේ පොහොය ගෙය ඉදි කරවීය වසභ රජතුමා ඉසුරුමුණි විහාරයේ පොහොය ගෙය ඉදි කරවීය වසභ රජතුමා ථූපාරාම විහාරයේ දා ගෙය ඉදි කරවීය වසභ රජතුමා මහාසෑයේ පිරිවෙන් කිහිපයක් ඉදි කරවීය වසභ රජතුමා වල්ලිසේර විහාරය ඉදි කරවීය වසභ රජතුමා මහා විහාරයේ සතරැස් ශාලාව ඉදි කරවීය වසභ රජතුමා මහා විහාරයේ බෝ මළුවේ පිළිම ගෙයක් ඉදි කරවීය වසභ රජතුමා අනුරාධපුර සතර දොරටුවෙහි දිළින්දන්ට දිළිඳු වැටුප් දෙන ලදී වසභ රජතුමා අනුරාධපුර සතර දොරටුවෙහි ගිලන් සංඝයාට ගිලන් වැටුප් දෙන ලදී වසභ රජතුමා මාසෙත් වැව කරවීය වසභ රජතුමා අග්නිවඩ්ඩමානවාපි වැව හබරණ වැව කරවීය වසභ රජතුමා මහානික්කවට්ටි වැව මානන්කුටිය වැව කරවීය වසභ රජතුමා කොහාලවාපි වැව මන්නාරම අසල කොනහාල වැව කරවීය වසභ රජතුමා කාලිවාපි වැව කාලියවදන වැව කරවීය වසභ රජතුමා මහාවාපි වැව නොච්චියාගම වැව කරවීය වසභ රජතුමා වයන්තිවාපි වැව මහාවිලච්චිය වැව කරවීය වසභ රජතුමා කොලම්බ ගාමක වැව කරවීය වසභ රජතුමා අම්බිටි වැව කරවීය වසභ රජතුමා මාගම වැව කරවීය වසභ රජතුමා මාගම වැව කරවීය වසභ රජතුමා අලීසාර ඇල ඇලහැර ඇල කරවීය වසභ රජතුමා තව ඇලවල් කරවීය තවම හඳුනාගෙන නැත වසභ රජතුමා උමන්ජලවාතිකා හෙවත් ජලනල පද්ධති ඇති කළේය වසභ රජතුමා කලිකාලන්ගේ හමුදාව නගරය කොල්ලකා තරුණයක් ක් වහලුන් ලෙස ඉන්දියාවට ගෙනයන ලදී වංකනාසික තිස්ස රජතුමා ගෝන නදිය අසල මහාමංගල විහාරය කරවීය වංකනාසික තිස්ස රජතුමා සොලී දේශයේ සිටි සිංහල වහලුන් බේරාගෙන තවද සොලීන් ක්ද රැගෙන එන ලදී වන ගජබාහු රජතුමා සොලීන් සතුව තිබූ බුදුන් වහන්සේගේ පාත්රා ධාතුව රැගෙන එන ලදී වන ගජබාහු රජතුමා"
      ],
      "fetch_time": 2.327300548553467,
      "error": null
    },
    {
      "url": "http://annedarshani.blogspot.com/p/history.html",
      "title": "history - internet for class room",
      "snippet": "රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්‍රධාන කාර්‍යයක් විය. බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර, ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය.",
      "paragraphs": [
        "ශ්රී දළදා මාළිගාව ශ්රී දළදා මාළිගාව යනු බුදුරජාණන් වහන්සේගේ වම් දන්තධාතූන් වහන්සේ වර්තමානයේ තැන්පත් කර ඇති දළදා මාළිගාවයි වර්තමාන දළදා මාළිගාව ශ්රී ලංකාවේ මහනුවර නගරයේ පිහිටා ඇත උඩරට රාජ්යය සමයේ සිට මෙය පිහිටා තිබුණේ එවකට පැවති රාජකීය මාලිගා සංකීර්ණය තුළමය ශ්රී දළදා මාලිගාව මුල්වරට ගොඩනගනු ලැබුයේ පළමුවන විමලධර්මසූරිය රජතුමා විසිනි එතුමා ඉදිකළ ශ්රී දළදා මාලිගාව පෘතුගීසි ආක්රමණිකයෝ විනාශ කළහ දැනට දක්නට ලැබෙන පැරණි දෙමහල් වැඩසිටින මාලිගාව ඉදිකරනු ලැබ ඇත්තේ ශ්රී වීරපරාක්රම නරේන්ද්රසිංහ රජතුමාය ඉන්පසු රජ පැමිණි නායක්කර් වංශික ද්රවිඩ රජවරු පවා ශ්රී දළදා මාලිගාව වැඩි දියුණු කොට ආරක්ෂා කළහ දළදා මාලිගාව පිහිටා ඇති මහනුවර නගරයම යුනෙස්කෝව විසින් ලෝක උරුමයක් ලෙස නම් කර ඇත මල්වතු හා අස්ගිරි යන දෙපාර්ශවයේ ස්වාමීන් වහන්සේලා දිනපතාම දළදා වහන්සේට පූජා සත්කාර කරති මෙම පූජාව තේවාව දිනකට තුන් වරක් පාන්දර දවල් සහ සවස පවත්වයි බදාදා දිනවල විශේෂ පූජාවක් ලෙස නානුමුර මංගල්යය පවත්වයි මෙහිදී සුවඳ ගැන්වූ ඖශධීය ජලයෙන් සංකේත වශයෙන් දළදා වහන්සේ ස්නානය කරවනු ලබයි මෙසේ ස්නානය කරවීමෙන් ලැබෙන ජලයේ රෝග සුව කරීමේ ආනුභාවයක් ඇති බව විශ්වාස කෙරේ සිගිරිය සිගිරිය පළමුවන කාශ්යප රජු විසින් කි්ර ව වන සියවසේදී ඉදිකරන ලද නිර්මාණයකි දී ලෝක උරුමයක් ලෙස ප්රකාශයට පත්කර ඇති සීගිරිය ක්රි ව වන සියවසේ ලංකාවේ පැවති නගර නිර්මාණ ශිල්පය කලාව ගෘහ නිර්මාණ ශිල්පය ඉදිකිරීම් තාක්ෂණය භූමි දර්ශිත උද්යාන කලාව සහ ජල කළමනාකරණයේ එක්තැන්වීම මැනවින් නිරූපණය කරන ස්ථානයක් ලෙස හදුන්වාදිය හැකිය කොටස් කිහිපයකි සීගිරි පර්වතය හා ඒ මත ඇති මාළිගාව ඇතුළු නුවර හා මාලක ජල උද්යානය උයන් දිය අඟල් හා පවුරු වලින් සමන්විත බටහිර භූමි භාගය දිය අගල හා පවුර සහිත නැගෙනහිර භූමි භාගය ඉහත කී අලංකාර ඉදිකිරීම් වලට අමතරව සිීගිරිය දෙස් විදෙස් සංචාරකයින්ගේ ආකර්ශනීය පුරාවිද්යාත්මක ස්ථානයක් බවට පත්වී ඇත්තේ එහි ඇති ලෝක ප්රකට බිතු සිතුවම් හා කැටපත් පවුර මත ලියා ඇති සිය ගණනක් වු කුරුටු ගී නිසාය පෞඪ ඉතිහාසයකට නෑකම් කියන සිංහල දේශයේ තවත් අභිමානී උත්තුංග පියමන්තලාවක් වන සීගිරිය සිංහල චිත්ර කලාවේ ද වාස්තු විද්යා හා ගෘහ නිර්මාණ ශිල්පයේ ලොව අටෙවනි පුදුමයට පාත්රවන්නට තරම් උතුම් ලද මහා කලාගාරයකි කොළඹ සිට කුරුණෑගල දඹුල්ල මාර්ගයේ ඉනාමලූව හන්දියෙන් හැරී කිලෝ මීටර ක් පමණ ගමන් කළ විට සීගිරි පර්වතය හමුවේ සිංහ රුවක ආකාරයට තැනූ මාළිගාව නිසා එම පර්වතය සීගිරිය නම් වී ඇත අනුරාධපුරයේ රජකළ ධාතුසේන රජුට යකඩ දෝලියකගෙන් ලත් කාශ්යප නම් කුමරුවකු හා අභිෂේක බිසවගෙන් ලත් මුගලන් නම්වූ පුත්තු දෙදෙනෙක් ද දුවණියක ද වූහ රජු තම නැගණියගේ පුත් සෙන්පති මිගාරට ඇය විවාහ කර දුන්නාය මිගාර දිනක් තම දියණියට අමානුෂික ලෙස පහරදුන්නේ යැයි කිපුණු රජු තම සොහොයුරිය වූ මිගාරගේ මව නිරුවත් කොට පුළුස්සා මරා දමන්නට නියෝග කළේය රජුගෙන් පළිගන්නට සිතූ මිගාර කාශ්යප කුමරුන් රාජ්ය ගැනීමට පෙළඹවූවේය මුගලන් සේනා සංවිධානය කොට රාජ්යය ගැනීමේ අපේක්ෂාවෙන් ඉන්දියාවට පලා ගියේය මුගලන් වෙනුවෙන් ධාතුසේන රජු ධනය තැන්පත් කර ඇතැයි කාශ්යපට කියමින් මිගාර ධාතුසේන රජු කෙරෙහි තවදුරටත් බිඳැවීය තැන්පත් ධනය ගැන ප්රශ්න කළ විට ධාතුසේන රජු කාශ්යපට කියා සිටියේ ඒ ධනය කලා වැව බවයි ඉන් කිපුණු කාශ්යප සිය පිය රජු නිරුවත් කොට කලා වැවේ බැම්මට තබා මැටිගස්සවා මරා දැමීමට නියෝග කළේය සිය පියා මැරූ පලිය ගැනීමට සහෝදරයා වූ මුගලන් කුමරු කෙදිනක හෝ යුද්ධයට එතියි බියෙන් කාශ්යප සීගිරිය බළකොටු රාජ්යය ගොඩනැගූ බව ඉතිහාසය සාක්කි දරයි ප්රාකාර දිය අගල් උයන්වතු ජල උද්යාන සේම මහා කලාගාරයක් බඳු රූකම් ද ඇති සීගිරිය ලෝක උරුමයකි මෙහි ඇති අපූර්වත්වය හේතුවෙන්ම මෙය නිල නොලත් අටවැනි ලෝක පුදුමයැයි ද දෙස් විදෙස් හි ප්රචලිතය අද අප දකින සීගිරිය ඉතිහාසයට එක්වන්නේ කි්රස්තු වර්ෂ දී කාශ්යප රජු සිය මාළිගාව සීගිරි පර්වත මස්තකයේ තැනීමෙනි පුරාවිද්යාත්මක සාක්කි අනුව සීගිරියේ ඉතිහාසය ඉන් බොහෝ ඈත අතීතයකට යයි රාවණ රජුගේ මාළිගාවක් සීගිරියේ වීයැයි මතයක් ඇතත් එය සනාථ කිරීමට මෙතෙක් කිසිදු සාක්කියක් හමුවී නැත එහෙත් හමුවූ සෙල්ලිපි රැසකින් පැවැසෙන්නේ දෙවනපෑතිස් යුගයේදී පවා සීගිරිය ආර්ය ජනාවාසයක් වූ බවයි සීගිරිය අවට කැණීම් වලදී අතීතයේ භාවිතා කළ ඉතාමත් දියුණු යකඩ තාක්ෂණයක අවශේෂ හමුවී තිබේ සීගිරි පර්වතය මත ඉදිකැර ඇති රජ මාළිගය සහ අනෙකුත් ගොඩනැගිලි ශී්ර ලංකාවේ පැවැති දියුණු ගෘහ නිර්මාණ ශිල්පයට මනා සාක්කියක් වී ඇත ඉතා සමමිතික ආකාරයෙන් නිමවා ඇති ජල උද්යානයත් එහි ඇති ජලවහන පද්ධතියත් නූතන ඉංජිනේරුවන් මවිත කරවන නිර්මාණයන්ය වැසි වැටුණු විට තවමත් කි්රයාත්මක වන ජලමල් පද්ධතිය සීගිරි යුගයේ සිටි හෙළ නිර්මාණ කරුවන්ගේ විශ්මිත හැකියාව පෙන්වයි සීගිරිය ප්රසිද්ධවූයේ බිතු සිතුවම් හේතුවෙනි එහි ඇත්තේ ශී්ර ලංකාවේ විශිෂ්ටතම චිත්ර නිර්මාණ බව විද්වතුන්ගේ මතයයි රන්වන් හා නිල්වන් වර්ණයෙන් යුතු කාන්තා රූප ක් දැනට එහි දක්නට ඇත ස්වර්ණ වර්ණ කතුන් අන්තඃපුර ස්තී්රන් බවත් නීල වර්ණයෙන් දක්වා ඇත්තේ සේවිකාවන් බවත් ප්රථම පුරාවිද්යා කොමසාරිස් එච් සී පී බෙල් පවසයි මේ කතුන් මල් රැගෙන පිදුරංගල වන්දනා කරන්නට යන බවද ඔහු පවසා ඇත පුරාවිද්යා කොමසාරිස් ඉන් පසු එම තතතුරට ආ සෙනරත් පරණවිතාන මහතා පවසන්නේ විජ්ජු ලතා සහ මේඝ ලතා සංකේතවත් කරමින් මේ කතුන් ඇඳ ඇති බවයි සීගිරියේ තවත් අපූර්වතම නිර්මාණයක් වන කැටපත් පවුරේ සටහන් තබා ඇත්තේ ඉන් පසු සීගිරියට පැමිණි විවිධ තරාතිරමේ පුද්ගලයන් විසිනි අද එහි පැහදිලිව හඳුනාගත හැකි ගී ක් පමණ තිබේ අතීත භාෂාවත් ඔවුන්ගේ රසාඥතාව හා සිංහල භාෂාව ක්රමිකව විකාශය වූ ආකාරයත් මෙම කුරුටු ගී පෙන්වයි ක්රමයෙන් වනාන්තරයෙන් වැසී ගිය සීගිරිය නැවත සොයාගෙන ඇත්තේ දී මේජර් එච් පෝර්බ්ස් විසිනි යළි දී පෝර්බ්ස් සීගිරියේ කැටපත් පවුර සහිත මාර්ගය දක්වාම ගොස් ඇතත් පර්වතය මතට නැගීමට නොහැකිවී ඇත ඇත්තේ ඒ වයි ඇඩම්ස් සහ ජේ බේලි යන තරුණ සිවිල් නිලධරයන් දෙදෙනා දී එහි මුළින්ම නැගුණු බව කියති දී එච් සී පී බෙල් සීගිරිය එළි පෙහෙළි කොට එහි පුරාවිද්යාත්මක ගවේෂණ ආරම්භ කළේය පැරණි ශී්ර ලාංකිකයාගේ අතිශය විශ්මිත නිර්මාණයක් වූ සීගිරිය ලාංකික සංස්කෘතිය හා ඔවුනගේ ප්රතිභාපූර්ණ නිර්මාණ ශක්තිය පිළිබඳ අපූර්වත්වය සමස්ත ලෝකයා හමුවේ තබන අති දැවැන්ත නිර්මාණයකි සීගිරියේ බටහිර දොරටුව කැණීම් සිදුකර තිබේ ඒ අනුව එහි ජල උද්යානයේ බොහෝ කොටස් මතුකරගෙන ඇත නැගෙනහිර දොරටුව දෙසින් කැණීම් සිදුකර නැතත් ඒ ප්රදේශයේ කරන ලද ගවේෂණඅනුව පෙනී ගොස් ඇත්තේ නැගෙනහිර දෙසින් ඇති ගොඩනැගිලි ඉදිකිරීම් අතරමග නවතා දමා තිබූ බවයි මුගලන් යුද්ධයට එනවිට නැගෙනහිර දෙසින් නගර නිර්මාණය කරමින් තිබෙන්නට ඇත එම ප්රදේශය විශාල ප්රමාණයේ රථ වාහන පර්වතය ආසන්නටයට ගත හැකි ආකාරයෙන් නිර්මාණය වී තිබෙන බවද බොහෝ විට ඒවා ඇත් කරත්ත වැනි වාහන විය හැකි බවද පුරාවිද්යාඥයෝ පවසති වසරකට පසු සේනා රැස්කරගත් මුගලන් කාශ්යප සමග යුද්දයට පැමිණියේය යුද්ධයට ගිය කාශ්යප මඩ වළකින් එතෙරවීමට නොහැකිව තම ඇතු ආපසු හැරවූ මොහොතේ රජු පලා යති යි සිතූ සේනාව හිස් ලූ ලූ අත දිවගියෙන් තනිවූ කාශ්යප සියතින් ගෙළ සිඳගෙන මියගිය බව වංශ කථා වල දැක්වේ කාශ්යප මියගිය පසු රාජ්යය ගත් මුගලන් සිය සොහොයුරාට රජකුට සුදුසු අවමංගල උත්සවයක් පවත්වා භෂමාවශේෂ තැන්පත් කර සෑයක් ද කරවා ඇත එම සෑය පිදුරංගල විහාරයට නුදුරින් සොයාගෙන තිබේ මුගලන් සීගිරිය භික්ෂූන් වහන්සේලාට භාරකොට නැවත අනුරාධපුරයට ගොස් ඇත අනුරාධපුර රාජධානිය ලක්දිව ප්රථම සංවිධානාත්මක රාජධානිය වුයේ රජරට රාජධානියයි මෙහි අගනගර සෑම විටම රජරට හෙවත් පිහිටි රට පිහිටා තිබිනි බල ප්රදේශය බොහෝ විට රජරට කලාපයට සීමා වූ අතර වරින්වර සීමාව අඩු වැඩිවීම් සිදුවිය ආරම්භය මුල් යුගයේ උපතිස්සනුවර අගනුවර වූ අතර පණ්ඩුකාභය රජ විසින් අනුරාධගම අගනුවර කරගෙන එය පුරවරයක් දකිවා සංවර්ධනය කරන ලදී රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්රධාන කාර්යයක් විය බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය මෙම ඉදිකිරීම් නිසා අනුරාධපුර යුගය මුළුල්ලේම රජරට ප්රදේශය තුළ විශාල එමෙන්ම සංකීර්ණ වාරිමාර්ග පද්ධතියක් බිහි විය රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්රධාන කාර්යයක් විය බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය මෙම ඉදිකිරීම් නිසා අනුරාධපුර යුගය මුළුල්ලේම රජරට ප්රදේශය තුළ විශාල එමෙන්ම සංකීර්ණ වාරිමාර්ග පද්ධතියක් බිහි විය එකල ඉදි කරන ලද මහා ස්ථුපයන් වූ රුවන්වැලිසෑය ජේතවණාරාමය මෙන්ම ලෝවාමහාපාය වැනි විශාල ගොඩනැගිලි මඟින් අනුරාධපුර යුගයේ තිබූ ගෘහ නිර්මාණ ශිල්පයේ දියුණුව මනාව පෙන්නුම් කරයි පොළොන්නරුව රාජධානිය ශ්රී ලංකාවේ පැරණි අගනුවර ක් වන ඵෙතිහාසික පොළොන්නරුව චෝල ආක්රමණිකයන් විසින් මුලින්ම අගනුවර කරගන්නා ලදී දී පමණ චෝල ආක්රමණිකයන් පලවා හැරීමෙන් පසු වන විජයබාහු රජ විසින් තම අගනුවර වශයෙන් තෝරා ගන්නා ලදී මෙම කෙටි කාලීන චෝල යටත් විජිත සමයේදී පොළොන්නරු ප්රදේශය ජනනාතමංගලම් ලෙස හැදින්වූ බව සඳහන් වේ පළමු විජයබාහූ රජුගෙන් පසු රජකමට පත්වන මහා පරාක්රමබාහු රජු පොළොන්නරු යුගයෙහි හමුවන සමෘද්ධිමත්ම රාජ්ය පාලකයා වශයෙන් සැලකේ පැරකුම් රජ සමය පොළොන්නරුව රාජධානියෙහි ස්වර්ණමය යුගය ලෙස හැදින්වෙන අතර එම කාලවකවානුව තුල ආර්ථික හා කෘෂිකාර්මික සමෘද්ධියක් රට තුල ඇති කිරීමට මහා පරාක්රමබාහු රජු සමත් විය අහසින් වැටෙන එකඳු දිය බිඳක් හෝ ප්රයෝජනයට නොගෙන මුහුදට නොයෙවිය යුතුය යන අධිෂ්ඨානයෙන් කටයුතු කල මහා පරාක්රමබාහු රජු රටේ වාරිමාර්ග පද්ධතියේ ඉමහත් දියුණුවක් ඇතිකරමින් රජරට ප්රදේශයේ සශ්රීකත්වය සඳහා අවශ්ය කටයුතු සැලසීය පැරකුම් රජු විසින් ඉදිකල සුවිසල් පරාක්රම සමුද්රය වාරිමාර්ග පද්ධතියේ දියුණුව උදෙසා ඔහු කල සේවය මැනවින් නිරූපණය කරන්නකි මෙම යුගයේදී රට සාමකාමි හා ස්වයංපෝෂිත බවින් යුක්ත වූ අතර සහල් පවා මෙරටින් පිටරට යැවූ බව පොතපතෙහි සඳහන් වේ පැරකුම් රජුගෙන් පසුව පොළොන්නරුව රාජධානියෙහි රජකමට පත්වන නිශ්ශංක මල්ල රජ රාජ්ය පාලනයෙහිලා යම් සාර්ථකත්වයක් අත්කර ගන්නා නමුදු අනෙකුත් පාලකයන් හට එතරම් යහපත් රාජ්ය පාලනයක් දියත් කිරීමට නොහැකි වේ මේ සදහා බලපාන ප්රධානතම කරුණ වන්නේ සිහසුන අත්පත් කර ගැනීමට එකිනෙකා අතර ඇතිවන ආරවුල්ය මෙවන් තත්වයක් යටතේ දී පමණ කාලිංග මාඝ ආක්රමණය සිදුවන අතර පොළොන්නරුව රාජධානිය මුලුමනින්ම බිඳ වැටිමට මෙම ආක්රමණය හේතු වේ ඉන් අනතුරුව ලංකාවේ රාජධානිය බවට පත්වන්නේ දඹදෙණිය රාජධානිය යි පොළොන්නරුවේ නැරැඹිය හැකි ස්ථා න ගල් විහාරය පොත්ගුල් වෙහෙර පොළොන්නරුව වටදාගෙය රැස්වීම් ශාලාව සත්මහල් ප්රාසාදය රන්කොත් වෙහෙර ගල් විහාරය හැටදාගේ පැරකුම් පිළිමය විජයන්ත ප්රාසාදය",
        "ශ්රී දළදා මාළිගාව යනු බුදුරජාණන් වහන්සේගේ වම් දන්තධාතූන් වහන්සේ වර්තමානයේ තැන්පත් කර ඇති දළදා මාළිගාවයි වර්තමාන දළදා මාළිගාව ශ්රී ලංකාවේ මහනුවර නගරයේ පිහිටා ඇත උඩරට රාජ්යය සමයේ සිට මෙය පිහිටා තිබුණේ එවකට පැවති රාජකීය මාලිගා සංකීර්ණය තුළමය ශ්රී දළදා මාලිගාව මුල්වරට ගොඩනගනු ලැබුයේ පළමුවන විමලධර්මසූරිය රජතුමා විසිනි එතුමා ඉදිකළ ශ්රී දළදා මාලිගාව පෘතුගීසි ආක්රමණිකයෝ විනාශ කළහ දැනට දක්නට ලැබෙන පැරණි දෙමහල් වැඩසිටින මාලිගාව ඉදිකරනු ලැබ ඇත්තේ ශ්රී වීරපරාක්රම නරේන්ද්රසිංහ රජතුමාය ඉන්පසු රජ පැමිණි නායක්කර් වංශික ද්රවිඩ රජවරු පවා ශ්රී දළදා මාලිගාව වැඩි දියුණු කොට ආරක්ෂා කළහ දළදා මාලිගාව පිහිටා ඇති මහනුවර නගරයම යුනෙස්කෝව විසින් ලෝක උරුමයක් ලෙස නම් කර ඇත",
        "මල්වතු හා අස්ගිරි යන දෙපාර්ශවයේ ස්වාමීන් වහන්සේලා දිනපතාම දළදා වහන්සේට පූජා සත්කාර කරති මෙම පූජාව තේවාව දිනකට තුන් වරක් පාන්දර දවල් සහ සවස පවත්වයි බදාදා දිනවල විශේෂ පූජාවක් ලෙස නානුමුර මංගල්යය පවත්වයි මෙහිදී සුවඳ ගැන්වූ ඖශධීය ජලයෙන් සංකේත වශයෙන් දළදා වහන්සේ ස්නානය කරවනු ලබයි මෙසේ ස්නානය කරවීමෙන් ලැබෙන ජලයේ රෝග සුව කරීමේ ආනුභාවයක් ඇති බව විශ්වාස කෙරේ",
        "සිගිරිය පළමුවන කාශ්යප රජු විසින් කි්ර ව වන සියවසේදී ඉදිකරන ලද නිර්මාණයකි දී ලෝක උරුමයක් ලෙස ප්රකාශයට පත්කර ඇති සීගිරිය ක්රි ව වන සියවසේ ලංකාවේ පැවති නගර නිර්මාණ ශිල්පය කලාව ගෘහ නිර්මාණ ශිල්පය ඉදිකිරීම් තාක්ෂණය භූමි දර්ශිත උද්යාන කලාව සහ ජල කළමනාකරණයේ එක්තැන්වීම මැනවින් නිරූපණය කරන ස්ථානයක් ලෙස හදුන්වාදිය හැකිය",
        "ජල උද්යානය උයන් දිය අඟල් හා පවුරු වලින් සමන්විත බටහිර භූමි භාගය",
        "ඉහත කී අලංකාර ඉදිකිරීම් වලට අමතරව සිීගිරිය දෙස් විදෙස් සංචාරකයින්ගේ ආකර්ශනීය පුරාවිද්යාත්මක ස්ථානයක් බවට පත්වී ඇත්තේ එහි ඇති ලෝක ප්රකට බිතු සිතුවම් හා කැටපත් පවුර මත ලියා ඇති සිය ගණනක් වු කුරුටු ගී නිසාය",
        "පෞඪ ඉතිහාසයකට නෑකම් කියන සිංහල දේශයේ තවත් අභිමානී උත්තුංග පියමන්තලාවක් වන සීගිරිය සිංහල චිත්ර කලාවේ ද වාස්තු විද්යා හා ගෘහ නිර්මාණ ශිල්පයේ ලොව අටෙවනි පුදුමයට පාත්රවන්නට තරම් උතුම් ලද මහා කලාගාරයකි",
        "කොළඹ සිට කුරුණෑගල දඹුල්ල මාර්ගයේ ඉනාමලූව හන්දියෙන් හැරී කිලෝ මීටර ක් පමණ ගමන් කළ විට සීගිරි පර්වතය හමුවේ සිංහ රුවක ආකාරයට තැනූ මාළිගාව නිසා එම පර්වතය සීගිරිය නම් වී ඇත",
        "අනුරාධපුරයේ රජකළ ධාතුසේන රජුට යකඩ දෝලියකගෙන් ලත් කාශ්යප නම් කුමරුවකු හා අභිෂේක බිසවගෙන් ලත් මුගලන් නම්වූ පුත්තු දෙදෙනෙක් ද දුවණියක ද වූහ රජු තම නැගණියගේ පුත් සෙන්පති මිගාරට ඇය විවාහ කර දුන්නාය මිගාර දිනක් තම දියණියට අමානුෂික ලෙස පහරදුන්නේ යැයි කිපුණු රජු තම සොහොයුරිය වූ මිගාරගේ මව නිරුවත් කොට පුළුස්සා මරා දමන්නට නියෝග කළේය රජුගෙන් පළිගන්නට සිතූ මිගාර කාශ්යප කුමරුන් රාජ්ය ගැනීමට පෙළඹවූවේය මුගලන් සේනා සංවිධානය කොට රාජ්යය ගැනීමේ අපේක්ෂාවෙන් ඉන්දියාවට පලා ගියේය",
        "මුගලන් වෙනුවෙන් ධාතුසේන රජු ධනය තැන්පත් කර ඇතැයි කාශ්යපට කියමින් මිගාර ධාතුසේන රජු කෙරෙහි තවදුරටත් බිඳැවීය තැන්පත් ධනය ගැන ප්රශ්න කළ විට ධාතුසේන රජු කාශ්යපට කියා සිටියේ ඒ ධනය කලා වැව බවයි ඉන් කිපුණු කාශ්යප සිය පිය රජු නිරුවත් කොට කලා වැවේ බැම්මට තබා මැටිගස්සවා මරා දැමීමට නියෝග කළේය",
        "සිය පියා මැරූ පලිය ගැනීමට සහෝදරයා වූ මුගලන් කුමරු කෙදිනක හෝ යුද්ධයට එතියි බියෙන් කාශ්යප සීගිරිය බළකොටු රාජ්යය ගොඩනැගූ බව ඉතිහාසය සාක්කි දරයි",
        "ප්රාකාර දිය අගල් උයන්වතු ජල උද්යාන සේම මහා කලාගාරයක් බඳු රූකම් ද ඇති සීගිරිය ලෝක උරුමයකි මෙහි ඇති අපූර්වත්වය හේතුවෙන්ම මෙය නිල නොලත් අටවැනි ලෝක පුදුමයැයි ද දෙස් විදෙස් හි ප්රචලිතය",
        "අද අප දකින සීගිරිය ඉතිහාසයට එක්වන්නේ කි්රස්තු වර්ෂ දී කාශ්යප රජු සිය මාළිගාව සීගිරි පර්වත මස්තකයේ තැනීමෙනි පුරාවිද්යාත්මක සාක්කි අනුව සීගිරියේ ඉතිහාසය ඉන් බොහෝ ඈත අතීතයකට යයි රාවණ රජුගේ මාළිගාවක් සීගිරියේ වීයැයි මතයක් ඇතත් එය සනාථ කිරීමට මෙතෙක් කිසිදු සාක්කියක් හමුවී නැත එහෙත් හමුවූ සෙල්ලිපි රැසකින් පැවැසෙන්නේ දෙවනපෑතිස් යුගයේදී පවා සීගිරිය ආර්ය ජනාවාසයක් වූ බවයි සීගිරිය අවට කැණීම් වලදී අතීතයේ භාවිතා කළ ඉතාමත් දියුණු යකඩ තාක්ෂණයක අවශේෂ හමුවී තිබේ",
        "සීගිරි පර්වතය මත ඉදිකැර ඇති රජ මාළිගය සහ අනෙකුත් ගොඩනැගිලි ශී්ර ලංකාවේ පැවැති දියුණු ගෘහ නිර්මාණ ශිල්පයට මනා සාක්කියක් වී ඇත ඉතා සමමිතික ආකාරයෙන් නිමවා ඇති ජල උද්යානයත් එහි ඇති ජලවහන පද්ධතියත් නූතන ඉංජිනේරුවන් මවිත කරවන නිර්මාණයන්ය වැසි වැටුණු විට තවමත් කි්රයාත්මක වන ජලමල් පද්ධතිය සීගිරි යුගයේ සිටි හෙළ නිර්මාණ කරුවන්ගේ විශ්මිත හැකියාව පෙන්වයි",
        "සීගිරිය ප්රසිද්ධවූයේ බිතු සිතුවම් හේතුවෙනි එහි ඇත්තේ ශී්ර ලංකාවේ විශිෂ්ටතම චිත්ර නිර්මාණ බව විද්වතුන්ගේ මතයයි රන්වන් හා නිල්වන් වර්ණයෙන් යුතු කාන්තා රූප ක් දැනට එහි දක්නට ඇත ස්වර්ණ වර්ණ කතුන් අන්තඃපුර ස්තී්රන් බවත් නීල වර්ණයෙන් දක්වා ඇත්තේ සේවිකාවන් බවත් ප්රථම පුරාවිද්යා කොමසාරිස් එච් සී පී බෙල් පවසයි මේ කතුන් මල් රැගෙන පිදුරංගල වන්දනා කරන්නට යන බවද ඔහු පවසා ඇත",
        "පුරාවිද්යා කොමසාරිස් ඉන් පසු එම තතතුරට ආ සෙනරත් පරණවිතාන මහතා පවසන්නේ විජ්ජු ලතා සහ මේඝ ලතා සංකේතවත් කරමින් මේ කතුන් ඇඳ ඇති බවයි",
        "සීගිරියේ තවත් අපූර්වතම නිර්මාණයක් වන කැටපත් පවුරේ සටහන් තබා ඇත්තේ ඉන් පසු සීගිරියට පැමිණි විවිධ තරාතිරමේ පුද්ගලයන් විසිනි අද එහි පැහදිලිව හඳුනාගත හැකි ගී ක් පමණ තිබේ අතීත භාෂාවත් ඔවුන්ගේ රසාඥතාව හා සිංහල භාෂාව ක්රමිකව විකාශය වූ ආකාරයත් මෙම කුරුටු ගී පෙන්වයි",
        "ක්රමයෙන් වනාන්තරයෙන් වැසී ගිය සීගිරිය නැවත සොයාගෙන ඇත්තේ දී මේජර් එච් පෝර්බ්ස් විසිනි යළි දී පෝර්බ්ස් සීගිරියේ කැටපත් පවුර සහිත මාර්ගය දක්වාම ගොස් ඇතත් පර්වතය මතට නැගීමට නොහැකිවී ඇත ඇත්තේ ඒ වයි ඇඩම්ස් සහ ජේ බේලි යන තරුණ සිවිල් නිලධරයන් දෙදෙනා දී එහි මුළින්ම නැගුණු බව කියති දී එච් සී පී බෙල් සීගිරිය එළි පෙහෙළි කොට එහි පුරාවිද්යාත්මක ගවේෂණ ආරම්භ කළේය",
        "පැරණි ශී්ර ලාංකිකයාගේ අතිශය විශ්මිත නිර්මාණයක් වූ සීගිරිය ලාංකික සංස්කෘතිය හා ඔවුනගේ ප්රතිභාපූර්ණ නිර්මාණ ශක්තිය පිළිබඳ අපූර්වත්වය සමස්ත ලෝකයා හමුවේ තබන අති දැවැන්ත නිර්මාණයකි",
        "සීගිරියේ බටහිර දොරටුව කැණීම් සිදුකර තිබේ ඒ අනුව එහි ජල උද්යානයේ බොහෝ කොටස් මතුකරගෙන ඇත නැගෙනහිර දොරටුව දෙසින් කැණීම් සිදුකර නැතත් ඒ ප්රදේශයේ කරන ලද ගවේෂණඅනුව පෙනී ගොස් ඇත්තේ නැගෙනහිර දෙසින් ඇති ගොඩනැගිලි ඉදිකිරීම් අතරමග නවතා දමා තිබූ බවයි මුගලන් යුද්ධයට එනවිට නැගෙනහිර දෙසින් නගර නිර්මාණය කරමින් තිබෙන්නට ඇත එම ප්රදේශය විශාල ප්රමාණයේ රථ වාහන පර්වතය ආසන්නටයට ගත හැකි ආකාරයෙන් නිර්මාණය වී තිබෙන බවද බොහෝ විට ඒවා ඇත් කරත්ත වැනි වාහන විය හැකි බවද පුරාවිද්යාඥයෝ පවසති"
      ],
      "fetch_time": 1.811943531036377,
      "error": null
    },
    {
      "url": "http://anurapuragrama.blogspot.com/2014/10/blog-post_22.html",
      "title": "අනුරාධපුර නමී වු පුජනීය ... - වැව් බැදී රටේ තතු",
      "snippet": "Oct 22, 2014 ... රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්‍රධාන කාර්‍යයක් විය. බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර, ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ ...",
      "paragraphs": [
        "අනුරාධපුර නමී වු පුජනීය නගරයේ ඉතිහාසගත වගතුග ශ්රී ලංකාවෙි ප්රථම රාජධානිය වශයෙන් වසර සියයකටත් අධික කාලයක් පැවති අනුරාධපුර රාජධානිය වාස්තු විද්යාත්මක වශයෙන් ඉතාමත් වැදගත් ස්ථානයකට හිමිකමි දැරිය කෙසේ වෙතත් බොහෝ දෙනෙකු වටහා නොගත් සත්ය නමි පුරාතන යුගයේ දි එකිනෙකට වෙනස් වු නගර දෙකක් පැවතිය බවය එනමි අනුරාධපුරය නමි වු දේශපාලන අගනුවර සහ අනුරාධපුරය නමි වඅ පුජනිය නගරය යි අනුරාධපුරය නමි වු පුජනිය නගරය හා සමිබන්දව සත්ය වර්තාවන් ඉදිරිපත් කිරිමෙි දී ශත වර්ෂ විසි දෙකක් පුරා බෞද්ධ ලෝකය විසින් පුජනීයත්වයෙන් සලකන ලද නගරයක් ලෙස දැක්විමට පිළිවණ රජරට රාජධානිය වත්මන් ශ්රි ලංකාව පිහිටි භූමියේ ප්රථම සංවිධානාත්මක නවීන රාජධානිය වුයේ රජරට රාජධානියයි අනුරාධපුර රාජධානියේ ආරම්හක පාලකයා වූ පණ්ඩුකාහය රජු විසින් අනුරාධපුර නගරය සංවර්ධනය කරන ලදී රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්රධාන කාර්යයක් විය බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය මෙම ඉදිකිරීම් නිසා අනුරාධපුර යුගය මුළුල්ලේම රජරට ප්රදේශය තුළ විශාල එමෙන්ම සංකීර්ණ වාරිමාර්ග පද්ධතියක් බිහි විය රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්රධාන කාර්යයක් විය බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය මෙම ඉදිකිරීම් නිසා අනුරාධපුර යුගය මුළුල්ලේම රජරට ප්රදේශය තුළ විශාල එමෙන්ම සංකීර්ණ වාරිමාර්ග පද්ධතියක් බිහි විය එකල ඉදි කරන ලද මහා ස්ථුපයන් වූ රුවන්වැලිසෑය ජේතවණාරාමය මෙන්ම ලෝවාමහාපාය වැනි විශාල ගොඩනැගිලි මඟින් අනුරාධපුර යුගයේ තිබූ ගෘහ නිර්මාණ ශිල්පයේ දියුණුව මනාව පෙන්නුම් කරයි උපතිස්සනුවර අනුරාධපුර නගරය ඓතිහාසික මූලාශ්රයන්හි සඳහන් වන පරිදි අනුරාධපුර නගරය ආරම්භ වී ඇත්තේ ක්රි පූ සියවෙසහි වුවත් පුරාවිද්යාත්මක තොරතුරු අනුව එහි ඉතිහාසය ක්රි පූ වැනි සියවස තරම් ඈතට දිව යයි කරන ලද පුරා විද්යා කැණීම් වලදී වඩා පූර්ව කාලයන්හි විසූ ජනයා සම්බන්ධ සාක්ෂි ලැබී ඇතත් ක්රි පූ සියවසට එපිට කාලය පිළිබද තොරතුරු අත්ෙත් මද වශෙයනි අනුරාධපුරෙය් වැඩිදුර සිදු කරන ලද කැණීම් වලදී මෙම පුරවරෙය් පැවති ප්රාග් ඓතිහාසික ජනාවාසයන් පිළිබද තොරතුරු ලැබී ඇත ක්රි පූ දක්වා විහිදුණ ප්රාග් ඓතිහාසික ලෝහ යුගෙය්දී ලෝහ තාක්ෂණය කුඹල් කර්මාන්තය අහ්වයන් භාවිතය ගවයන් ඇති කිරීම සහ වී වගාවද පැවතුණ බව පෙනී යයි ක්රි පූ අතර කාලයේදී අනුරාධපුරයේ ජනාවාසය හෙක්ටයාර් ඉක්මවා වර්ධනය විය නගරය ඊසාන දිගින් සහ වයඹ දිගින් පිහිටි ප්රධාන වරායයන් අතර උපායමාර්ගිකව වැදගත් වන පරිදි පිහිටියේය වගා කළ හැකි සරු බිම් එය වටෙකාට පිහිටා තිබුණි ආක්රමණිකයන්ගෙන් නගරය ආරක්ෂා කළ ස්වභාවික පවුරක් වූ ඝන වනාන්තරය නගරය හාත්පස අවුරා විය ක්රි පූ සියවසෙහිදී පණ්ඩුකාභය රජතුමන් විසින් අනුරාධපුරය අගනගරය බවට පත් කරන ලද බවත් මනා සංවිධිත සැලසුමක් අනුව නගරය සහ එහි උප නගරයන්ද පිහිටුවන ලද බවත් කියැවේ අභය වාපි හෙවත් අභය වැවද එතුමන් විසින් කරවන ලදී කාලවේල සහ චිත්තරාජ නමැති යක්ෂයන් උදෙසා දෙවොල්ද කරවනු ලැබීය චේතියා නමැති යක්ෂණිය උදෙසා වෙළඹකගේ ස්වරූපයෙන් වූ පිළිරුවක් රාජ මාළිග පරිශ්රයේම ඉදි කරවන ලද අතර මේ සියළු යක්ෂ දේවතාවන් උදෙසා වාර්ෂිකව පුද පූජා පැවැත්වීමද සිදු විය නගරයේ සුසාන භූමිය වදක භූමිය පශ්චිම රාජිණියගේ දෙවොල වෙස්සවණ උදෙසා වූ නුග රුක ව්යාධදේව උදෙසා වූ තල් රුක යෝනයන් සඳහා වාස භූමිය ආත්ම පූජා මන්දිරය ආදිය පිහිටැවිය යුතු තැන්ද මෙතුමන් විසින් නියම කරන ලදී වහලුන් නොහොත් චණ්ඩාලයන් විසින් කළ යුතු කාර්යයන් නියම කෙරුණු අතර ඔවුන් උදෙසා ග්රාමයක් වෙන් කරන ලදී නිඝණ්ටයන් තැන තැන සරන තවුසන් ආජීවකයන් සහ බ්රාහ්මණයන් උදෙසා වාසස්ථාන ගොඩ නඟන ලදී ග්රාම සීමාද නීර්ණය කරනු ලැබීය අනුරාධපුරය අග නගරය බවට පත් කරමින් ක්රි පූ සියවස තරම් ඈත යුගයකදී පණ්ඩුකාභය රජතුමන් විසින් බිහි කරනු ලැබූ සම්ප්රදාය ඉතා වැදගත් වේ නගරයට සහ පූජනීය ස්ථානයන්ට කරනු ලැබූ සනීපාරක්ෂක සහ පරිපාලනමය සම්පාදනයන් විසින් පෙන්නුම් කෙරෙනුයේ කාලාන්තරයක් තිසිසේ නගරය කිසියම් මධ්යගත සැලැස්මකට අනුව සංවර්ධනය කෙරුණු බවය පණ්ඩුකාභය රජතුමන්ගේ ඇවෑමෙන් එතුමන්ගේ පුත් මුටසීව රාජපදප්රාප්ත විය හැට වසරක් වූ එතුමන්ගේ රාජ්ය පාලන කාලය තුළ අනුරාධපුර නගරය තවදුරටත් අගනුවර වශයෙන් පවත්වා ගත් අතර බුදු සමය දිවයිනට හඳුන්වා දෙනු ලැබූ මුල් අවදියේදී වැදගත් කාර්යභාරයක් ඉටු කරනු ලැබූ මහාමේඝවන උද්යානය හෙවත් මහමෙවුනා උයන පිහිටුවාලීමද එසමයෙහි සිදුවිය බුදු රජාණන් වහන්සේගේ පිරිනිවන් පෑමෙන් වසර කට පසු ශ්රී ලංකාවට බුදු සමය හඳුන්වාදෙන ලද්දේ මුටසීව රජතුමන්ගේ ඇවැමෙන් රාජ්යත්වයට පත් එතුමන් පුත් දේවානම්පියතිස්ස රාජ්ය සමයෙහිදීය ඉන්දියාවෙහි වුසූ අශෝක අධිරාජයා දේවානම්පියතිස්ස රජතුමන්ගේ සමකාලීනයෙක් විය මෙම කාලය ක්රි පූ අතර කාලයයි ලංකාවෙහි රාජ්යත්වයෙහි ආරම්භය සහ ආසියාවෙහි විශිෂ්ඨතම ආගමක් වූ බුද්ධ ධර්මය මත පදනම් වූ ශිෂ්ඨාචාරයක ආරම්භයද සනිටුහන් කෙරෙන්නේ මෙසමයෙහිය බුද්ධාගමේ ආගමනය ශ්රි මහ බෝධි පරිශ්රයෙහි වැඩ වසන ශාඛා බෝධීන් වහන්සේ නමක් දේවානම්පියතිස්ස රාජ්ය කාලයේදී බුදු දහම හඳුවාදිමත් සමඟ ලංකාවේ සමාජීය හා සංස්කෘතික වශයෙන් වෙනස්වීම් සිදුවිය එම වෙනස්වීම් තවදුරටත් වර්ධනය වූයේ බුදුන් වහන්සේගේ දන්ත ධාතුව ලංකාවට වැඩම කරවීමත් සමඟය මූලික වශයෙන් අනුරාධපුර යුගයේ සංස්කෘතිය පදනම් වූයේ බුදුදහම මතය එසේම එම රාජධානියේ නීතිය සහ පාලනය සඳහාද බුදුදහම මඟින් ඉමහත් බලපෑමක් එල්ල විය ක්රි පූ වැනි සියවසෙහි ශ්රි මහ බෝධිය ශ්රි ලංකාවට ගෙන එන ලද්දේ අශෝක අධිරාජයාගේ දියණිය වන සංඝමිත්තා මෙහෙණිය විසිනි ඇය ශ්රි ලංකා භික්ෂූණී ශාසනය පිහිටුවීමේ ලා පුරෝගාමී වූවාය ක්රි පූ දේවානම්පියතිස්ස රජතුමා විසින් අනුරාධපුර මහ මෙව්නා උයනෙහි මෙම ජය සිරි මහ බෝධිය සිටුවන ලදී බුදු දහමේ හඳුන්වා දීමත් සමඟම මෙම නුවර විසල් කැපීපෙනීමක් ලැබුවාක් මෙන්ම මහා ඉඳිකිරීම් යුගයක් ද ඇරඹුනි මහා වංශය පවසන්නේ කුටකන්න තිස්ස රජු විසින් රියන් හතක් උස තාප්පයක් ජල අගලක් ඉදිරියෙන් පවතින පරිදි පලමු තාප්පය ඉදිකළ බවයි පසුව වසභ රජු විසින් මෙය රියන් සිට රියන් දක්වා උස්කොට තවදුරටත් බලවත් කරන ලදි එසේම රජු විසින් ශක්තිමත් දොරටු නිවස්න වාසල් කඩ ඉදි කර ඇති අතර ඒවායෙහි නටබුන් අදද දැකිය හැක මහා වංශය තව දුරටත් පවසන්නේ ඉදිකිරීම් හිදී නිමිති කියන්නන් සහ වාස්තු විදුවන් ගේ උපදෙස් ලැබූ බවය පූජනීය දන්ත ධාතුවේ සම්ප්රාප්තිය කිත්සිරිමෙවන් රජ සමයේදී හේමමාලා කුමරිය සහ දන්ත කුමරු විසින් බුදුන් වහන්සේගේ දන්ත ධාතුව ලංකාවට වැඩම කරවන ලදී එම රජු විසින් දන්ත ධාතුව පෙරහැරකින් වඩම්මවා මන්දිරයක තැන්පත් කරන ලදී මෙම පෙරහැර වාර්ශිකව පවත්වන ලෙස රජු අණ කල අතර අදටත් එය චාරිත්රයක් ලෙස රටෙහි පවතී බුදුන් වහන්සේගේ දන්ත ධාතුව ඉතා ඉක්මනින්ම රටෙහි පූජනීය වස්තුවක් මෙන්ම රජ්ය භාවය තහවුරු කරන සංකේතයක් බවට පත් විය දන්ත ධාතුව ළඟ තබා ගන්නා පුද්ගලයා රටෙහි නියම පාලකයා විය එමනිසා බොහෝ විට එය රජ මාළිගාවෙහිම නිදන් කොට තබන ලදී වැසි ජල කලමණාකරන තාක්ෂණය රජරට රාජධානියේ ප්රධානතම ජයග්රහණය වූයේ වැසි ජලය මනාව කලමණාකරන කලහැකි වාරිමාර්ග බිහිවීමයි ඒ හේතුවෙන් වියළි කලාපයේ කෘෂිකාර්මික අවශ්යතාවන් සඳහා ජලය සැපයීම සිදු විය මෙම වාරිමාර්ග ඉදිකිරීම් මඟින් එම යුගයේ මිනිසුන් තුළ තිබූ උසස් තාක්ෂණික හා ඉංජිනේරු හැකියාවන් මනාව පිළිඹිබු කරයි සමකාලීන රාජධානි දේවානම්පිය තිස්ස රජ ගේ සොහොයුරු මහානාග කුමරු විසින් රජරට රාජධානියෙන් ස්වාධීන රුහුණු රාජධානිය පිහිටුවාගන්නා ලදී රජරට රාජධානිය ආක්රමණියන් අතට පත් බෝහෝ අවස්ථාවලදී රුහුණු රාජධානිය බලය රැකගැනීමට ස්වදේශික සිංහලයන් සමත්විය ආක්රමණයන් රජරට රාජධානියට අඛණ්ඩව පැවතුණු තර්ජනයක් වූයේ දකුණු ඉන්දීය ආක්රමණයන්ය එලෙස සිදු වූ ආක්රමණයන්ගෙන් සතුරන් පරදවා රජධානියේ පාලනය නැවත ලබාගත් දුටුගමුණු වළගම්භා ධාතුසේන වන විජයබාහු ලීලාවතී වැනි පාලකයන් කාගේත් අවධානයට ලක්විය අනෙකුත් පාලකයන් මතකයේ රැඳුනේ ඔවුන් විසින් සිදු කරන ලද හමුදා ජයග්රහණ නිසාය දකුණු ඉන්දියාවට එරෙහිව ආක්රමණයන් දියත් කළ පළවන ගජභාහු පන්ධ්යන් දේවියට පිහිට වීමට තම හමුදාවන් යැවූ දෙවන සේන එවැනි පාලකයන්ය රජරට රාජධානියට එරෙහිව ආක්රමණයන් කිහිපයක් සිදුවූ අතර ඒවා සියල්ලක්ම දියත් කරන ලද්දේ දකුණු ඉන්දියාණුවන් විසිණි ශ්රී ලංකා ඉතිහාසයේ පළමු වාර්තාගත ආක්රමණය සිදුවූයේ සූරතිස්ස ක්රි පූ රජු සමයේදීය එය සිදු කරන ලද්දේ සේන හා ගුත්තික යන දකුණු ඉන්දීය අශ්ව වෙළෙන්දන් දෙදෙනෙකු විසිනි අවුරුදු විසිදෙකක පාලන කාලයෙන් අනතුරුව අසේල ක්රි පූ විසින් ඔවුන් පරජය කරන ලදී ඉන් අනතුරුව පැවති තවත් ආක්රමණයක් හේතුවෙන් චෝළ රජකු වූ එලාර ක්රි පූ අසේල රජු පරදවා රටෙහි පාලකයා බවට පත් විය එලාර අවුරුදු ක් රට පාලනය කළ අතර ඔහුව පරජයට පත් කරන ලද්දේ දුටුගැමුණු විසිනි කෙසේ නමුත් මහාවංශ වාර්තා වලට අනුවඑළාර විසින් රට යුක්තිගරුක ලෙස සහ සධාරණ ලෙස පාලනය කළ බව කියැවේ දකුණු ඉන්දියාව සහ ශ්රි ලංකාව ක්රි පූ දී ද්රවිඪ නායකයන් පස් දෙනෙකු වූ පිලහත්ත බාහිය පනයාමර පිලියාමර දතික විසින් රට නැවතත් ආක්රමණය කරන ලදී ඔවුන් ක්රි පූ දක්වා රට පාලනය කළ අතර වළගම්භා හට පරාජයට පත් විය පසුව ඇති වූ තවත් ආක්රමණයක් නිසා රටෙහි පාලනය දකුණු ඉන්දීය පාලකයන් සය දෙනෙකු වූ පණ්ඩු පාරින්ද තිරිතර දාතිය සහ පීතිය යටතට පත් විය ධාතුසේන විසින් ඔවුන් පරදවා නැවත බලය ලබා ගන්නා ලදී වන සේන සහ වන උදය රජ සමය තුළ දකුණු ඉන්දියාවෙන් බොහෝ ආක්රමණ සහ කොල්ලකෑම් එල්ල විය කෙසේ නමුත් මෙම ආක්රමණිකයන්ගෙන් කිසිවෙකු ඔවුන්ගේ පාලනය රටෙහි දකුණු ප්රදේශය වූ රුහුණ දක්වා දීර්ඝ කර නොගත්හ එබැවින් ශ්රී ලාංකීය පාලකයන් සහ උරුමක්කාරයන් ඔවුන්ගේ හමුදාවන් මෙම ප්රදේශය තුළ සංවිධානය කොට ගෙන ඔටුන්න නැවත ලබා ගැනීමට සමත් වූහ ශ්රී ලාංකීය ඉතිහාසය මුළුල්ලේම සතුරු ආක්රමණ වලින් රට බේරා ගත් අවස්තාවලදී රුහුණ මුල් වී ඉමහත් සේවයක් කරන ලදී පරිපාලනය රාජධානිය රජුගේ පාලනයට යටත් විය රාජ්යත්වයට සම්බන්ධ වූ කැප කිරීමේ උත්සව සහ පිළිවෙත් ක්රමයන් ආරම්භ වූයේ දේවානම්පිය තිස්ස රජු සමයේදීය එය එලෙස සිදු වූයේ ඉන්දියාවේ අශෝක රජුගෙන් ලැබූ ආභාශය හේතු කොට ගෙනය දුටුගැමුණු රජු විසින් ප්රථම වරට මුළු රටම තමන් යටතට පත් කොටගෙන රට එක්සේසත් කරන ලදී ඔටුන්නේ හිමිකාරිත්වයෙහි අනුපිළිවෙල සිදුවූයේ පිය පරම්පරාවට අනුකූලවය එය සිදු කළ නොහැකි අවස්තාවකදී පෙර රජුගේ වැඩිමහල් සහෝදරයාට ඔටුන්නේ හිමිකාරිත්වය උරුමයෙන් ලැබුණි සහෝදරයන් නොසිටියේ නම් වැඩිමහල් පුත්රයා හට ඔටුන්න උරුම විය අනුරාධපුර රාජධානියේ ආරම්භයේ සිට පාලකයෝ සතර දෙනෙකු රාජ්යය පලනය කරන ලදහ විජයගෙන් ආරම්භ කොට සුභරාජ දක්වා සිටි පාලකයන් සාමාන්යයෙන් හැඳින්වූයේ විජයන් රජ පෙළපතට අයත් අය ලෙසයි මෙම රජ පෙළපතට අයත් වූ පණ්ඩුකාභය අනුරාධපුර රාජධානියේ ප්රථම පාලකයා විය රුවන්වැලිසෑය අසල පිහිටුවා ඇති දුටුගැමුණු ප්රතිමාව ළඹකන්න වංශයට අයත් වසභ විසින් බලය පැහැර ගන්නා තුරු විජයන් පෙළපත පැවතුණි වසභ විසින් ඔටුන්න හිමි කර ගැනීමත් සමඟ ළඹකන්න රජ පෙළපත ආරම්භ වූ අතර එම පෙලපතට අයත් පාලකයන් සියවස් තුනකට වඩා වැඩි කාලයක් රට පාලනය කරන ලදහ නව රජ පෙළපතක් ආරම්භ වූයේ දී ධාතුසේන කාලයේදීය එය මූරිය රජ පෙළපත විය ඇතැම් ඉතිහාසඥයන් විසින් මෙම රජ පෙළපතෙහි ආරම්භය ශාඛ්ය රජු ලෙස හැඳින්වූවත් ආරම්භක රජු තවමත් අවිනිශ්චිතය අනුරාධපුර යුගයේ පැවති අවසාන රජ පෙළපත වූයේ දෙවන ළඹකන්න රජ පෙළපතයි එය මානවම්මගෙන් ආරම්භ වූ අතර අනුරාධපුර රාජධානියේ අවසාන පාලකයා වූ වන මහින්ද දක්වා පැවතුනි අනුරාධපුර රජකම් කර රජවරු අනුරාධපුර රජකම් කර රජවරු විවිධ වු යුගයන්වලට අයත් වුවෝ විය පහත දැක්වෙන්නේ එම යුගයන් ය පණ්ඩුකාභය රාජ වංශ යුගය පණ්ඩුකාභය රජ මුඨසිව රජ පණ්ඩුකාභය රජගේ පුත් තිස්ස රජ දේවානම්පිය තිස්ස රජ උත්තිය රජ මහාසිව රජ සූරතිස්ස රජ චෝල යුගය චෝල යුගය රජරට රාජධානිය ආක්රමණක චෝල සේන හා ගුත්තික අශ්වාචාරි අසේල රජ දේවානම්පිය තිස්ස බාල සොයුරු ආක්රමණක චෝල එළාර රජ චෝල යුගය මායා කැළණි රාජධානිය කැළණි තිස්ස රජ චෝල යුගය රුහුණු රාජධානිය කාවන්තිස්ස රජ පණ්ඩුකාභය රාජවංශ යුගය සිංහලේ රාජධානිය දුටුගැමුණු රජු සද්ධාතිස්ස සැඳෑතිස් තුලත්ථන ලංජතිස්ස ලැමිණිතිස් බල්ලාඨනාග වළගම්බා රජු වට්ටගාමිණී අභය වලගම් අබා ආක්රමණක පංච ද්රවිඩයන් පුලහත්ථ බාහිය පනයමාර පිළයමාර දාඨිය වළගම්බා රජු යළි රජවීම මහවුලිතිස්ස චෝරනාග තිස්ස කුඩාතිස්ස සිව වටුක දාරුභාතික තිස්ස තිලිය පුරෝහිත බමුණා අනුලා රැජින කූඨකණ්ණ තිස්ස භාතික අභය මහාදාථික මහානාග ආමන්ද ගාමිණී අභය කණිරජානු තිස්ස චූලාභය සීවලී රැජින අරාජික සමය ඉලනාග චණ්ඩමුඛසීව යසලාලක තිස්ස සුබ රජ සභ සුභ ලම්බකර්ණ රාජ වංශය වසභ රජ වංකනාථතිස්ස ගජබාහුක ගාමිණී වන ගජබාහු රජ මහල්ලකනාග භාතික තිස්ස කනිට්ඨතිස්ස බුජ්ජනාග කුංචනාග වන සිරිනාග වෝහාරිකතිස්ස වෙහෙරතිස්ස අභයනාග වන සිරිනාග විජය කුමාර වන සංඝතිස්ස සිරිසංගබෝධි දැහැමි සිරිසඟබෝ ගෝඨාභය ගොළු අබා වන ජෙට්ඨතිස්ස මහාසේන මහසෙන් සිරි මේඝවණ්ණ කිත්සිරිමෙවන් වන ජෙට්ඨතිස්ස බුද්ධදාස රජ වන උපතිස්ස මහානාම වට්ටගාහජන්තු මිත්තසේන මිත්සෙන් ෂඩ් ද්රවිඩයන් පණ්ඩු පාරින්ද ඛුද්ධ පාරින්ද තිරිතර දාඨිය පීඨිය මෞර්ය රාජ වංශය ධාතුසේන රජු වන කස්සප සීගිරි කසුබු සීගිරි බලකොටුව සට රට පාලනය කලේය මොග්ගල්ලාන මුගලන් කුමාර ධාතුසේන කුමාරදාස කුමාරදාස් කිත්තිසේන සිව වන උපතිස්ස සීලාකාර අම්බ සාමනේර දාඨාපභූති දාපලුසෙන් වන මොග්ගල්ලාන කිත්සිරිමේඝ කුඩා කිත්සිරිමෙවන් මහානාග වන අග්ගබෝධි අක්බෝ වන අග්ගබෝධි කුඩා අක්බෝ වන සංඝතිස්ස වන මොග්ගල්ලාන සීලාමේඝවණ්ණ වන අග්ගබෝධි සිරිසංඝබෝධි වන ජෙට්ඨතිස්ස වන අග්ගබෝධි යළි රජවීම දාඨෝපතිස්ස වන කස්සප වන දප්පුලු හත්ථදාඨ වන අග්ගබෝධි දට්ට වන හත්ථදාඨ ලම්බකර්ණ මානවම්ම රාජ වංශය මානවම්මරජ වන අග්ගබෝධි වන කස්සප වන මහින්ද වන අග්ගබෝධි වන අග්ගබෝධි වන මහින්ද වන උදය වන මහින්ද වන අග්ගබෝධි වන දප්පලු වන අග්ගබෝධි වන සේන වනසේන වන උදය වන කස්සප වන කස්සප වන දප්පුලු වන දප්පුල වන උදය වන සේන වන උදය වන සේන වන මහින්ද වන සේන වන මහින්ද රජ මිහිදු ක්රි ව මහා මෙිඝ උද්යානය ගොඩනැගිම අනුරාධපුරය නගරය ගොඩනැගිමට මුල් වුයේ පණ්ඩුකාභය රජතුමා විසිනි එය අගනගරය ලෙසට තවදුරටත් පවත්වාගෙන යනලද්දේ ඔහුගේ පුත් මුටසිව විසිනි ඔහු රාජ්යත්වයට පත් වුයේ බුද්ධ පරිනිර්වාවසර කට පසුව ය ඔහු විසින් මහා මෙිඝ විනෝද උද්යානය සකසනු ලැබිය මෙිකි උද්යානය මල් සහ ඵල සහිත සියලු ආකාරයේ වෘකෂයන්ලගන් පිරි අලංකාරව පැවතුනි උද්යානය ගොඩනගන කල්හි මහා වර්ෂාපතනයක් ඇදහැලුන බැවින් මහා ධාරානිපාත වර්ෂාව යන අර්තය සිංහල භාෂාවෙන් මහා මෙිඝ යන නමි ලැබුණි වර්ග සැතපුමි ගණනාවක විහිදුන මෙයපිහිටා තිබුනේ නගර සිමාවෙන් පිටත දකුණු භාගයෙහිය මෙකි උද්යානයේ පිහිටිම ගැන මහින්දාගමනයේ පවා ප්රකට වි ඇත එමෙන්ම දෙවනමිපියතිස්ස රජු කල උද්යානයෙහි විවිධආගමිික පුජාවන් පවත්වන ලදි අනුරාධපුර ඉතිහාසය සමග බැදි පවතින මල්වතු ඔය හෙවත් කදමිභ නදිය අනුරාධපුරයට පැමිනෙණ සියලු දෙනා විසින් දැක බලා ගන්නා මහත් ප්රසිද්දියට පත් නදියකි එය මුලින්ම හදුන්වන ලද්දේ කදමිභ නදී යන නාමයෙන් ය උද්යානයට සමිපව පිහිටා ඇති බැවින් එය මල්වතු ඔය මෙවත් මල් වත්තඔය යන නමින් හැදින්විය මෙය පිහිටා ඇත්තේ් උද්යානයේ නැගෙනහිර සිමාවෙහි ය උපුටා ගැන්ම අනුරපුරයේ අටමස්ථාන වැඩිම කාලයක් මෙරට අගනුවර ලෙස යොදාගත් නගරය වන්නේ ඓතිහාසික අනුරාධපුරවරයයි ඒ හේතුව නිසාවෙන්ම ඉතිහාසය පුරා විද්යාව මෙන්ම බෞද්ධාගමික සාධක සහ නටඹුන් අතින්ද අනුරාධපුරය සෙසු රාජධානි පැවතුනු නගර වලට වඩා පොහොසත්ය දෙවන පෑ තිස් රජ දවස භාරත දේශයේ සිට මිහිඳු මා හිමි මෙරටට බෞද්ධ ධර්මය ගෙන ආ දින පටන් මෙරට පාලකයෝ ස්වකීය ජනතාවට වන්දනාමාන කිරීමටත් තමන්ගේ පින් වැඩිකරගැනීමත් අරමුණු කරගෙන වෙහෙර විහාර ඉදිකරන ලදී ඒ අතරින් අතීතයේ පටන් බෞද්ධයන්ගේ අපරිමාන ගෞරවයට ලක් වූ සිද්ධස්ථාන අටක් අනුරපුර පුදබිම අවට පිහිටා ඇත අටමස්ථාන නමින් හඳුන්වනු ලබන මෙම ස්ථාන පිළිබඳ කෙටි හැඳින්වීමක් මෙම ලිපිය තුළින් කිරිම අපගේ අරමුණයි ලොක උරුමයක් වන අනුරාධපුරයේ වන්දනා චාරිකාවක් යන්නට අදහස් කරන කාට වුවද තමන් යන ගමන පිළිබඳ යම් අදහසක් මෙම ලිපිය තුළින් ගත හැකිය යන්න අපගේ අදහසයි අටමස්ථාන අතර මුල් තැන හිමිවන්නේ ගෞතම බුදුන්ට බුද්ධත්වය ලබාගැනීමේදී සෙවන දුන් ජයසිරිමහා බෝධීන් වහන්සේටයි ඉන්දියාවේ පිහිටි බෝධීන් වහන්සේගේ ශාකාවක් වන මෙය දැනට ලොව පවතින පැරණිතම වෘක්ෂයක් ලෙසද සැලකේ පොළව මට්ටමෙන් අඩි ක් පමණ ඉහලින් වන බොධිඝරයක රෝපණය කර ඇති මෙම බෝ වෘක්ෂය දැනට ඇති බැතිමතුන්ගේ වන්දනාමානයට ලක්වන පැරණිතම වෘක්ෂයද වන්නේය උඩ මළුවේ රෝපිත මෙම බොධියෙන් හටගත් අංකූර ශාකා අෂ්ඨ පල බෝධීන් ලෙසින් හැඳින්වෙන අතර ඒවා රටේ සිවි දිග බෞද්ධ සිද්ධස්ථාන වල අතීත රජවරුන් විසින් රෝපණය කර ඇත අතීතයේ වන සිව්පාවුන්ගෙන් මෙම බෝධියට සිදුවන හානි වලක්වා ගැනීමට වෙනමම කැපවූ පිරිසක් මෙම අවට ගිණිමැල ආදිය දල්වාගෙන මුරකාවල් යොදා සිට ඇත දකුණු ඉන්දීය පාලකයන්ගේ සමයන්හිදී පවා මෙම වෘක්ෂයට කිසිදු හානියක් සිදුකළ බවට වාර්තා වී නැත උඩමළුවේ සිට බැලූ මානයේ පිහිටා ඇති ස්වේත වර්ණ මහා දාගැබ අටමස්ථානයන් හි තවත් එක් වටිනා සිද්ධස්ථානයකි දුටුගැමුණු රජුන් විසින් ඉදිකරන්නට යෙදුනු මෙම මහා දාගැබ ස්වර්ණමාලී මහා සෑයයි රුවන්වැලි සෑය නමින්ද හඳුන්වනු ලබන මෙය මීටර ක් පමණ උසට ඉදිකර ඇති බුබ්බුලාකාර ස්වරූපයේ චෛත්යයකි ලක්දිව එක්සේසත් කිරීමෙන් අනතුරුව නිර්මාණය ඇරඹී මෙම මහා සෑයේ අවසානය සියැසින් දැක ගැනීමට මෙයට මූලිකත්වය දුන් දුටුගැමුණු රජුට හැකියාව ලැබී නැත එබැවින් මරණාසන්න රජු මෙම සෑය අබියසට රැගෙන විත් එය නිර්මාණය කර ඇති වග පෙන්වීමට උණ බම්බු සහ සුදු රෙදි ඔතා තාවකාලිකව නිම කරන ලද චෛත්යය රජුට පෙන්වීමට ඔහුගේ සොයුරු කටයුතු කර ඇති බව පුරාවෘත්ත වල සඳහන් වෙයි රුවන්වැලි සෑය පෙනෙන මානයේ පිහිටා ඇති ගල් කුළු රැසකට මැදි වූ කුඩා චෛත්යය ථූපාරාමයයි මිහිඳු හිමියන්ගේ සමයේම ඉදිවූ මෙය ලක්දිව මුල්ම චෛත්යය ද වන්නේය දේවානම් පියතිස්ස රජුන් විසින් කරවූ මෙහි මුල් හැඩය ධාන්යාකාර වූ බව පුරාවිද්යා මතයයි ස්ථූපයක් මැදිකොට තැනූ ආරාමය යන අරුත මෙයට ලබා දී ඇත මෙහි උස මීටර ක් පමණ වෙයි ගල් කුළු මත ඉදිකරන ලද දැවමය වහලයකින් ආවරණය ලද මෙවැනි ස්ථුප වටදාගෙය නමින් හඳුන්වනු ලැබේ දුටුගැමුණු රජු විසින් අදින් වසර දෙදහසකට පමණ පෙර ඉදිකරන ලද සංඝාවාසයක් උඩමළුවටත් රුවන්වැලි මහා සෑයටත් අතරේ පිහිටා ඇත අටමස්ථාන අතර තවත් එක් වැදගත් ස්ථානයක් වන මෙය ලෝවාමහාපායයි දැනට ඉතිරිව ඇත්තේ ගල් කණු ක් පමණ වුවත් එදා හෙළ රජ දවස මහා සංඝරත්නය දහසකටත් වඩා නවාතැන් පහසුකම් සැලසූ මහල් නවයකින් යුතු සුවිසල් ගොඩනැගිල්ලක්ව පැවතුණු මෙම සිද්ධස්ථානයේ වහලය පිත්තලෙන් නිර්මාණය කර තිබූ බවට මතයක් පවතී මුල් යුගයේ ජේතවනාරාමය ලෙසින් හඳුනාගනු ලැබූවද පසුකාලීනව අභයගිරිය ලෙසින් ස්ථිර කරගත් මහා සෑය අටමස්ථානයේ තවත් එක් වැදගත් ස්ථානයකි දැනට ගරාවැටී ඇති නමුත් සංස්කරනයන් සිදුවෙමින් පවතින මෙය එදා මෙරට බෞද්ධාගමික මධ්යස්ථාන අතර මුල්තැන ගත් විහාරාරාම සංකීරණයක්ව පැවත ඇත මෙය වළගම්බා රජුගේ ඉදිකිරීමකි එවකට සංඝයා වහන්සේ ක් පමණ මෙහි වැඩවිසූබව සඳහන්ය සොලී පහරදීම් හමුවේ පලායමින් සිටි වලගම්බා රජුට මහා කලු සිංහලයා පලා යනවා යැයි කියමින් නින්දා කල ගිරි නම් ජෛන පූජකයෙක් මෙහි විසූ බවත් රජු නැවත රජවූ පසු ගිරි පලවා හැර තමාට සැඟවී සිටි සමයේ උදව් උපකාර කල හිමි නමකට මෙම විහාරය කරවා පූජාකල බවත් සඳහන්ය දැනට සංරක්ෂණය කර ඇති අභයගිරිය තරමේම තවත් එක් මහා සෑයකි ජේතවනාරාමය අටමස්ථාන අතර තවත් එක් වැදගත් ස්ථානයක් වන මෙය මහසෙන් රජ සමයේ ඉදිකරනු ලැබ ඇත දැනට මෙය උසින් මීටර ක් පමණ වන නමුත් එය එවකට මීටර ක් පමණ වන්නට ඇති බව පුරාවිද්යා මතයයි මෙය ලොව තෙවැනි උසම ඓතිහාසික ඉදිකිරීමද වන්නේය වර්ෂ එක්දහස් නවසීයේදී පමණ ලියැවී ඇති බිතාන්ය කෘතියක සඳහන්ව ඇත්තේ මෙම දාගැබේ වූ ගඩොල් වලින් ලන්ඩන් නුවර සිට එඩින්බර්ග් දක්වා මීටර තුනක පමණ සෘජු බැම්මක් ඉදිකලහැකි බවයි මෙය එවකට සංඝයා වහන්සේලා කට පමණ නවාතැන් පහසුකම් සැලසූ බව සඳහන්ය එළාර රජු පරදා ලක්දිව එක්සේසත් කල දුටුගැමුණු රජු තිසාවැව අසබඩ තමන්ගේ ජය කොන්තය නිදන්කර නිර්මාණය කරන ලද දාගැබ මිරිසවැටියයි තිසාවැවත් බසවක්කුලම වැවත් යා කරන මාවත පසෙකින් පිහිටා ඇති අටමස්ථාන අතර තවත් එක් සිද්ධස්ථානයක් වන මෙහි පසෙකින් බිතාන්ය පාලන සමයේ ඉදිකරන ලද සිර මැදිරි සංකීරණයේ කොටසක් දැකගත හැකිය එවකට වැරදි කරුවන් එල්ලා මැරීමද මෙම ස්ථානයේ සිදුකර ඇත සංඝයා වහන්සේට නොපිළිගන්වා කිසිත් අනුභව නොකල දුටුගැමුණු රජු අතපසුවීමකින් සංඝයා වහන්සේට නොදී මිරිස් මාළුවක් ආහාරයට ගත් හෙයින් ඒ වැරැද්ද හදාගැනීම අරමුණුකර මෙය නිර්මාණය කලබවජන වහරේ මෙන්ම අතීත පොත්පත් වලද සඳහන්ව ඇත අටමස්ථාන අතර අවසන් සිද්ධස්ථානය ලංකාරාමයයි මෙය වළගම්බා නිරිඳුන්ගේ නිර්මාණයකි මේ පිළිබඳව සඳහන් වන ඓතිහාසික තොරතුරු අවම වන අතර දැනට ඉතිරිව පවතින ගල්කණු දෙස බැලීමේදී මෙයද අනිවාර්යයයෙන්ම ථුපාරාමයේ මෙන් වටදාගයකින් ආවරණය වී තිබෙන්නට ඇති බව අනුමාන කල හැකිය අනුරාධපුර රාජධානියේ අවසානය දිගින් දිගටම වූ දකුණු ඉන්දීය ආක්රමණ වලින් තැවුණු නගරය අවසානයේදී ක්රි ව දී අතහැර දැමිණ මෙම මහා නගරය ක්රි පූ වන සියවසයෙහි සිට ක්රි ව දක්වා ලංකාවේ අඟනගරය ලෙස පැවතුනි එහි පසුබැස්ම ඇරඹියේ දකුණි ඉන්දීය ආක්රමණයන්ට එරෙහිව දිගින් දිගටම වූ යුද වැදීම නිසා රාජධානිය ආර්ථිකමය අතින් දුප්පත් වීමය ක්රි ව දී චෝල අක්රමණික හමුදාව අනුරාධපුරය අතහැර ඊට සාපේක්ෂව ආරක්ෂිත පොළොන්නරුවට පරිපාලන නගරය ගෙන ගියේය නගරයට සහ එහි වූ වාරී සංකීරණයට වූ අති මහත් විනාශය හේතුවෙන් එය සම්පූර්ණයෙන්ම අතහැර අවුරුදු දහසකට ආසන්න කාලයක් ජරාවාස වන්නට හැරුණි පසුව වන සතවසරේදී බ්රිතාන්ය පරිපාලනය විසින් කැළෑ හෙළි කර නැවත ජනාවාස ඇති කෙරිණි",
        "ශ්රී ලංකාවෙි ප්රථම රාජධානිය වශයෙන් වසර සියයකටත් අධික කාලයක් පැවති අනුරාධපුර රාජධානිය වාස්තු විද්යාත්මක වශයෙන් ඉතාමත් වැදගත් ස්ථානයකට හිමිකමි දැරිය කෙසේ වෙතත් බොහෝ දෙනෙකු වටහා නොගත් සත්ය නමි පුරාතන යුගයේ දි එකිනෙකට වෙනස් වු නගර දෙකක් පැවතිය බවය එනමි අනුරාධපුරය නමි වු දේශපාලන අගනුවර සහ අනුරාධපුරය නමි වඅ පුජනිය නගරය යි අනුරාධපුරය නමි වු පුජනිය නගරය හා සමිබන්දව සත්ය වර්තාවන් ඉදිරිපත් කිරිමෙි දී ශත වර්ෂ විසි දෙකක් පුරා බෞද්ධ ලෝකය විසින් පුජනීයත්වයෙන් සලකන ලද නගරයක් ලෙස දැක්විමට පිළිවණ රජරට රාජධානිය වත්මන් ශ්රි ලංකාව පිහිටි භූමියේ ප්රථම සංවිධානාත්මක නවීන රාජධානිය වුයේ රජරට රාජධානියයි අනුරාධපුර රාජධානියේ ආරම්හක පාලකයා වූ පණ්ඩුකාහය රජු විසින් අනුරාධපුර නගරය සංවර්ධනය කරන ලදී රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්රධාන කාර්යයක් විය බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය මෙම ඉදිකිරීම් නිසා අනුරාධපුර යුගය මුළුල්ලේම රජරට ප්රදේශය තුළ විශාල එමෙන්ම සංකීර්ණ වාරිමාර්ග පද්ධතියක් බිහි විය රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්රධාන කාර්යයක් විය බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය මෙම ඉදිකිරීම් නිසා අනුරාධපුර යුගය මුළුල්ලේම රජරට ප්රදේශය තුළ විශාල එමෙන්ම සංකීර්ණ වාරිමාර්ග පද්ධතියක් බිහි විය එකල ඉදි කරන ලද මහා ස්ථුපයන් වූ රුවන්වැලිසෑය ජේතවණාරාමය මෙන්ම ලෝවාමහාපාය වැනි විශාල ගොඩනැගිලි මඟින් අනුරාධපුර යුගයේ තිබූ ගෘහ නිර්මාණ ශිල්පයේ දියුණුව මනාව පෙන්නුම් කරයි උපතිස්සනුවර අනුරාධපුර නගරය ඓතිහාසික මූලාශ්රයන්හි සඳහන් වන පරිදි අනුරාධපුර නගරය ආරම්භ වී ඇත්තේ ක්රි පූ සියවෙසහි වුවත් පුරාවිද්යාත්මක තොරතුරු අනුව එහි ඉතිහාසය ක්රි පූ වැනි සියවස තරම් ඈතට දිව යයි කරන ලද පුරා විද්යා කැණීම් වලදී වඩා පූර්ව කාලයන්හි විසූ ජනයා සම්බන්ධ සාක්ෂි ලැබී ඇතත් ක්රි පූ සියවසට එපිට කාලය පිළිබද තොරතුරු අත්ෙත් මද වශෙයනි අනුරාධපුරෙය් වැඩිදුර සිදු කරන ලද කැණීම් වලදී මෙම පුරවරෙය් පැවති ප්රාග් ඓතිහාසික ජනාවාසයන් පිළිබද තොරතුරු ලැබී ඇත ක්රි පූ දක්වා විහිදුණ ප්රාග් ඓතිහාසික ලෝහ යුගෙය්දී ලෝහ තාක්ෂණය කුඹල් කර්මාන්තය අහ්වයන් භාවිතය ගවයන් ඇති කිරීම සහ වී වගාවද පැවතුණ බව පෙනී යයි ක්රි පූ අතර කාලයේදී අනුරාධපුරයේ ජනාවාසය හෙක්ටයාර් ඉක්මවා වර්ධනය විය නගරය ඊසාන දිගින් සහ වයඹ දිගින් පිහිටි ප්රධාන වරායයන් අතර උපායමාර්ගිකව වැදගත් වන පරිදි පිහිටියේය වගා කළ හැකි සරු බිම් එය වටෙකාට පිහිටා තිබුණි ආක්රමණිකයන්ගෙන් නගරය ආරක්ෂා කළ ස්වභාවික පවුරක් වූ ඝන වනාන්තරය නගරය හාත්පස අවුරා විය ක්රි පූ සියවසෙහිදී පණ්ඩුකාභය රජතුමන් විසින් අනුරාධපුරය අගනගරය බවට පත් කරන ලද බවත් මනා සංවිධිත සැලසුමක් අනුව නගරය සහ එහි උප නගරයන්ද පිහිටුවන ලද බවත් කියැවේ අභය වාපි හෙවත් අභය වැවද එතුමන් විසින් කරවන ලදී කාලවේල සහ චිත්තරාජ නමැති යක්ෂයන් උදෙසා දෙවොල්ද කරවනු ලැබීය චේතියා නමැති යක්ෂණිය උදෙසා වෙළඹකගේ ස්වරූපයෙන් වූ පිළිරුවක් රාජ මාළිග පරිශ්රයේම ඉදි කරවන ලද අතර මේ සියළු යක්ෂ දේවතාවන් උදෙසා වාර්ෂිකව පුද පූජා පැවැත්වීමද සිදු විය නගරයේ සුසාන භූමිය වදක භූමිය පශ්චිම රාජිණියගේ දෙවොල වෙස්සවණ උදෙසා වූ නුග රුක ව්යාධදේව උදෙසා වූ තල් රුක යෝනයන් සඳහා වාස භූමිය ආත්ම පූජා මන්දිරය ආදිය පිහිටැවිය යුතු තැන්ද මෙතුමන් විසින් නියම කරන ලදී වහලුන් නොහොත් චණ්ඩාලයන් විසින් කළ යුතු කාර්යයන් නියම කෙරුණු අතර ඔවුන් උදෙසා ග්රාමයක් වෙන් කරන ලදී නිඝණ්ටයන් තැන තැන සරන තවුසන් ආජීවකයන් සහ බ්රාහ්මණයන් උදෙසා වාසස්ථාන ගොඩ නඟන ලදී ග්රාම සීමාද නීර්ණය කරනු ලැබීය අනුරාධපුරය අග නගරය බවට පත් කරමින් ක්රි පූ සියවස තරම් ඈත යුගයකදී පණ්ඩුකාභය රජතුමන් විසින් බිහි කරනු ලැබූ සම්ප්රදාය ඉතා වැදගත් වේ නගරයට සහ පූජනීය ස්ථානයන්ට කරනු ලැබූ සනීපාරක්ෂක සහ පරිපාලනමය සම්පාදනයන් විසින් පෙන්නුම් කෙරෙනුයේ කාලාන්තරයක් තිසිසේ නගරය කිසියම් මධ්යගත සැලැස්මකට අනුව සංවර්ධනය කෙරුණු බවය පණ්ඩුකාභය රජතුමන්ගේ ඇවෑමෙන් එතුමන්ගේ පුත් මුටසීව රාජපදප්රාප්ත විය හැට වසරක් වූ එතුමන්ගේ රාජ්ය පාලන කාලය තුළ අනුරාධපුර නගරය තවදුරටත් අගනුවර වශයෙන් පවත්වා ගත් අතර බුදු සමය දිවයිනට හඳුන්වා දෙනු ලැබූ මුල් අවදියේදී වැදගත් කාර්යභාරයක් ඉටු කරනු ලැබූ මහාමේඝවන උද්යානය හෙවත් මහමෙවුනා උයන පිහිටුවාලීමද එසමයෙහි සිදුවිය බුදු රජාණන් වහන්සේගේ පිරිනිවන් පෑමෙන් වසර කට පසු ශ්රී ලංකාවට බුදු සමය හඳුන්වාදෙන ලද්දේ මුටසීව රජතුමන්ගේ ඇවැමෙන් රාජ්යත්වයට පත් එතුමන් පුත් දේවානම්පියතිස්ස රාජ්ය සමයෙහිදීය ඉන්දියාවෙහි වුසූ අශෝක අධිරාජයා දේවානම්පියතිස්ස රජතුමන්ගේ සමකාලීනයෙක් විය මෙම කාලය ක්රි පූ අතර කාලයයි ලංකාවෙහි රාජ්යත්වයෙහි ආරම්භය සහ ආසියාවෙහි විශිෂ්ඨතම ආගමක් වූ බුද්ධ ධර්මය මත පදනම් වූ ශිෂ්ඨාචාරයක ආරම්භයද සනිටුහන් කෙරෙන්නේ මෙසමයෙහිය බුද්ධාගමේ ආගමනය ශ්රි මහ බෝධි පරිශ්රයෙහි වැඩ වසන ශාඛා බෝධීන් වහන්සේ නමක් දේවානම්පියතිස්ස රාජ්ය කාලයේදී බුදු දහම හඳුවාදිමත් සමඟ ලංකාවේ සමාජීය හා සංස්කෘතික වශයෙන් වෙනස්වීම් සිදුවිය එම වෙනස්වීම් තවදුරටත් වර්ධනය වූයේ බුදුන් වහන්සේගේ දන්ත ධාතුව ලංකාවට වැඩම කරවීමත් සමඟය මූලික වශයෙන් අනුරාධපුර යුගයේ සංස්කෘතිය පදනම් වූයේ බුදුදහම මතය එසේම එම රාජධානියේ නීතිය සහ පාලනය සඳහාද බුදුදහම මඟින් ඉමහත් බලපෑමක් එල්ල විය ක්රි පූ වැනි සියවසෙහි ශ්රි මහ බෝධිය ශ්රි ලංකාවට ගෙන එන ලද්දේ අශෝක අධිරාජයාගේ දියණිය වන සංඝමිත්තා මෙහෙණිය විසිනි ඇය ශ්රි ලංකා භික්ෂූණී ශාසනය පිහිටුවීමේ ලා පුරෝගාමී වූවාය ක්රි පූ දේවානම්පියතිස්ස රජතුමා විසින් අනුරාධපුර මහ මෙව්නා උයනෙහි මෙම ජය සිරි මහ බෝධිය සිටුවන ලදී බුදු දහමේ හඳුන්වා දීමත් සමඟම මෙම නුවර විසල් කැපීපෙනීමක් ලැබුවාක් මෙන්ම මහා ඉඳිකිරීම් යුගයක් ද ඇරඹුනි මහා වංශය පවසන්නේ කුටකන්න තිස්ස රජු විසින් රියන් හතක් උස තාප්පයක් ජල අගලක් ඉදිරියෙන් පවතින පරිදි පලමු තාප්පය ඉදිකළ බවයි පසුව වසභ රජු විසින් මෙය රියන් සිට රියන් දක්වා උස්කොට තවදුරටත් බලවත් කරන ලදි එසේම රජු විසින් ශක්තිමත් දොරටු නිවස්න වාසල් කඩ ඉදි කර ඇති අතර ඒවායෙහි නටබුන් අදද දැකිය හැක මහා වංශය තව දුරටත් පවසන්නේ ඉදිකිරීම් හිදී නිමිති කියන්නන් සහ වාස්තු විදුවන් ගේ උපදෙස් ලැබූ බවය පූජනීය දන්ත ධාතුවේ සම්ප්රාප්තිය කිත්සිරිමෙවන් රජ සමයේදී හේමමාලා කුමරිය සහ දන්ත කුමරු විසින් බුදුන් වහන්සේගේ දන්ත ධාතුව ලංකාවට වැඩම කරවන ලදී එම රජු විසින් දන්ත ධාතුව පෙරහැරකින් වඩම්මවා මන්දිරයක තැන්පත් කරන ලදී මෙම පෙරහැර වාර්ශිකව පවත්වන ලෙස රජු අණ කල අතර අදටත් එය චාරිත්රයක් ලෙස රටෙහි පවතී බුදුන් වහන්සේගේ දන්ත ධාතුව ඉතා ඉක්මනින්ම රටෙහි පූජනීය වස්තුවක් මෙන්ම රජ්ය භාවය තහවුරු කරන සංකේතයක් බවට පත් විය දන්ත ධාතුව ළඟ තබා ගන්නා පුද්ගලයා රටෙහි නියම පාලකයා විය එමනිසා බොහෝ විට එය රජ මාළිගාවෙහිම නිදන් කොට තබන ලදී වැසි ජල කලමණාකරන තාක්ෂණය රජරට රාජධානියේ ප්රධානතම ජයග්රහණය වූයේ වැසි ජලය මනාව කලමණාකරන කලහැකි වාරිමාර්ග බිහිවීමයි ඒ හේතුවෙන් වියළි කලාපයේ කෘෂිකාර්මික අවශ්යතාවන් සඳහා ජලය සැපයීම සිදු විය මෙම වාරිමාර්ග ඉදිකිරීම් මඟින් එම යුගයේ මිනිසුන් තුළ තිබූ උසස් තාක්ෂණික හා ඉංජිනේරු හැකියාවන් මනාව පිළිඹිබු කරයි සමකාලීන රාජධානි දේවානම්පිය තිස්ස රජ ගේ සොහොයුරු මහානාග කුමරු විසින් රජරට රාජධානියෙන් ස්වාධීන රුහුණු රාජධානිය පිහිටුවාගන්නා ලදී රජරට රාජධානිය ආක්රමණියන් අතට පත් බෝහෝ අවස්ථාවලදී රුහුණු රාජධානිය බලය රැකගැනීමට ස්වදේශික සිංහලයන් සමත්විය ආක්රමණයන් රජරට රාජධානියට අඛණ්ඩව පැවතුණු තර්ජනයක් වූයේ දකුණු ඉන්දීය ආක්රමණයන්ය එලෙස සිදු වූ ආක්රමණයන්ගෙන් සතුරන් පරදවා රජධානියේ පාලනය නැවත ලබාගත් දුටුගමුණු වළගම්භා ධාතුසේන වන විජයබාහු ලීලාවතී වැනි පාලකයන් කාගේත් අවධානයට ලක්විය අනෙකුත් පාලකයන් මතකයේ රැඳුනේ ඔවුන් විසින් සිදු කරන ලද හමුදා ජයග්රහණ නිසාය දකුණු ඉන්දියාවට එරෙහිව ආක්රමණයන් දියත් කළ පළවන ගජභාහු පන්ධ්යන් දේවියට පිහිට වීමට තම හමුදාවන් යැවූ දෙවන සේන එවැනි පාලකයන්ය රජරට රාජධානියට එරෙහිව ආක්රමණයන් කිහිපයක් සිදුවූ අතර ඒවා සියල්ලක්ම දියත් කරන ලද්දේ දකුණු ඉන්දියාණුවන් විසිණි ශ්රී ලංකා ඉතිහාසයේ පළමු වාර්තාගත ආක්රමණය සිදුවූයේ සූරතිස්ස ක්රි පූ රජු සමයේදීය එය සිදු කරන ලද්දේ සේන හා ගුත්තික යන දකුණු ඉන්දීය අශ්ව වෙළෙන්දන් දෙදෙනෙකු විසිනි අවුරුදු විසිදෙකක පාලන කාලයෙන් අනතුරුව අසේල ක්රි පූ විසින් ඔවුන් පරජය කරන ලදී ඉන් අනතුරුව පැවති තවත් ආක්රමණයක් හේතුවෙන් චෝළ රජකු වූ එලාර ක්රි පූ අසේල රජු පරදවා රටෙහි පාලකයා බවට පත් විය එලාර අවුරුදු ක් රට පාලනය කළ අතර ඔහුව පරජයට පත් කරන ලද්දේ දුටුගැමුණු විසිනි කෙසේ නමුත් මහාවංශ වාර්තා වලට අනුවඑළාර විසින් රට යුක්තිගරුක ලෙස සහ සධාරණ ලෙස පාලනය කළ බව කියැවේ දකුණු ඉන්දියාව සහ ශ්රි ලංකාව ක්රි පූ දී ද්රවිඪ නායකයන් පස් දෙනෙකු වූ පිලහත්ත බාහිය පනයාමර පිලියාමර දතික විසින් රට නැවතත් ආක්රමණය කරන ලදී ඔවුන් ක්රි පූ දක්වා රට පාලනය කළ අතර වළගම්භා හට පරාජයට පත් විය පසුව ඇති වූ තවත් ආක්රමණයක් නිසා රටෙහි පාලනය දකුණු ඉන්දීය පාලකයන් සය දෙනෙකු වූ පණ්ඩු පාරින්ද තිරිතර දාතිය සහ පීතිය යටතට පත් විය ධාතුසේන විසින් ඔවුන් පරදවා නැවත බලය ලබා ගන්නා ලදී වන සේන සහ වන උදය රජ සමය තුළ දකුණු ඉන්දියාවෙන් බොහෝ ආක්රමණ සහ කොල්ලකෑම් එල්ල විය කෙසේ නමුත් මෙම ආක්රමණිකයන්ගෙන් කිසිවෙකු ඔවුන්ගේ පාලනය රටෙහි දකුණු ප්රදේශය වූ රුහුණ දක්වා දීර්ඝ කර නොගත්හ එබැවින් ශ්රී ලාංකීය පාලකයන් සහ උරුමක්කාරයන් ඔවුන්ගේ හමුදාවන් මෙම ප්රදේශය තුළ සංවිධානය කොට ගෙන ඔටුන්න නැවත ලබා ගැනීමට සමත් වූහ ශ්රී ලාංකීය ඉතිහාසය මුළුල්ලේම සතුරු ආක්රමණ වලින් රට බේරා ගත් අවස්තාවලදී රුහුණ මුල් වී ඉමහත් සේවයක් කරන ලදී පරිපාලනය රාජධානිය රජුගේ පාලනයට යටත් විය රාජ්යත්වයට සම්බන්ධ වූ කැප කිරීමේ උත්සව සහ පිළිවෙත් ක්රමයන් ආරම්භ වූයේ දේවානම්පිය තිස්ස රජු සමයේදීය එය එලෙස සිදු වූයේ ඉන්දියාවේ අශෝක රජුගෙන් ලැබූ ආභාශය හේතු කොට ගෙනය දුටුගැමුණු රජු විසින් ප්රථම වරට මුළු රටම තමන් යටතට පත් කොටගෙන රට එක්සේසත් කරන ලදී ඔටුන්නේ හිමිකාරිත්වයෙහි අනුපිළිවෙල සිදුවූයේ පිය පරම්පරාවට අනුකූලවය එය සිදු කළ නොහැකි අවස්තාවකදී පෙර රජුගේ වැඩිමහල් සහෝදරයාට ඔටුන්නේ හිමිකාරිත්වය උරුමයෙන් ලැබුණි සහෝදරයන් නොසිටියේ නම් වැඩිමහල් පුත්රයා හට ඔටුන්න උරුම විය අනුරාධපුර රාජධානියේ ආරම්භයේ සිට පාලකයෝ සතර දෙනෙකු රාජ්යය පලනය කරන ලදහ විජයගෙන් ආරම්භ කොට සුභරාජ දක්වා සිටි පාලකයන් සාමාන්යයෙන් හැඳින්වූයේ විජයන් රජ පෙළපතට අයත් අය ලෙසයි මෙම රජ පෙළපතට අයත් වූ පණ්ඩුකාභය අනුරාධපුර රාජධානියේ ප්රථම පාලකයා විය රුවන්වැලිසෑය අසල පිහිටුවා ඇති දුටුගැමුණු ප්රතිමාව ළඹකන්න වංශයට අයත් වසභ විසින් බලය පැහැර ගන්නා තුරු විජයන් පෙළපත පැවතුණි වසභ විසින් ඔටුන්න හිමි කර ගැනීමත් සමඟ ළඹකන්න රජ පෙළපත ආරම්භ වූ අතර එම පෙලපතට අයත් පාලකයන් සියවස් තුනකට වඩා වැඩි කාලයක් රට පාලනය කරන ලදහ නව රජ පෙළපතක් ආරම්භ වූයේ දී ධාතුසේන කාලයේදීය එය මූරිය රජ පෙළපත විය ඇතැම් ඉතිහාසඥයන් විසින් මෙම රජ පෙළපතෙහි ආරම්භය ශාඛ්ය රජු ලෙස හැඳින්වූවත් ආරම්භක රජු තවමත් අවිනිශ්චිතය අනුරාධපුර යුගයේ පැවති අවසාන රජ පෙළපත වූයේ දෙවන ළඹකන්න රජ පෙළපතයි එය මානවම්මගෙන් ආරම්භ වූ අතර අනුරාධපුර රාජධානියේ අවසාන පාලකයා වූ වන මහින්ද දක්වා පැවතුනි අනුරාධපුර රජකම් කර රජවරු අනුරාධපුර රජකම් කර රජවරු විවිධ වු යුගයන්වලට අයත් වුවෝ විය පහත දැක්වෙන්නේ එම යුගයන් ය පණ්ඩුකාභය රාජ වංශ යුගය පණ්ඩුකාභය රජ මුඨසිව රජ පණ්ඩුකාභය රජගේ පුත් තිස්ස රජ දේවානම්පිය තිස්ස රජ උත්තිය රජ මහාසිව රජ සූරතිස්ස රජ චෝල යුගය චෝල යුගය රජරට රාජධානිය ආක්රමණක චෝල සේන හා ගුත්තික අශ්වාචාරි අසේල රජ දේවානම්පිය තිස්ස බාල සොයුරු ආක්රමණක චෝල එළාර රජ චෝල යුගය මායා කැළණි රාජධානිය කැළණි තිස්ස රජ චෝල යුගය රුහුණු රාජධානිය කාවන්තිස්ස රජ පණ්ඩුකාභය රාජවංශ යුගය සිංහලේ රාජධානිය දුටුගැමුණු රජු සද්ධාතිස්ස සැඳෑතිස් තුලත්ථන ලංජතිස්ස ලැමිණිතිස් බල්ලාඨනාග වළගම්බා රජු වට්ටගාමිණී අභය වලගම් අබා ආක්රමණක පංච ද්රවිඩයන් පුලහත්ථ බාහිය පනයමාර පිළයමාර දාඨිය වළගම්බා රජු යළි රජවීම මහවුලිතිස්ස චෝරනාග තිස්ස කුඩාතිස්ස සිව වටුක දාරුභාතික තිස්ස තිලිය පුරෝහිත බමුණා අනුලා රැජින කූඨකණ්ණ තිස්ස භාතික අභය මහාදාථික මහානාග ආමන්ද ගාමිණී අභය කණිරජානු තිස්ස චූලාභය සීවලී රැජින අරාජික සමය ඉලනාග චණ්ඩමුඛසීව යසලාලක තිස්ස සුබ රජ සභ සුභ ලම්බකර්ණ රාජ වංශය වසභ රජ වංකනාථතිස්ස ගජබාහුක ගාමිණී වන ගජබාහු රජ මහල්ලකනාග භාතික තිස්ස කනිට්ඨතිස්ස බුජ්ජනාග කුංචනාග වන සිරිනාග වෝහාරිකතිස්ස වෙහෙරතිස්ස අභයනාග වන සිරිනාග විජය කුමාර වන සංඝතිස්ස සිරිසංගබෝධි දැහැමි සිරිසඟබෝ ගෝඨාභය ගොළු අබා වන ජෙට්ඨතිස්ස මහාසේන මහසෙන් සිරි මේඝවණ්ණ කිත්සිරිමෙවන් වන ජෙට්ඨතිස්ස බුද්ධදාස රජ වන උපතිස්ස මහානාම වට්ටගාහජන්තු මිත්තසේන මිත්සෙන් ෂඩ් ද්රවිඩයන් පණ්ඩු පාරින්ද ඛුද්ධ පාරින්ද තිරිතර දාඨිය පීඨිය මෞර්ය රාජ වංශය ධාතුසේන රජු වන කස්සප සීගිරි කසුබු සීගිරි බලකොටුව සට රට පාලනය කලේය මොග්ගල්ලාන මුගලන් කුමාර ධාතුසේන කුමාරදාස කුමාරදාස් කිත්තිසේන සිව වන උපතිස්ස සීලාකාර අම්බ සාමනේර දාඨාපභූති දාපලුසෙන් වන මොග්ගල්ලාන කිත්සිරිමේඝ කුඩා කිත්සිරිමෙවන් මහානාග වන අග්ගබෝධි අක්බෝ වන අග්ගබෝධි කුඩා අක්බෝ වන සංඝතිස්ස වන මොග්ගල්ලාන සීලාමේඝවණ්ණ වන අග්ගබෝධි සිරිසංඝබෝධි වන ජෙට්ඨතිස්ස වන අග්ගබෝධි යළි රජවීම දාඨෝපතිස්ස වන කස්සප වන දප්පුලු හත්ථදාඨ වන අග්ගබෝධි දට්ට වන හත්ථදාඨ ලම්බකර්ණ මානවම්ම රාජ වංශය මානවම්මරජ වන අග්ගබෝධි වන කස්සප වන මහින්ද වන අග්ගබෝධි වන අග්ගබෝධි වන මහින්ද වන උදය වන මහින්ද වන අග්ගබෝධි වන දප්පලු වන අග්ගබෝධි වන සේන වනසේන වන උදය වන කස්සප වන කස්සප වන දප්පුලු වන දප්පුල වන උදය වන සේන වන උදය වන සේන වන මහින්ද වන සේන වන මහින්ද රජ මිහිදු ක්රි ව මහා මෙිඝ උද්යානය ගොඩනැගිම අනුරාධපුරය නගරය ගොඩනැගිමට මුල් වුයේ පණ්ඩුකාභය රජතුමා විසිනි එය අගනගරය ලෙසට තවදුරටත් පවත්වාගෙන යනලද්දේ ඔහුගේ පුත් මුටසිව විසිනි ඔහු රාජ්යත්වයට පත් වුයේ බුද්ධ පරිනිර්වාවසර කට පසුව ය ඔහු විසින් මහා මෙිඝ විනෝද උද්යානය සකසනු ලැබිය මෙිකි උද්යානය මල් සහ ඵල සහිත සියලු ආකාරයේ වෘකෂයන්ලගන් පිරි අලංකාරව පැවතුනි උද්යානය ගොඩනගන කල්හි මහා වර්ෂාපතනයක් ඇදහැලුන බැවින් මහා ධාරානිපාත වර්ෂාව යන අර්තය සිංහල භාෂාවෙන් මහා මෙිඝ යන නමි ලැබුණි වර්ග සැතපුමි ගණනාවක විහිදුන මෙයපිහිටා තිබුනේ නගර සිමාවෙන් පිටත දකුණු භාගයෙහිය මෙකි උද්යානයේ පිහිටිම ගැන මහින්දාගමනයේ පවා ප්රකට වි ඇත එමෙන්ම දෙවනමිපියතිස්ස රජු කල උද්යානයෙහි විවිධආගමිික පුජාවන් පවත්වන ලදි අනුරාධපුර ඉතිහාසය සමග බැදි පවතින මල්වතු ඔය හෙවත් කදමිභ නදිය අනුරාධපුරයට පැමිනෙණ සියලු දෙනා විසින් දැක බලා ගන්නා මහත් ප්රසිද්දියට පත් නදියකි එය මුලින්ම හදුන්වන ලද්දේ කදමිභ නදී යන නාමයෙන් ය උද්යානයට සමිපව පිහිටා ඇති බැවින් එය මල්වතු ඔය මෙවත් මල් වත්තඔය යන නමින් හැදින්විය මෙය පිහිටා ඇත්තේ් උද්යානයේ නැගෙනහිර සිමාවෙහි ය උපුටා ගැන්ම අනුරපුරයේ අටමස්ථාන වැඩිම කාලයක් මෙරට අගනුවර ලෙස යොදාගත් නගරය වන්නේ ඓතිහාසික අනුරාධපුරවරයයි ඒ හේතුව නිසාවෙන්ම ඉතිහාසය පුරා විද්යාව මෙන්ම බෞද්ධාගමික සාධක සහ නටඹුන් අතින්ද අනුරාධපුරය සෙසු රාජධානි පැවතුනු නගර වලට වඩා පොහොසත්ය දෙවන පෑ තිස් රජ දවස භාරත දේශයේ සිට මිහිඳු මා හිමි මෙරටට බෞද්ධ ධර්මය ගෙන ආ දින පටන් මෙරට පාලකයෝ ස්වකීය ජනතාවට වන්දනාමාන කිරීමටත් තමන්ගේ පින් වැඩිකරගැනීමත් අරමුණු කරගෙන වෙහෙර විහාර ඉදිකරන ලදී ඒ අතරින් අතීතයේ පටන් බෞද්ධයන්ගේ අපරිමාන ගෞරවයට ලක් වූ සිද්ධස්ථාන අටක් අනුරපුර පුදබිම අවට පිහිටා ඇත අටමස්ථාන නමින් හඳුන්වනු ලබන මෙම ස්ථාන පිළිබඳ කෙටි හැඳින්වීමක් මෙම ලිපිය තුළින් කිරිම අපගේ අරමුණයි ලොක උරුමයක් වන අනුරාධපුරයේ වන්දනා චාරිකාවක් යන්නට අදහස් කරන කාට වුවද තමන් යන ගමන පිළිබඳ යම් අදහසක් මෙම ලිපිය තුළින් ගත හැකිය යන්න අපගේ අදහසයි අටමස්ථාන අතර මුල් තැන හිමිවන්නේ ගෞතම බුදුන්ට බුද්ධත්වය ලබාගැනීමේදී සෙවන දුන් ජයසිරිමහා බෝධීන් වහන්සේටයි ඉන්දියාවේ පිහිටි බෝධීන් වහන්සේගේ ශාකාවක් වන මෙය දැනට ලොව පවතින පැරණිතම වෘක්ෂයක් ලෙසද සැලකේ පොළව මට්ටමෙන් අඩි ක් පමණ ඉහලින් වන බොධිඝරයක රෝපණය කර ඇති මෙම බෝ වෘක්ෂය දැනට ඇති බැතිමතුන්ගේ වන්දනාමානයට ලක්වන පැරණිතම වෘක්ෂයද වන්නේය උඩ මළුවේ රෝපිත මෙම බොධියෙන් හටගත් අංකූර ශාකා අෂ්ඨ පල බෝධීන් ලෙසින් හැඳින්වෙන අතර ඒවා රටේ සිවි දිග බෞද්ධ සිද්ධස්ථාන වල අතීත රජවරුන් විසින් රෝපණය කර ඇත අතීතයේ වන සිව්පාවුන්ගෙන් මෙම බෝධියට සිදුවන හානි වලක්වා ගැනීමට වෙනමම කැපවූ පිරිසක් මෙම අවට ගිණිමැල ආදිය දල්වාගෙන මුරකාවල් යොදා සිට ඇත දකුණු ඉන්දීය පාලකයන්ගේ සමයන්හිදී පවා මෙම වෘක්ෂයට කිසිදු හානියක් සිදුකළ බවට වාර්තා වී නැත උඩමළුවේ සිට බැලූ මානයේ පිහිටා ඇති ස්වේත වර්ණ මහා දාගැබ අටමස්ථානයන් හි තවත් එක් වටිනා සිද්ධස්ථානයකි දුටුගැමුණු රජුන් විසින් ඉදිකරන්නට යෙදුනු මෙම මහා දාගැබ ස්වර්ණමාලී මහා සෑයයි රුවන්වැලි සෑය නමින්ද හඳුන්වනු ලබන මෙය මීටර ක් පමණ උසට ඉදිකර ඇති බුබ්බුලාකාර ස්වරූපයේ චෛත්යයකි ලක්දිව එක්සේසත් කිරීමෙන් අනතුරුව නිර්මාණය ඇරඹී මෙම මහා සෑයේ අවසානය සියැසින් දැක ගැනීමට මෙයට මූලිකත්වය දුන් දුටුගැමුණු රජුට හැකියාව ලැබී නැත එබැවින් මරණාසන්න රජු මෙම සෑය අබියසට රැගෙන විත් එය නිර්මාණය කර ඇති වග පෙන්වීමට උණ බම්බු සහ සුදු රෙදි ඔතා තාවකාලිකව නිම කරන ලද චෛත්යය රජුට පෙන්වීමට ඔහුගේ සොයුරු කටයුතු කර ඇති බව පුරාවෘත්ත වල සඳහන් වෙයි රුවන්වැලි සෑය පෙනෙන මානයේ පිහිටා ඇති ගල් කුළු රැසකට මැදි වූ කුඩා චෛත්යය ථූපාරාමයයි මිහිඳු හිමියන්ගේ සමයේම ඉදිවූ මෙය ලක්දිව මුල්ම චෛත්යය ද වන්නේය දේවානම් පියතිස්ස රජුන් විසින් කරවූ මෙහි මුල් හැඩය ධාන්යාකාර වූ බව පුරාවිද්යා මතයයි ස්ථූපයක් මැදිකොට තැනූ ආරාමය යන අරුත මෙයට ලබා දී ඇත මෙහි උස මීටර ක් පමණ වෙයි ගල් කුළු මත ඉදිකරන ලද දැවමය වහලයකින් ආවරණය ලද මෙවැනි ස්ථුප වටදාගෙය නමින් හඳුන්වනු ලැබේ දුටුගැමුණු රජු විසින් අදින් වසර දෙදහසකට පමණ පෙර ඉදිකරන ලද සංඝාවාසයක් උඩමළුවටත් රුවන්වැලි මහා සෑයටත් අතරේ පිහිටා ඇත අටමස්ථාන අතර තවත් එක් වැදගත් ස්ථානයක් වන මෙය ලෝවාමහාපායයි දැනට ඉතිරිව ඇත්තේ ගල් කණු ක් පමණ වුවත් එදා හෙළ රජ දවස මහා සංඝරත්නය දහසකටත් වඩා නවාතැන් පහසුකම් සැලසූ මහල් නවයකින් යුතු සුවිසල් ගොඩනැගිල්ලක්ව පැවතුණු මෙම සිද්ධස්ථානයේ වහලය පිත්තලෙන් නිර්මාණය කර තිබූ බවට මතයක් පවතී මුල් යුගයේ ජේතවනාරාමය ලෙසින් හඳුනාගනු ලැබූවද පසුකාලීනව අභයගිරිය ලෙසින් ස්ථිර කරගත් මහා සෑය අටමස්ථානයේ තවත් එක් වැදගත් ස්ථානයකි දැනට ගරාවැටී ඇති නමුත් සංස්කරනයන් සිදුවෙමින් පවතින මෙය එදා මෙරට බෞද්ධාගමික මධ්යස්ථාන අතර මුල්තැන ගත් විහාරාරාම සංකීරණයක්ව පැවත ඇත මෙය වළගම්බා රජුගේ ඉදිකිරීමකි එවකට සංඝයා වහන්සේ ක් පමණ මෙහි වැඩවිසූබව සඳහන්ය සොලී පහරදීම් හමුවේ පලායමින් සිටි වලගම්බා රජුට මහා කලු සිංහලයා පලා යනවා යැයි කියමින් නින්දා කල ගිරි නම් ජෛන පූජකයෙක් මෙහි විසූ බවත් රජු නැවත රජවූ පසු ගිරි පලවා හැර තමාට සැඟවී සිටි සමයේ උදව් උපකාර කල හිමි නමකට මෙම විහාරය කරවා පූජාකල බවත් සඳහන්ය දැනට සංරක්ෂණය කර ඇති අභයගිරිය තරමේම තවත් එක් මහා සෑයකි ජේතවනාරාමය අටමස්ථාන අතර තවත් එක් වැදගත් ස්ථානයක් වන මෙය මහසෙන් රජ සමයේ ඉදිකරනු ලැබ ඇත දැනට මෙය උසින් මීටර ක් පමණ වන නමුත් එය එවකට මීටර ක් පමණ වන්නට ඇති බව පුරාවිද්යා මතයයි මෙය ලොව තෙවැනි උසම ඓතිහාසික ඉදිකිරීමද වන්නේය වර්ෂ එක්දහස් නවසීයේදී පමණ ලියැවී ඇති බිතාන්ය කෘතියක සඳහන්ව ඇත්තේ මෙම දාගැබේ වූ ගඩොල් වලින් ලන්ඩන් නුවර සිට එඩින්බර්ග් දක්වා මීටර තුනක පමණ සෘජු බැම්මක් ඉදිකලහැකි බවයි මෙය එවකට සංඝයා වහන්සේලා කට පමණ නවාතැන් පහසුකම් සැලසූ බව සඳහන්ය එළාර රජු පරදා ලක්දිව එක්සේසත් කල දුටුගැමුණු රජු තිසාවැව අසබඩ තමන්ගේ ජය කොන්තය නිදන්කර නිර්මාණය කරන ලද දාගැබ මිරිසවැටියයි තිසාවැවත් බසවක්කුලම වැවත් යා කරන මාවත පසෙකින් පිහිටා ඇති අටමස්ථාන අතර තවත් එක් සිද්ධස්ථානයක් වන මෙහි පසෙකින් බිතාන්ය පාලන සමයේ ඉදිකරන ලද සිර මැදිරි සංකීරණයේ කොටසක් දැකගත හැකිය එවකට වැරදි කරුවන් එල්ලා මැරීමද මෙම ස්ථානයේ සිදුකර ඇත සංඝයා වහන්සේට නොපිළිගන්වා කිසිත් අනුභව නොකල දුටුගැමුණු රජු අතපසුවීමකින් සංඝයා වහන්සේට නොදී මිරිස් මාළුවක් ආහාරයට ගත් හෙයින් ඒ වැරැද්ද හදාගැනීම අරමුණුකර මෙය නිර්මාණය කලබවජන වහරේ මෙන්ම අතීත පොත්පත් වලද සඳහන්ව ඇත අටමස්ථාන අතර අවසන් සිද්ධස්ථානය ලංකාරාමයයි මෙය වළගම්බා නිරිඳුන්ගේ නිර්මාණයකි මේ පිළිබඳව සඳහන් වන ඓතිහාසික තොරතුරු අවම වන අතර දැනට ඉතිරිව පවතින ගල්කණු දෙස බැලීමේදී මෙයද අනිවාර්යයයෙන්ම ථුපාරාමයේ මෙන් වටදාගයකින් ආවරණය වී තිබෙන්නට ඇති බව අනුමාන කල හැකිය අනුරාධපුර රාජධානියේ අවසානය දිගින් දිගටම වූ දකුණු ඉන්දීය ආක්රමණ වලින් තැවුණු නගරය අවසානයේදී ක්රි ව දී අතහැර දැමිණ මෙම මහා නගරය ක්රි පූ වන සියවසයෙහි සිට ක්රි ව දක්වා ලංකාවේ අඟනගරය ලෙස පැවතුනි එහි පසුබැස්ම ඇරඹියේ දකුණි ඉන්දීය ආක්රමණයන්ට එරෙහිව දිගින් දිගටම වූ යුද වැදීම නිසා රාජධානිය ආර්ථිකමය අතින් දුප්පත් වීමය ක්රි ව දී චෝල අක්රමණික හමුදාව අනුරාධපුරය අතහැර ඊට සාපේක්ෂව ආරක්ෂිත පොළොන්නරුවට පරිපාලන නගරය ගෙන ගියේය නගරයට සහ එහි වූ වාරී සංකීරණයට වූ අති මහත් විනාශය හේතුවෙන් එය සම්පූර්ණයෙන්ම අතහැර අවුරුදු දහසකට ආසන්න කාලයක් ජරාවාස වන්නට හැරුණි පසුව වන සතවසරේදී බ්රිතාන්ය පරිපාලනය විසින් කැළෑ හෙළි කර නැවත ජනාවාස ඇති කෙරිණි",
        "ශ්රී ලංකාවෙි ප්රථම රාජධානිය වශයෙන් වසර සියයකටත් අධික කාලයක් පැවති අනුරාධපුර රාජධානිය වාස්තු විද්යාත්මක වශයෙන් ඉතාමත් වැදගත් ස්ථානයකට හිමිකමි දැරිය කෙසේ වෙතත් බොහෝ දෙනෙකු වටහා නොගත් සත්ය නමි පුරාතන යුගයේ දි එකිනෙකට වෙනස් වු නගර දෙකක් පැවතිය බවය එනමි අනුරාධපුරය නමි වු දේශපාලන අගනුවර සහ අනුරාධපුරය නමි වඅ පුජනිය නගරය යි අනුරාධපුරය නමි වු පුජනිය නගරය හා සමිබන්දව සත්ය වර්තාවන් ඉදිරිපත් කිරිමෙි දී ශත වර්ෂ විසි දෙකක් පුරා බෞද්ධ ලෝකය විසින් පුජනීයත්වයෙන් සලකන ලද නගරයක් ලෙස දැක්විමට පිළිවණ රජරට රාජධානිය වත්මන් ශ්රි ලංකාව පිහිටි භූමියේ ප්රථම සංවිධානාත්මක නවීන රාජධානිය වුයේ රජරට රාජධානියයි අනුරාධපුර රාජධානියේ ආරම්හක පාලකයා වූ පණ්ඩුකාහය රජු විසින් අනුරාධපුර නගරය සංවර්ධනය කරන ලදී රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්රධාන කාර්යයක් විය බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය මෙම ඉදිකිරීම් නිසා අනුරාධපුර යුගය මුළුල්ලේම රජරට ප්රදේශය තුළ විශාල එමෙන්ම සංකීර්ණ වාරිමාර්ග පද්ධතියක් බිහි විය රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්රධාන කාර්යයක් විය බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය මෙම ඉදිකිරීම් නිසා අනුරාධපුර යුගය මුළුල්ලේම රජරට ප්රදේශය තුළ විශාල එමෙන්ම සංකීර්ණ වාරිමාර්ග පද්ධතියක් බිහි විය එකල ඉදි කරන ලද මහා ස්ථුපයන් වූ රුවන්වැලිසෑය ජේතවණාරාමය මෙන්ම ලෝවාමහාපාය වැනි විශාල ගොඩනැගිලි මඟින් අනුරාධපුර යුගයේ තිබූ ගෘහ නිර්මාණ ශිල්පයේ දියුණුව මනාව පෙන්නුම් කරයි උපතිස්සනුවර අනුරාධපුර නගරය ඓතිහාසික මූලාශ්රයන්හි සඳහන් වන පරිදි අනුරාධපුර නගරය ආරම්භ වී ඇත්තේ ක්රි පූ සියවෙසහි වුවත් පුරාවිද්යාත්මක තොරතුරු අනුව එහි ඉතිහාසය ක්රි පූ වැනි සියවස තරම් ඈතට දිව යයි කරන ලද පුරා විද්යා කැණීම් වලදී වඩා පූර්ව කාලයන්හි විසූ ජනයා සම්බන්ධ සාක්ෂි ලැබී ඇතත් ක්රි පූ සියවසට එපිට කාලය පිළිබද තොරතුරු අත්ෙත් මද වශෙයනි අනුරාධපුරෙය් වැඩිදුර සිදු කරන ලද කැණීම් වලදී මෙම පුරවරෙය් පැවති ප්රාග් ඓතිහාසික ජනාවාසයන් පිළිබද තොරතුරු ලැබී ඇත ක්රි පූ දක්වා විහිදුණ ප්රාග් ඓතිහාසික ලෝහ යුගෙය්දී ලෝහ තාක්ෂණය කුඹල් කර්මාන්තය අහ්වයන් භාවිතය ගවයන් ඇති කිරීම සහ වී වගාවද පැවතුණ බව පෙනී යයි ක්රි පූ අතර කාලයේදී අනුරාධපුරයේ ජනාවාසය හෙක්ටයාර් ඉක්මවා වර්ධනය විය නගරය ඊසාන දිගින් සහ වයඹ දිගින් පිහිටි ප්රධාන වරායයන් අතර උපායමාර්ගිකව වැදගත් වන පරිදි පිහිටියේය වගා කළ හැකි සරු බිම් එය වටෙකාට පිහිටා තිබුණි ආක්රමණිකයන්ගෙන් නගරය ආරක්ෂා කළ ස්වභාවික පවුරක් වූ ඝන වනාන්තරය නගරය හාත්පස අවුරා විය ක්රි පූ සියවසෙහිදී පණ්ඩුකාභය රජතුමන් විසින් අනුරාධපුරය අගනගරය බවට පත් කරන ලද බවත් මනා සංවිධිත සැලසුමක් අනුව නගරය සහ එහි උප නගරයන්ද පිහිටුවන ලද බවත් කියැවේ අභය වාපි හෙවත් අභය වැවද එතුමන් විසින් කරවන ලදී කාලවේල සහ චිත්තරාජ නමැති යක්ෂයන් උදෙසා දෙවොල්ද කරවනු ලැබීය චේතියා නමැති යක්ෂණිය උදෙසා වෙළඹකගේ ස්වරූපයෙන් වූ පිළිරුවක් රාජ මාළිග පරිශ්රයේම ඉදි කරවන ලද අතර මේ සියළු යක්ෂ දේවතාවන් උදෙසා වාර්ෂිකව පුද පූජා පැවැත්වීමද සිදු විය නගරයේ සුසාන භූමිය වදක භූමිය පශ්චිම රාජිණියගේ දෙවොල වෙස්සවණ උදෙසා වූ නුග රුක ව්යාධදේව උදෙසා වූ තල් රුක යෝනයන් සඳහා වාස භූමිය ආත්ම පූජා මන්දිරය ආදිය පිහිටැවිය යුතු තැන්ද මෙතුමන් විසින් නියම කරන ලදී වහලුන් නොහොත් චණ්ඩාලයන් විසින් කළ යුතු කාර්යයන් නියම කෙරුණු අතර ඔවුන් උදෙසා ග්රාමයක් වෙන් කරන ලදී නිඝණ්ටයන් තැන තැන සරන තවුසන් ආජීවකයන් සහ බ්රාහ්මණයන් උදෙසා වාසස්ථාන ගොඩ නඟන ලදී ග්රාම සීමාද නීර්ණය කරනු ලැබීය අනුරාධපුරය අග නගරය බවට පත් කරමින් ක්රි පූ සියවස තරම් ඈත යුගයකදී පණ්ඩුකාභය රජතුමන් විසින් බිහි කරනු ලැබූ සම්ප්රදාය ඉතා වැදගත් වේ නගරයට සහ පූජනීය ස්ථානයන්ට කරනු ලැබූ සනීපාරක්ෂක සහ පරිපාලනමය සම්පාදනයන් විසින් පෙන්නුම් කෙරෙනුයේ කාලාන්තරයක් තිසිසේ නගරය කිසියම් මධ්යගත සැලැස්මකට අනුව සංවර්ධනය කෙරුණු බවය පණ්ඩුකාභය රජතුමන්ගේ ඇවෑමෙන් එතුමන්ගේ පුත් මුටසීව රාජපදප්රාප්ත විය හැට වසරක් වූ එතුමන්ගේ රාජ්ය පාලන කාලය තුළ අනුරාධපුර නගරය තවදුරටත් අගනුවර වශයෙන් පවත්වා ගත් අතර බුදු සමය දිවයිනට හඳුන්වා දෙනු ලැබූ මුල් අවදියේදී වැදගත් කාර්යභාරයක් ඉටු කරනු ලැබූ මහාමේඝවන උද්යානය හෙවත් මහමෙවුනා උයන පිහිටුවාලීමද එසමයෙහි සිදුවිය බුදු රජාණන් වහන්සේගේ පිරිනිවන් පෑමෙන් වසර කට පසු ශ්රී ලංකාවට බුදු සමය හඳුන්වාදෙන ලද්දේ මුටසීව රජතුමන්ගේ ඇවැමෙන් රාජ්යත්වයට පත් එතුමන් පුත් දේවානම්පියතිස්ස රාජ්ය සමයෙහිදීය ඉන්දියාවෙහි වුසූ අශෝක අධිරාජයා දේවානම්පියතිස්ස රජතුමන්ගේ සමකාලීනයෙක් විය මෙම කාලය ක්රි පූ අතර කාලයයි ලංකාවෙහි රාජ්යත්වයෙහි ආරම්භය සහ ආසියාවෙහි විශිෂ්ඨතම ආගමක් වූ බුද්ධ ධර්මය මත පදනම් වූ ශිෂ්ඨාචාරයක ආරම්භයද සනිටුහන් කෙරෙන්නේ මෙසමයෙහිය බුද්ධාගමේ ආගමනය ශ්රි මහ බෝධි පරිශ්රයෙහි වැඩ වසන ශාඛා බෝධීන් වහන්සේ නමක් දේවානම්පියතිස්ස රාජ්ය කාලයේදී බුදු දහම හඳුවාදිමත් සමඟ ලංකාවේ සමාජීය හා සංස්කෘතික වශයෙන් වෙනස්වීම් සිදුවිය එම වෙනස්වීම් තවදුරටත් වර්ධනය වූයේ බුදුන් වහන්සේගේ දන්ත ධාතුව ලංකාවට වැඩම කරවීමත් සමඟය මූලික වශයෙන් අනුරාධපුර යුගයේ සංස්කෘතිය පදනම් වූයේ බුදුදහම මතය එසේම එම රාජධානියේ නීතිය සහ පාලනය සඳහාද බුදුදහම මඟින් ඉමහත් බලපෑමක් එල්ල විය ක්රි පූ වැනි සියවසෙහි ශ්රි මහ බෝධිය ශ්රි ලංකාවට ගෙන එන ලද්දේ අශෝක අධිරාජයාගේ දියණිය වන සංඝමිත්තා මෙහෙණිය විසිනි ඇය ශ්රි ලංකා භික්ෂූණී ශාසනය පිහිටුවීමේ ලා පුරෝගාමී වූවාය ක්රි පූ දේවානම්පියතිස්ස රජතුමා විසින් අනුරාධපුර මහ මෙව්නා උයනෙහි මෙම ජය සිරි මහ බෝධිය සිටුවන ලදී බුදු දහමේ හඳුන්වා දීමත් සමඟම මෙම නුවර විසල් කැපීපෙනීමක් ලැබුවාක් මෙන්ම මහා ඉඳිකිරීම් යුගයක් ද ඇරඹුනි මහා වංශය පවසන්නේ කුටකන්න තිස්ස රජු විසින් රියන් හතක් උස තාප්පයක් ජල අගලක් ඉදිරියෙන් පවතින පරිදි පලමු තාප්පය ඉදිකළ බවයි පසුව වසභ රජු විසින් මෙය රියන් සිට රියන් දක්වා උස්කොට තවදුරටත් බලවත් කරන ලදි එසේම රජු විසින් ශක්තිමත් දොරටු නිවස්න වාසල් කඩ ඉදි කර ඇති අතර ඒවායෙහි නටබුන් අදද දැකිය හැක මහා වංශය තව දුරටත් පවසන්නේ ඉදිකිරීම් හිදී නිමිති කියන්නන් සහ වාස්තු විදුවන් ගේ උපදෙස් ලැබූ බවය පූජනීය දන්ත ධාතුවේ සම්ප්රාප්තිය කිත්සිරිමෙවන් රජ සමයේදී හේමමාලා කුමරිය සහ දන්ත කුමරු විසින් බුදුන් වහන්සේගේ දන්ත ධාතුව ලංකාවට වැඩම කරවන ලදී එම රජු විසින් දන්ත ධාතුව පෙරහැරකින් වඩම්මවා මන්දිරයක තැන්පත් කරන ලදී මෙම පෙරහැර වාර්ශිකව පවත්වන ලෙස රජු අණ කල අතර අදටත් එය චාරිත්රයක් ලෙස රටෙහි පවතී බුදුන් වහන්සේගේ දන්ත ධාතුව ඉතා ඉක්මනින්ම රටෙහි පූජනීය වස්තුවක් මෙන්ම රජ්ය භාවය තහවුරු කරන සංකේතයක් බවට පත් විය දන්ත ධාතුව ළඟ තබා ගන්නා පුද්ගලයා රටෙහි නියම පාලකයා විය එමනිසා බොහෝ විට එය රජ මාළිගාවෙහිම නිදන් කොට තබන ලදී වැසි ජල කලමණාකරන තාක්ෂණය රජරට රාජධානියේ ප්රධානතම ජයග්රහණය වූයේ වැසි ජලය මනාව කලමණාකරන කලහැකි වාරිමාර්ග බිහිවීමයි ඒ හේතුවෙන් වියළි කලාපයේ කෘෂිකාර්මික අවශ්යතාවන් සඳහා ජලය සැපයීම සිදු විය මෙම වාරිමාර්ග ඉදිකිරීම් මඟින් එම යුගයේ මිනිසුන් තුළ තිබූ උසස් තාක්ෂණික හා ඉංජිනේරු හැකියාවන් මනාව පිළිඹිබු කරයි සමකාලීන රාජධානි දේවානම්පිය තිස්ස රජ ගේ සොහොයුරු මහානාග කුමරු විසින් රජරට රාජධානියෙන් ස්වාධීන රුහුණු රාජධානිය පිහිටුවාගන්නා ලදී රජරට රාජධානිය ආක්රමණියන් අතට පත් බෝහෝ අවස්ථාවලදී රුහුණු රාජධානිය බලය රැකගැනීමට ස්වදේශික සිංහලයන් සමත්විය ආක්රමණයන් රජරට රාජධානියට අඛණ්ඩව පැවතුණු තර්ජනයක් වූයේ දකුණු ඉන්දීය ආක්රමණයන්ය එලෙස සිදු වූ ආක්රමණයන්ගෙන් සතුරන් පරදවා රජධානියේ පාලනය නැවත ලබාගත් දුටුගමුණු වළගම්භා ධාතුසේන වන විජයබාහු ලීලාවතී වැනි පාලකයන් කාගේත් අවධානයට ලක්විය අනෙකුත් පාලකයන් මතකයේ රැඳුනේ ඔවුන් විසින් සිදු කරන ලද හමුදා ජයග්රහණ නිසාය දකුණු ඉන්දියාවට එරෙහිව ආක්රමණයන් දියත් කළ පළවන ගජභාහු පන්ධ්යන් දේවියට පිහිට වීමට තම හමුදාවන් යැවූ දෙවන සේන එවැනි පාලකයන්ය රජරට රාජධානියට එරෙහිව ආක්රමණයන් කිහිපයක් සිදුවූ අතර ඒවා සියල්ලක්ම දියත් කරන ලද්දේ දකුණු ඉන්දියාණුවන් විසිණි ශ්රී ලංකා ඉතිහාසයේ පළමු වාර්තාගත ආක්රමණය සිදුවූයේ සූරතිස්ස ක්රි පූ රජු සමයේදීය එය සිදු කරන ලද්දේ සේන හා ගුත්තික යන දකුණු ඉන්දීය අශ්ව වෙළෙන්දන් දෙදෙනෙකු විසිනි අවුරුදු විසිදෙකක පාලන කාලයෙන් අනතුරුව අසේල ක්රි පූ විසින් ඔවුන් පරජය කරන ලදී ඉන් අනතුරුව පැවති තවත් ආක්රමණයක් හේතුවෙන් චෝළ රජකු වූ එලාර ක්රි පූ අසේල රජු පරදවා රටෙහි පාලකයා බවට පත් විය එලාර අවුරුදු ක් රට පාලනය කළ අතර ඔහුව පරජයට පත් කරන ලද්දේ දුටුගැමුණු විසිනි කෙසේ නමුත් මහාවංශ වාර්තා වලට අනුවඑළාර විසින් රට යුක්තිගරුක ලෙස සහ සධාරණ ලෙස පාලනය කළ බව කියැවේ දකුණු ඉන්දියාව සහ ශ්රි ලංකාව ක්රි පූ දී ද්රවිඪ නායකයන් පස් දෙනෙකු වූ පිලහත්ත බාහිය පනයාමර පිලියාමර දතික විසින් රට නැවතත් ආක්රමණය කරන ලදී ඔවුන් ක්රි පූ දක්වා රට පාලනය කළ අතර වළගම්භා හට පරාජයට පත් විය පසුව ඇති වූ තවත් ආක්රමණයක් නිසා රටෙහි පාලනය දකුණු ඉන්දීය පාලකයන් සය දෙනෙකු වූ පණ්ඩු පාරින්ද තිරිතර දාතිය සහ පීතිය යටතට පත් විය ධාතුසේන විසින් ඔවුන් පරදවා නැවත බලය ලබා ගන්නා ලදී වන සේන සහ වන උදය රජ සමය තුළ දකුණු ඉන්දියාවෙන් බොහෝ ආක්රමණ සහ කොල්ලකෑම් එල්ල විය කෙසේ නමුත් මෙම ආක්රමණිකයන්ගෙන් කිසිවෙකු ඔවුන්ගේ පාලනය රටෙහි දකුණු ප්රදේශය වූ රුහුණ දක්වා දීර්ඝ කර නොගත්හ එබැවින් ශ්රී ලාංකීය පාලකයන් සහ උරුමක්කාරයන් ඔවුන්ගේ හමුදාවන් මෙම ප්රදේශය තුළ සංවිධානය කොට ගෙන ඔටුන්න නැවත ලබා ගැනීමට සමත් වූහ ශ්රී ලාංකීය ඉතිහාසය මුළුල්ලේම සතුරු ආක්රමණ වලින් රට බේරා ගත් අවස්තාවලදී රුහුණ මුල් වී ඉමහත් සේවයක් කරන ලදී පරිපාලනය රාජධානිය රජුගේ පාලනයට යටත් විය රාජ්යත්වයට සම්බන්ධ වූ කැප කිරීමේ උත්සව සහ පිළිවෙත් ක්රමයන් ආරම්භ වූයේ දේවානම්පිය තිස්ස රජු සමයේදීය එය එලෙස සිදු වූයේ ඉන්දියාවේ අශෝක රජුගෙන් ලැබූ ආභාශය හේතු කොට ගෙනය දුටුගැමුණු රජු විසින් ප්රථම වරට මුළු රටම තමන් යටතට පත් කොටගෙන රට එක්සේසත් කරන ලදී ඔටුන්නේ හිමිකාරිත්වයෙහි අනුපිළිවෙල සිදුවූයේ පිය පරම්පරාවට අනුකූලවය එය සිදු කළ නොහැකි අවස්තාවකදී පෙර රජුගේ වැඩිමහල් සහෝදරයාට ඔටුන්නේ හිමිකාරිත්වය උරුමයෙන් ලැබුණි සහෝදරයන් නොසිටියේ නම් වැඩිමහල් පුත්රයා හට ඔටුන්න උරුම විය අනුරාධපුර රාජධානියේ ආරම්භයේ සිට පාලකයෝ සතර දෙනෙකු රාජ්යය පලනය කරන ලදහ විජයගෙන් ආරම්භ කොට සුභරාජ දක්වා සිටි පාලකයන් සාමාන්යයෙන් හැඳින්වූයේ විජයන් රජ පෙළපතට අයත් අය ලෙසයි මෙම රජ පෙළපතට අයත් වූ පණ්ඩුකාභය අනුරාධපුර රාජධානියේ ප්රථම පාලකයා විය රුවන්වැලිසෑය අසල පිහිටුවා ඇති දුටුගැමුණු ප්රතිමාව ළඹකන්න වංශයට අයත් වසභ විසින් බලය පැහැර ගන්නා තුරු විජයන් පෙළපත පැවතුණි වසභ විසින් ඔටුන්න හිමි කර ගැනීමත් සමඟ ළඹකන්න රජ පෙළපත ආරම්භ වූ අතර එම පෙලපතට අයත් පාලකයන් සියවස් තුනකට වඩා වැඩි කාලයක් රට පාලනය කරන ලදහ නව රජ පෙළපතක් ආරම්භ වූයේ දී ධාතුසේන කාලයේදීය එය මූරිය රජ පෙළපත විය ඇතැම් ඉතිහාසඥයන් විසින් මෙම රජ පෙළපතෙහි ආරම්භය ශාඛ්ය රජු ලෙස හැඳින්වූවත් ආරම්භක රජු තවමත් අවිනිශ්චිතය අනුරාධපුර යුගයේ පැවති අවසාන රජ පෙළපත වූයේ දෙවන ළඹකන්න රජ පෙළපතයි එය මානවම්මගෙන් ආරම්භ වූ අතර අනුරාධපුර රාජධානියේ අවසාන පාලකයා වූ වන මහින්ද දක්වා පැවතුනි",
        "වත්මන් ශ්රි ලංකාව පිහිටි භූමියේ ප්රථම සංවිධානාත්මක නවීන රාජධානිය වුයේ රජරට රාජධානියයි අනුරාධපුර රාජධානියේ ආරම්හක පාලකයා වූ පණ්ඩුකාහය රජු විසින් අනුරාධපුර නගරය සංවර්ධනය කරන ලදී රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්රධාන කාර්යයක් විය බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය මෙම ඉදිකිරීම් නිසා අනුරාධපුර යුගය මුළුල්ලේම රජරට ප්රදේශය තුළ විශාල එමෙන්ම සංකීර්ණ වාරිමාර්ග පද්ධතියක් බිහි විය රාජධානියේ ආර්ථිකය පදනම් වූයේ කෘෂිකර්මාන්තය මත බැවින් වැව් සහ ඇළ මාර්ග ඉදිකිරීම රජුගේ ප්රධාන කාර්යයක් විය බොහෝමයක් රජවරුන් විශාල වැව් සහ ඇළ මාර්ග ඉදි කළ අතර ඒ අතරින් වැඩිමනක් මතකයේ රැඳෙන්නේ වසභ සහ මහාසේන රජවරුන්ය මෙම ඉදිකිරීම් නිසා අනුරාධපුර යුගය මුළුල්ලේම රජරට ප්රදේශය තුළ විශාල එමෙන්ම සංකීර්ණ වාරිමාර්ග පද්ධතියක් බිහි විය එකල ඉදි කරන ලද මහා ස්ථුපයන් වූ රුවන්වැලිසෑය ජේතවණාරාමය මෙන්ම ලෝවාමහාපාය වැනි විශාල ගොඩනැගිලි මඟින් අනුරාධපුර යුගයේ තිබූ ගෘහ නිර්මාණ ශිල්පයේ දියුණුව මනාව පෙන්නුම් කරයි",
        "ඓතිහාසික මූලාශ්රයන්හි සඳහන් වන පරිදි අනුරාධපුර නගරය ආරම්භ වී ඇත්තේ ක්රි පූ සියවෙසහි වුවත් පුරාවිද්යාත්මක තොරතුරු අනුව එහි ඉතිහාසය ක්රි පූ වැනි සියවස තරම් ඈතට දිව යයි කරන ලද පුරා විද්යා කැණීම් වලදී වඩා පූර්ව කාලයන්හි විසූ ජනයා සම්බන්ධ සාක්ෂි ලැබී ඇතත් ක්රි පූ සියවසට එපිට කාලය පිළිබද තොරතුරු අත්ෙත් මද වශෙයනි අනුරාධපුරෙය් වැඩිදුර සිදු කරන ලද කැණීම් වලදී මෙම පුරවරෙය් පැවති ප්රාග් ඓතිහාසික ජනාවාසයන් පිළිබද තොරතුරු ලැබී ඇත ක්රි පූ දක්වා විහිදුණ ප්රාග් ඓතිහාසික ලෝහ යුගෙය්දී ලෝහ තාක්ෂණය කුඹල් කර්මාන්තය අහ්වයන් භාවිතය ගවයන් ඇති කිරීම සහ වී වගාවද පැවතුණ බව පෙනී යයි ක්රි පූ අතර කාලයේදී අනුරාධපුරයේ ජනාවාසය හෙක්ටයාර් ඉක්මවා වර්ධනය විය නගරය ඊසාන දිගින් සහ වයඹ දිගින් පිහිටි ප්රධාන වරායයන් අතර උපායමාර්ගිකව වැදගත් වන පරිදි පිහිටියේය වගා කළ හැකි සරු බිම් එය වටෙකාට පිහිටා තිබුණි ආක්රමණිකයන්ගෙන් නගරය ආරක්ෂා කළ ස්වභාවික පවුරක් වූ ඝන වනාන්තරය නගරය හාත්පස අවුරා විය ක්රි පූ සියවසෙහිදී පණ්ඩුකාභය රජතුමන් විසින් අනුරාධපුරය අගනගරය බවට පත් කරන ලද බවත් මනා සංවිධිත සැලසුමක් අනුව නගරය සහ එහි උප නගරයන්ද පිහිටුවන ලද බවත් කියැවේ අභය වාපි හෙවත් අභය වැවද එතුමන් විසින් කරවන ලදී කාලවේල සහ චිත්තරාජ නමැති යක්ෂයන් උදෙසා දෙවොල්ද කරවනු ලැබීය චේතියා නමැති යක්ෂණිය උදෙසා වෙළඹකගේ ස්වරූපයෙන් වූ පිළිරුවක් රාජ මාළිග පරිශ්රයේම ඉදි කරවන ලද අතර මේ සියළු යක්ෂ දේවතාවන් උදෙසා වාර්ෂිකව පුද පූජා පැවැත්වීමද සිදු විය නගරයේ සුසාන භූමිය වදක භූමිය පශ්චිම රාජිණියගේ දෙවොල වෙස්සවණ උදෙසා වූ නුග රුක ව්යාධදේව උදෙසා වූ තල් රුක යෝනයන් සඳහා වාස භූමිය ආත්ම පූජා මන්දිරය ආදිය පිහිටැවිය යුතු තැන්ද මෙතුමන් විසින් නියම කරන ලදී වහලුන් නොහොත් චණ්ඩාලයන් විසින් කළ යුතු කාර්යයන් නියම කෙරුණු අතර ඔවුන් උදෙසා ග්රාමයක් වෙන් කරන ලදී නිඝණ්ටයන් තැන තැන සරන තවුසන් ආජීවකයන් සහ බ්රාහ්මණයන් උදෙසා වාසස්ථාන ගොඩ නඟන ලදී ග්රාම සීමාද නීර්ණය කරනු ලැබීය අනුරාධපුරය අග නගරය බවට පත් කරමින් ක්රි පූ සියවස තරම් ඈත යුගයකදී පණ්ඩුකාභය රජතුමන් විසින් බිහි කරනු ලැබූ සම්ප්රදාය ඉතා වැදගත් වේ නගරයට සහ පූජනීය ස්ථානයන්ට කරනු ලැබූ සනීපාරක්ෂක සහ පරිපාලනමය සම්පාදනයන් විසින් පෙන්නුම් කෙරෙනුයේ කාලාන්තරයක් තිසිසේ නගරය කිසියම් මධ්යගත සැලැස්මකට අනුව සංවර්ධනය කෙරුණු බවය පණ්ඩුකාභය රජතුමන්ගේ ඇවෑමෙන් එතුමන්ගේ පුත් මුටසීව රාජපදප්රාප්ත විය හැට වසරක් වූ එතුමන්ගේ රාජ්ය පාලන කාලය තුළ අනුරාධපුර නගරය තවදුරටත් අගනුවර වශයෙන් පවත්වා ගත් අතර බුදු සමය දිවයිනට හඳුන්වා දෙනු ලැබූ මුල් අවදියේදී වැදගත් කාර්යභාරයක් ඉටු කරනු ලැබූ මහාමේඝවන උද්යානය හෙවත් මහමෙවුනා උයන පිහිටුවාලීමද එසමයෙහි සිදුවිය බුදු රජාණන් වහන්සේගේ පිරිනිවන් පෑමෙන් වසර කට පසු ශ්රී ලංකාවට බුදු සමය හඳුන්වාදෙන ලද්දේ මුටසීව රජතුමන්ගේ ඇවැමෙන් රාජ්යත්වයට පත් එතුමන් පුත් දේවානම්පියතිස්ස රාජ්ය සමයෙහිදීය ඉන්දියාවෙහි වුසූ අශෝක අධිරාජයා දේවානම්පියතිස්ස රජතුමන්ගේ සමකාලීනයෙක් විය මෙම කාලය ක්රි පූ අතර කාලයයි ලංකාවෙහි රාජ්යත්වයෙහි ආරම්භය සහ ආසියාවෙහි විශිෂ්ඨතම ආගමක් වූ බුද්ධ ධර්මය මත පදනම් වූ ශිෂ්ඨාචාරයක ආරම්භයද සනිටුහන් කෙරෙන්නේ මෙසමයෙහිය",
        "ශ්රි මහ බෝධි පරිශ්රයෙහි වැඩ වසන ශාඛා බෝධීන් වහන්සේ නමක්",
        "දේවානම්පියතිස්ස රාජ්ය කාලයේදී බුදු දහම හඳුවාදිමත් සමඟ ලංකාවේ සමාජීය හා සංස්කෘතික වශයෙන් වෙනස්වීම් සිදුවිය එම වෙනස්වීම් තවදුරටත් වර්ධනය වූයේ බුදුන් වහන්සේගේ දන්ත ධාතුව ලංකාවට වැඩම කරවීමත් සමඟය මූලික වශයෙන් අනුරාධපුර යුගයේ සංස්කෘතිය පදනම් වූයේ බුදුදහම මතය එසේම එම රාජධානියේ නීතිය සහ පාලනය සඳහාද බුදුදහම මඟින් ඉමහත් බලපෑමක් එල්ල විය ක්රි පූ වැනි සියවසෙහි ශ්රි මහ බෝධිය ශ්රි ලංකාවට ගෙන එන ලද්දේ අශෝක අධිරාජයාගේ දියණිය වන සංඝමිත්තා මෙහෙණිය විසිනි ඇය ශ්රි ලංකා භික්ෂූණී ශාසනය පිහිටුවීමේ ලා පුරෝගාමී වූවාය ක්රි පූ දේවානම්පියතිස්ස රජතුමා විසින් අනුරාධපුර මහ මෙව්නා උයනෙහි මෙම ජය සිරි මහ බෝධිය සිටුවන ලදී බුදු දහමේ හඳුන්වා දීමත් සමඟම මෙම නුවර විසල් කැපීපෙනීමක් ලැබුවාක් මෙන්ම මහා ඉඳිකිරීම් යුගයක් ද ඇරඹුනි මහා වංශය පවසන්නේ කුටකන්න තිස්ස රජු විසින් රියන් හතක් උස තාප්පයක් ජල අගලක් ඉදිරියෙන් පවතින පරිදි පලමු තාප්පය ඉදිකළ බවයි පසුව වසභ රජු විසින් මෙය රියන් සිට රියන් දක්වා උස්කොට තවදුරටත් බලවත් කරන ලදි එසේම රජු විසින් ශක්තිමත් දොරටු නිවස්න වාසල් කඩ ඉදි කර ඇති අතර ඒවායෙහි නටබුන් අදද දැකිය හැක මහා වංශය තව දුරටත් පවසන්නේ ඉදිකිරීම් හිදී නිමිති කියන්නන් සහ වාස්තු විදුවන් ගේ උපදෙස් ලැබූ බවය",
        "කිත්සිරිමෙවන් රජ සමයේදී හේමමාලා කුමරිය සහ දන්ත කුමරු විසින් බුදුන් වහන්සේගේ දන්ත ධාතුව ලංකාවට වැඩම කරවන ලදී එම රජු විසින් දන්ත ධාතුව පෙරහැරකින් වඩම්මවා මන්දිරයක තැන්පත් කරන ලදී මෙම පෙරහැර වාර්ශිකව පවත්වන ලෙස රජු අණ කල අතර අදටත් එය චාරිත්රයක් ලෙස රටෙහි පවතී බුදුන් වහන්සේගේ දන්ත ධාතුව ඉතා ඉක්මනින්ම රටෙහි පූජනීය වස්තුවක් මෙන්ම රජ්ය භාවය තහවුරු කරන සංකේතයක් බවට පත් විය දන්ත ධාතුව ළඟ තබා ගන්නා පුද්ගලයා රටෙහි නියම පාලකයා විය එමනිසා බොහෝ විට එය රජ මාළිගාවෙහිම නිදන් කොට තබන ලදී",
        "රජරට රාජධානියේ ප්රධානතම ජයග්රහණය වූයේ වැසි ජලය මනාව කලමණාකරන කලහැකි වාරිමාර්ග බිහිවීමයි ඒ හේතුවෙන් වියළි කලාපයේ කෘෂිකාර්මික අවශ්යතාවන් සඳහා ජලය සැපයීම සිදු විය මෙම වාරිමාර්ග ඉදිකිරීම් මඟින් එම යුගයේ මිනිසුන් තුළ තිබූ උසස් තාක්ෂණික හා ඉංජිනේරු හැකියාවන් මනාව පිළිඹිබු කරයි",
        "දේවානම්පිය තිස්ස රජ ගේ සොහොයුරු මහානාග කුමරු විසින් රජරට රාජධානියෙන් ස්වාධීන රුහුණු රාජධානිය පිහිටුවාගන්නා ලදී රජරට රාජධානිය ආක්රමණියන් අතට පත් බෝහෝ අවස්ථාවලදී රුහුණු රාජධානිය බලය රැකගැනීමට ස්වදේශික සිංහලයන් සමත්විය",
        "රජරට රාජධානියට අඛණ්ඩව පැවතුණු තර්ජනයක් වූයේ දකුණු ඉන්දීය ආක්රමණයන්ය එලෙස සිදු වූ ආක්රමණයන්ගෙන් සතුරන් පරදවා රජධානියේ පාලනය නැවත ලබාගත් දුටුගමුණු වළගම්භා ධාතුසේන වන විජයබාහු ලීලාවතී වැනි පාලකයන් කාගේත් අවධානයට ලක්විය අනෙකුත් පාලකයන් මතකයේ රැඳුනේ ඔවුන් විසින් සිදු කරන ලද හමුදා ජයග්රහණ නිසාය දකුණු ඉන්දියාවට එරෙහිව ආක්රමණයන් දියත් කළ පළවන ගජභාහු පන්ධ්යන් දේවියට පිහිට වීමට තම හමුදාවන් යැවූ දෙවන සේන එවැනි පාලකයන්ය රජරට රාජධානියට එරෙහිව ආක්රමණයන් කිහිපයක් සිදුවූ අතර ඒවා සියල්ලක්ම දියත් කරන ලද්දේ දකුණු ඉන්දියාණුවන් විසිණි ශ්රී ලංකා ඉතිහාසයේ පළමු වාර්තාගත ආක්රමණය සිදුවූයේ සූරතිස්ස ක්රි පූ රජු සමයේදීය එය සිදු කරන ලද්දේ සේන හා ගුත්තික යන දකුණු ඉන්දීය අශ්ව වෙළෙන්දන් දෙදෙනෙකු විසිනි අවුරුදු විසිදෙකක පාලන කාලයෙන් අනතුරුව අසේල ක්රි පූ විසින් ඔවුන් පරජය කරන ලදී ඉන් අනතුරුව පැවති තවත් ආක්රමණයක් හේතුවෙන් චෝළ රජකු වූ එලාර ක්රි පූ අසේල රජු පරදවා රටෙහි පාලකයා බවට පත් විය එලාර අවුරුදු ක් රට පාලනය කළ අතර ඔහුව පරජයට පත් කරන ලද්දේ දුටුගැමුණු විසිනි කෙසේ නමුත් මහාවංශ වාර්තා වලට අනුවඑළාර විසින් රට යුක්තිගරුක ලෙස සහ සධාරණ ලෙස පාලනය කළ බව කියැවේ",
        "බාහිය පනයාමර පිලියාමර දතික විසින් රට නැවතත් ආක්රමණය කරන ලදී ඔවුන් ක්රි පූ දක්වා රට පාලනය කළ අතර වළගම්භා හට පරාජයට පත් විය පසුව ඇති වූ තවත් ආක්රමණයක් නිසා රටෙහි පාලනය දකුණු ඉන්දීය පාලකයන් සය දෙනෙකු වූ පණ්ඩු පාරින්ද තිරිතර දාතිය සහ පීතිය යටතට පත් විය ධාතුසේන විසින් ඔවුන් පරදවා නැවත බලය ලබා ගන්නා ලදී වන සේන සහ වන උදය රජ සමය තුළ දකුණු ඉන්දියාවෙන් බොහෝ ආක්රමණ සහ කොල්ලකෑම් එල්ල විය කෙසේ නමුත් මෙම ආක්රමණිකයන්ගෙන් කිසිවෙකු ඔවුන්ගේ පාලනය රටෙහි දකුණු ප්රදේශය වූ රුහුණ දක්වා දීර්ඝ කර නොගත්හ එබැවින් ශ්රී ලාංකීය පාලකයන් සහ උරුමක්කාරයන් ඔවුන්ගේ හමුදාවන් මෙම ප්රදේශය තුළ සංවිධානය කොට ගෙන ඔටුන්න නැවත ලබා ගැනීමට සමත් වූහ ශ්රී ලාංකීය ඉතිහාසය මුළුල්ලේම සතුරු ආක්රමණ වලින් රට බේරා ගත් අවස්තාවලදී රුහුණ මුල් වී ඉමහත් සේවයක් කරන ලදී",
        "රාජධානිය රජුගේ පාලනයට යටත් විය රාජ්යත්වයට සම්බන්ධ වූ කැප කිරීමේ උත්සව සහ පිළිවෙත් ක්රමයන් ආරම්භ වූයේ දේවානම්පිය තිස්ස රජු සමයේදීය එය එලෙස සිදු වූයේ ඉන්දියාවේ අශෝක රජුගෙන් ලැබූ ආභාශය හේතු කොට ගෙනය දුටුගැමුණු රජු විසින් ප්රථම වරට මුළු රටම තමන් යටතට පත් කොටගෙන රට එක්සේසත් කරන ලදී ඔටුන්නේ හිමිකාරිත්වයෙහි අනුපිළිවෙල සිදුවූයේ පිය පරම්පරාවට අනුකූලවය එය සිදු කළ නොහැකි අවස්තාවකදී පෙර රජුගේ වැඩිමහල් සහෝදරයාට ඔටුන්නේ හිමිකාරිත්වය උරුමයෙන් ලැබුණි සහෝදරයන් නොසිටියේ නම් වැඩිමහල් පුත්රයා හට ඔටුන්න උරුම විය අනුරාධපුර රාජධානියේ ආරම්භයේ සිට පාලකයෝ සතර දෙනෙකු රාජ්යය පලනය කරන ලදහ විජයගෙන් ආරම්භ කොට සුභරාජ දක්වා සිටි පාලකයන් සාමාන්යයෙන් හැඳින්වූයේ විජයන් රජ පෙළපතට අයත් අය ලෙසයි මෙම රජ පෙළපතට අයත් වූ පණ්ඩුකාභය අනුරාධපුර රාජධානියේ ප්රථම පාලකයා විය රුවන්වැලිසෑය අසල පිහිටුවා ඇති දුටුගැමුණු ප්රතිමාව",
        "ළඹකන්න වංශයට අයත් වසභ විසින් බලය පැහැර ගන්නා තුරු විජයන් පෙළපත පැවතුණි වසභ විසින් ඔටුන්න හිමි කර ගැනීමත් සමඟ ළඹකන්න රජ පෙළපත ආරම්භ වූ අතර එම පෙලපතට අයත් පාලකයන් සියවස් තුනකට වඩා වැඩි කාලයක් රට පාලනය කරන ලදහ නව රජ පෙළපතක් ආරම්භ වූයේ දී ධාතුසේන කාලයේදීය එය මූරිය රජ පෙළපත විය ඇතැම් ඉතිහාසඥයන් විසින් මෙම රජ පෙළපතෙහි ආරම්භය ශාඛ්ය රජු ලෙස හැඳින්වූවත් ආරම්භක රජු තවමත් අවිනිශ්චිතය අනුරාධපුර යුගයේ පැවති අවසාන රජ පෙළපත වූයේ දෙවන ළඹකන්න රජ පෙළපතයි එය මානවම්මගෙන් ආරම්භ වූ අතර අනුරාධපුර රාජධානියේ අවසාන පාලකයා වූ වන මහින්ද දක්වා පැවතුනි",
        "අනුරාධපුර රජකම් කර රජවරු අනුරාධපුර රජකම් කර රජවරු විවිධ වු යුගයන්වලට අයත් වුවෝ විය පහත දැක්වෙන්නේ එම යුගයන් ය පණ්ඩුකාභය රාජ වංශ යුගය පණ්ඩුකාභය රජ මුඨසිව රජ පණ්ඩුකාභය රජගේ පුත් තිස්ස රජ දේවානම්පිය තිස්ස රජ උත්තිය රජ මහාසිව රජ සූරතිස්ස රජ චෝල යුගය චෝල යුගය රජරට රාජධානිය ආක්රමණක චෝල සේන හා ගුත්තික අශ්වාචාරි අසේල රජ දේවානම්පිය තිස්ස බාල සොයුරු ආක්රමණක චෝල එළාර රජ චෝල යුගය මායා කැළණි රාජධානිය කැළණි තිස්ස රජ චෝල යුගය රුහුණු රාජධානිය කාවන්තිස්ස රජ පණ්ඩුකාභය රාජවංශ යුගය සිංහලේ රාජධානිය දුටුගැමුණු රජු සද්ධාතිස්ස සැඳෑතිස් තුලත්ථන ලංජතිස්ස ලැමිණිතිස් බල්ලාඨනාග වළගම්බා රජු වට්ටගාමිණී අභය වලගම් අබා ආක්රමණක පංච ද්රවිඩයන් පුලහත්ථ බාහිය පනයමාර පිළයමාර දාඨිය වළගම්බා රජු යළි රජවීම මහවුලිතිස්ස චෝරනාග තිස්ස කුඩාතිස්ස සිව වටුක දාරුභාතික තිස්ස තිලිය පුරෝහිත බමුණා අනුලා රැජින කූඨකණ්ණ තිස්ස භාතික අභය මහාදාථික මහානාග ආමන්ද ගාමිණී අභය කණිරජානු තිස්ස චූලාභය සීවලී රැජින අරාජික සමය ඉලනාග චණ්ඩමුඛසීව යසලාලක තිස්ස සුබ රජ සභ සුභ ලම්බකර්ණ රාජ වංශය වසභ රජ වංකනාථතිස්ස ගජබාහුක ගාමිණී වන ගජබාහු රජ මහල්ලකනාග භාතික තිස්ස කනිට්ඨතිස්ස බුජ්ජනාග කුංචනාග වන සිරිනාග වෝහාරිකතිස්ස වෙහෙරතිස්ස අභයනාග වන සිරිනාග විජය කුමාර වන සංඝතිස්ස සිරිසංගබෝධි දැහැමි සිරිසඟබෝ ගෝඨාභය ගොළු අබා වන ජෙට්ඨතිස්ස මහාසේන මහසෙන් සිරි මේඝවණ්ණ කිත්සිරිමෙවන් වන ජෙට්ඨතිස්ස බුද්ධදාස රජ වන උපතිස්ස මහානාම වට්ටගාහජන්තු මිත්තසේන මිත්සෙන් ෂඩ් ද්රවිඩයන් පණ්ඩු පාරින්ද ඛුද්ධ පාරින්ද තිරිතර දාඨිය පීඨිය මෞර්ය රාජ වංශය ධාතුසේන රජු වන කස්සප සීගිරි කසුබු සීගිරි බලකොටුව සට රට පාලනය කලේය මොග්ගල්ලාන මුගලන් කුමාර ධාතුසේන කුමාරදාස කුමාරදාස් කිත්තිසේන සිව වන උපතිස්ස සීලාකාර අම්බ සාමනේර දාඨාපභූති දාපලුසෙන් වන මොග්ගල්ලාන කිත්සිරිමේඝ කුඩා කිත්සිරිමෙවන් මහානාග වන අග්ගබෝධි අක්බෝ වන අග්ගබෝධි කුඩා අක්බෝ වන සංඝතිස්ස වන මොග්ගල්ලාන සීලාමේඝවණ්ණ වන අග්ගබෝධි සිරිසංඝබෝධි වන ජෙට්ඨතිස්ස වන අග්ගබෝධි යළි රජවීම දාඨෝපතිස්ස වන කස්සප වන දප්පුලු හත්ථදාඨ වන අග්ගබෝධි දට්ට වන හත්ථදාඨ ලම්බකර්ණ මානවම්ම රාජ වංශය මානවම්මරජ වන අග්ගබෝධි වන කස්සප වන මහින්ද වන අග්ගබෝධි වන අග්ගබෝධි වන මහින්ද වන උදය වන මහින්ද වන අග්ගබෝධි වන දප්පලු වන අග්ගබෝධි වන සේන වනසේන වන උදය වන කස්සප වන කස්සප වන දප්පුලු වන දප්පුල වන උදය වන සේන වන උදය වන සේන වන මහින්ද වන සේන වන මහින්ද රජ මිහිදු ක්රි ව",
        "අනුරාධපුර රජකම් කර රජවරු විවිධ වු යුගයන්වලට අයත් වුවෝ විය පහත දැක්වෙන්නේ එම යුගයන් ය",
        "ආක්රමණක පංච ද්රවිඩයන් පුලහත්ථ බාහිය පනයමාර පිළයමාර දාඨිය",
        "ධාතුසේන රජු වන කස්සප සීගිරි කසුබු සීගිරි බලකොටුව සට රට පාලනය කලේය මොග්ගල්ලාන මුගලන් කුමාර ධාතුසේන කුමාරදාස කුමාරදාස් කිත්තිසේන සිව වන උපතිස්ස සීලාකාර අම්බ සාමනේර දාඨාපභූති දාපලුසෙන් වන මොග්ගල්ලාන කිත්සිරිමේඝ කුඩා කිත්සිරිමෙවන් මහානාග වන අග්ගබෝධි අක්බෝ වන අග්ගබෝධි කුඩා අක්බෝ වන සංඝතිස්ස වන මොග්ගල්ලාන සීලාමේඝවණ්ණ වන අග්ගබෝධි සිරිසංඝබෝධි වන ජෙට්ඨතිස්ස වන අග්ගබෝධි යළි රජවීම දාඨෝපතිස්ස වන කස්සප වන දප්පුලු හත්ථදාඨ වන අග්ගබෝධි දට්ට වන හත්ථදාඨ",
        "මානවම්මරජ වන අග්ගබෝධි වන කස්සප වන මහින්ද වන අග්ගබෝධි වන අග්ගබෝධි වන මහින්ද වන උදය වන මහින්ද වන අග්ගබෝධි වන දප්පලු වන අග්ගබෝධි වන සේන වනසේන වන උදය වන කස්සප වන කස්සප වන දප්පුලු වන දප්පුල වන උදය වන සේන වන උදය වන සේන වන මහින්ද වන සේන වන මහින්ද රජ මිහිදු ක්රි ව",
        "අනුරාධපුරය නගරය ගොඩනැගිමට මුල් වුයේ පණ්ඩුකාභය රජතුමා විසිනි එය අගනගරය ලෙසට තවදුරටත් පවත්වාගෙන යනලද්දේ ඔහුගේ පුත් මුටසිව විසිනි ඔහු රාජ්යත්වයට පත් වුයේ බුද්ධ පරිනිර්වාවසර කට පසුව ය ඔහු විසින් මහා මෙිඝ විනෝද උද්යානය සකසනු ලැබිය මෙිකි උද්යානය මල් සහ ඵල සහිත සියලු ආකාරයේ වෘකෂයන්ලගන් පිරි අලංකාරව පැවතුනි උද්යානය ගොඩනගන කල්හි මහා වර්ෂාපතනයක් ඇදහැලුන බැවින් මහා ධාරානිපාත වර්ෂාව යන අර්තය සිංහල භාෂාවෙන් මහා මෙිඝ යන නමි ලැබුණි වර්ග සැතපුමි ගණනාවක විහිදුන මෙයපිහිටා තිබුනේ නගර සිමාවෙන් පිටත දකුණු භාගයෙහිය මෙකි උද්යානයේ පිහිටිම ගැන මහින්දාගමනයේ පවා ප්රකට වි ඇත එමෙන්ම දෙවනමිපියතිස්ස රජු කල උද්යානයෙහි විවිධආගමිික පුජාවන් පවත්වන ලදි"
      ],
      "fetch_time": 2.129124641418457,
      "error": null
    }
  ]
}