{
  "timestamp": "2026-01-01T23:26:49.832091",
  "query": "ශ්රී ලංකාව ඉන්දියන් සාගරයේ පිහිටි දිවයිනකි කොළඹ අගනුවර",
  "results": [
    {
      "url": "https://si.wikipedia.org/wiki/%E0%B7%81%E0%B7%8A%E2%80%8D%E0%B6%BB%E0%B7%93_%E0%B6%BD%E0%B6%82%E0%B6%9A%E0%B7%8F%E0%B7%80",
      "title": "ශ්‍රී ලංකාව - විකිපීඩියා",
      "snippet": "ශ්‍රී ලංකාව බ්‍රිතාන්‍ය පාලන සමයේ දී සිලෝන් ලෙස හැඳින්වු අතර වර්තමානයේ නිල වශයෙන් ශ්‍රී ලංකා ප්‍රජාතාන්ත්‍රික සමාජවාදී ජනරජය ලෙස හදුන්වයි. ශ්‍රී ලංකාව සෙරන්ඩිබ්, සිලොන්, දීප්තිමත් දිවයින, ධර්ම දිවයින, ඉන්දියන් සාගරයේ මුතු ඇටය ...",
      "paragraphs": [
        "විකිපීඩියා වෙතින් ශ්රී ලංකා ප්රජාතාන්ත්රික සමාජවාදී ජනරජය දෙමළ කොඩිය රාජ්ය ලාංඡනය ජාතික ගීය ශ්රී ලංකා මාතා ඉංග්රීසි අගනුවර ශ්රී ජයවර්ධනපුර කෝට්ටේ පරිපාලන කොළඹ වාණිජ විශාලතම නගරය කොළඹ නිල භාෂා ව සිංහල දෙමළ ඉංග්රීසි ජනවාර්ගික කණ්ඩායම් සිංහල ශ්රි ලාංකීය දමිළ ඉන්දීය දමිළ ශ්රී ලාංකීය යෝනක බර්ගර් මැලේ වෙනත් ආගම බෞද්ධ හින්දු ඉස්ලාම් රෝමානු කතෝලික වෙනත් ක්රිස්තියානි වෙනත් ජාති නාම ය ශ්රී ලාංකික රජය ඒකීය අර්ධ ජනාධිපතිමය ප්රජාතාන්ත්රික ජනරජය කි ජනාධිපතිවරයා අනුර කුමාර දිසානායක අග්රාමාත්යවරයා හරිනි අමරසූරිය පාර්ලිමේන්තු කථානායක ජගත් වික්රමරත්න අගවිනිසුරු මුර්දු ප්රනාන්දු ව්යවස්ථාදායකය පාර්ලිමේන්තුව නිදහස මහා බ්රිතාන්යයෙන් වර්ග ප්රමාණය සම්පූර්ණ වන ස්ථානය ජලය ජනගහණය ජන සංගණනය වන ස්ථානය ඝණත්වය වන ස්ථානය දදේනි ක්රශසා ඇස්තමේන්තුව සම්පූර්ණ ඇ ඩො බි ඒක පුද්ගල ඇ ඩො දදේනි නාමික ඇස්තමේන්තුව සම්පූර්ණ ඇ ඩො බි ඒක පුද්ගල ඇ ඩො ගිනි පහළ මාසද ඉහළ වන ස්ථානය ව්යවහාර මුදල ශ්රී ලංකා රුපියල වේලා කලාපය දින ආකෘති ඉංග්රීසි සිංහල රිය ධාවන මං තීරුව වම ඇමතුම් කේතය අන්තර්ජාල ලංකා වෙබ් අඩවිය මෙම ලිපිය රට පිලිබඳ වේ වෙනත් භාවිතා සඳහා ලංකාව බලන්න ශ්රී ලංකාව බ්රිතාන්ය පාලන සමයේ දී සිලෝන් ලෙස හැඳින්වු අතර වර්තමානයේ නිල වශයෙන් ශ්රී ලංකා ප්රජාතාන්ත්රික සමාජවාදී ජනරජය ලෙස හදුන්වයි ශ්රී ලංකාව සෙරන්ඩිබ් සිලොන් දීප්තිමත් දිවයින ධර්ම දිවයින ඉන්දියන් සාගරයේ මුතු ඇටය නමින්ද හදුන්වයි විවිධ නම් ගණනාවකින් පුරාණයේ හැඳින්වූ මෙම දූපත නම් දහසක් ඇති දූපත ලෙස ප්රචලිත ද විය මෙය දකුණු ආසියානු දූපතකි එය ඉන්දියානු සාගරයේ බෙංගාල බොක්කෙහි නිරිත දෙසින් සහ අරාබි මුහුදේ ගිනිකොන දෙසින් පිහිටා ඇත එය ඉන්දියානු උප මහද්වීපය මන්නාරම් බොක්ක සහ පෝක් සමුද්ර සන්ධිය මගින් වෙන් කරනු ලැබේ ශ්රී ලංකාවේ පිහිටීම ප්රධාන මුහුදු මාර්ගවල පිහිටීම හේතුවෙන් බටහිර ආසියාව සහ අග්නිදිග ආසියාව අතර උපායමාර්ගික නාවික සම්බන්ධකයක් ලෙස එය පුරාණ කාලයේ සිටම භාවිතය ගැණුනි ඉන්දියානු ජනරජය සහ ශ්රී ලංකා ජනරජය මාර්තු වන දින මනාර් බොක්ක සහ බෙංගාල බොක්කෙහි සමුද්ර මායිම් ස්ථාපිත කරමින් ගිවිසුමක් අත්සන් කරන ලදී ශ්රී ලංකාවට ආසන්න ම රටවල් ලෙස ඉන්දියාව සහ මාලදිවයින හැදින්විය හැකි ය ශ්රී ලංකාවේ විශාලත්වය වර්ග කි මී වර්ග සැතපුම් වේ එය ලොව වැනි විශාලතම රට වන අතර විශාලතම දූපත් අතරින් වන ස්ථානයෙ සිටියි එහි භූමි ප්රදේශය පළාත් නවයකට සහ දිස්ත්රික්ක විසිහතරකට වෙන් කර ඇත රට පළාත් කින් දිස්ත්රික්ක හා ප්රදේශිය ලේකම් කොට්ටාශය හා ග්රාම නිලධාරි කොට්ටාශ කින් සමන්විත වේ අගනුවර ශ්රී ජයවර්ධනපුර කොට්ටේ වන අතර විශාලතම නගරය කොළඹ වේ කොළඹ ජාතියේ ආර්ථික දේශපාලන කේන්ද්රස්ථානයයි ශ්රී ලංකාව ලෝක උරුම ස්ථාන අටක් සැතපුම් ගණනක් පුරා විහිදුනු රන්වන් වැලි සහිත වෙරළ වල් වැසි වනාන්තර සහ කඳුකර තේ වතු සහිත ඉතා සුන්දර දූපතකි නිවර්තන වනාන්තර වෙරළ සහ භූ දර්ශනවල ස්වභාවික සුන්දරත්වය ජෛව විවිධත්වය මෙන්ම පොහොසත් සංස්කෘතික උරුමයන් සඳහා ප්රසිද්ධය එය ලෝක ප්රසිද්ධ සංචාරක ගමනාන්තයක් බවට පත් කළේය ශ්රී ලංකාවේ ජනගහනය මිලියන කට ආසන්න වේ එය දූපතක ජීවත් වන වන විශාලතම ජනගහනය යි ශ්රී ලංකාවේ ජනගහනයෙන් ථෙරවාද බෞද්ධ යන් වේ එනම් මිලියන ක් පමණ වේ එය ලොව හෝ වන විශාලතම බෞද්ධ ජනගහය ක් වෙසෙන රට වේ ශ්රී ලංකාවේ ජාතික ආගම ථෙරවාද බෞද්ධ වන අතර හින්දු භක්තිකයන් ඉස්ලාම් භක්තිකයන් ක්රිස්තියානි භක්තිකයන් නිරාගමිකයන් සහ වෙනත් ආගමිකයෝ වෙති බහුවිධ හා බහුසංස්කෘතික රාජ්යයක් වන ශ්රී ලංකාව බොහෝ ආගම් ජන වර්ග සහ භාෂා රැසකට නිවහන වේ දිවයිනෙහි බහුතරය වූ සිංහල ජනතාවට අමතරව එහි අනෙකුත් සුළු වාර්ගික කණ්ඩායම් ලෙස ශ්රී ලාංකික දෙමළ ඉන්දියානු දෙමළ මරක්කල බර්ගර් මැලේ කාපිරි සහ ස්වදේශීය වැදි ජනතාව වාසය කරනු ලබයි නිල භාෂාව සිංහල භාෂාව සහ දෙමළ භාෂාව වේ ශ්රී ලංකාව යනු පොහොසත් සංස්කෘතික උරුමයක් ඇති රටකි ශ්රී ලංකාවේ ලිඛිත ඉතිහාසය වසර ක් පමණ අතීතයට විහිදෙන අතර සහ සාක්ෂ්ය සහිත ප්රාග් ඓතිහාසික මානව ජනාවාසයන්ගේ ඉතිහාසය අවම වශයෙන් වසර ක් දක්වා විහිදේ ඉතා පොහොසත් බෞද්ධ උරුමය ක් සතු ශ්රී ලංකාවේ ප්රථම ඉතිහාසමය බෞද්ධ ලේඛනගත කිරීම වන පාලි ත්රිපිටකය ක්රි පූ සිව්වන ධර්ම සංගායනා සමය තෙක් දිවයයි කෝට්ටේ රාජධානියේ විශාල දේශපාලන අර්බුදකාරී කාල පරිච්ඡේදයක් තුළ පෘතුගීසීන් ශ්රී ලංකාවට පැමිණ දිවයිනේ සමුද්ර වෙළඳාම පාලනය කිරීමට උත්සාහ කළ අතර ශ්රී ලංකාවේ කොටසක් පසුව පෘතුගීසි සන්තකයක් බවට පත්විය සිංහල පෘතුගීසි යුද්ධයෙන් පසු ලන්දේසීන් සහ මහනුවර රාජධානිය එම ප්රදේශ පාලනය කර ගත්හ පසුව ලන්දේසි දේපල බ්රිතාන්යය න් විසින් අත්පත් කර ගත් අතර පසුව ඔවුන් මුළු දිවයිනම තම පාලනය ව්යාප්ත කර සිට දක්වා එය යටත් විජිතයක් බවට පත් කළහ ශ්රී ලංකාවේ වඩාත් මෑත ඉතිහාසය වසර ක සිවිල් යුද්ධය කින් විනාශ වූ අතර එය දී ආරම්භ වී දී තීරණාත්මක ලෙස අවසන් වූයේ ශ්රී ලංකා සන්නද්ධ හමුදාව දෙමළ ඊළාම් විමුක්ති කොටි සංවිධානය පරාජය කිරීමත් සමඟ ය ශ්රී ලංකාවේ චන්ද්රිකා ඡායාරූපයක් ශ්රී ලංකාව අර්ධ ජනාධිපතිමය ක්රමය යටතේ පාලනය වන ඒකීය ජනරජයක් වේ ශ්රී ලංකාව සතු විදේශ සබඳතා දිගු ඉතිහාසයකින් සමන්විතය ශ්රී ලංකාව දකුණු ආසියානු කලාපීය සහයෝගීතා සංවිධානයේ සාර්ක් සංවිධානය ආරම්භක සාමාජිකයෙකු වන අතර එක්සත් ජාතීන් පොදු රාජ්ය මණ්ඩලය ජී සහ නොබැඳි ජාතීන් යන සංවිධානවලද වත්මන් සාමාජිකයෙකු වේ කුරුඳු තේ කෝපි රබර් සහ පොල් නිෂ්පාදනය සහ අපනයනය සඳහා ප්රසිද්ධ ශ්රී ලංකාව ප්රගතිශීලී නවීන කාර්මික ආර්ථිකයක් දරයි ශ්රී ලංකාව සංවර්ධනය වෙමින් පවතින රට ක් වන අතර මානව සංවර්ධන දර්ශකයේ වැනි ස්ථානයට පත්ව ඇත එය සංවර්ධනය අතින් ඉහළම ශ්රේණිගත දකුණු ආසියානු ජාතිය වන අතර දකුණු ආසියාවේ දෙවැනි ඉහළම ඒක පුද්ගල ආදායම ද ඔවුනට හිමිය වෙනත් නම් විවිධ නම් ගණනාවකින් පුරාණයේ හැඳින්වූ මෙම දූපත නම් දහසක් ඇති දූපත ලෙස ප්රචලිත ද විය ශ්රී ලංකාව සෙරන්ඩිබ් සිලොන් දීප්තිමත් දිවයින ධර්ම දිවයින ඉන්දියන් සාගරයේ මුතු ඇටය ඉන්දියාවේ කඳුළු බිඳුව යන නමින්ද අතීතයේ දී අපරදිග විදේශිකයන් විසින් නිල වශයෙන් හෙලංකා ලංකා සිංහලේ යනුවෙන්ද අරාබිවරුන් සීලාන් සිලෝන් සෙරන්දිබ් සහ තැප්රෝබේන් යන නම්වලින් ද සිව් හෙළය හෙළය තම්බපන්නි සීලදීප රත්නදීප හා පෙරදිග ධාන්යාගාරය ආදී අන්වර්ථ නාමවලින් ද සහ විරුදාවලිවලින් ද හදුන්වයි දෑත් එක්කොට ආයුබෝවන් ආයිබෝං කීම ශ්රී ලාංකික සිංහලයන් අන් අය පිළි ගැනීමට භාවිතා කරන සාම්ප්රදායික ක්රමයයි එහි යටත් විජිත කාලය තුළ දිවයිනට සිලෝන් යන නම ලැබුණි එය පසුව යටත් විජිත කාලය අවසන් වන තුරුම දිගටම භාවිතා විය සිලෝන් නමින් වර්තමානයේ හැඳින්වූයේ නැතත් වර්තමානයේ විවිධ දේශීය ව්යාපාර සඳහා සිලෝන් යන නාමය භාවිත කිරීම සුලභ දෙයකි ඉන්දියාවේ කඳුළු බිඳුව ලෙස ශ්රී ලංකාව හැඳින්වීමට ශ්රී ලංකාවේ විශේෂ හැඩය සහ ඉන්දියාවට සමීප වීම හේතු විය ඉතිහාසය ප්රාග් ඓතිහාසික යුගය ශ්රී ලංකාවේ හෝමෝ ඉරෙක්ටස් මිනිසුන් තරම් ඈතක සිට ඇති බවට සාක්ෂි ඇත ගල් යුගය ගල් යුගය ආසන්න වශයෙන් වසර කට පෙර සිට ක්රි පූ දක්වා පැවතිණි පැලියොලිතික් යුගය ඉරණමඩු හි සොයාගැනීම්වලින් පෙනී යන්නේ ශ්රී ලංකාවේ තරම් ඈත අතීතයේ පැලියොලිතික් මිනිසුන් සිටි බවයි ශ්රී ලංකා භූමියේ පැලියොලිතික් යුගයට අයත් ප්රධාන ප්රදේශ ක පදිංචිකරුවන් සොයා ගත හැකි විය පහතරට වියළි කලාපය පහතරට අර්ධ ශුෂ්ක කලාපය පහතරට වියළි කලාපය පහතරට අතරමැදි වියළි කලාපය කඳුකර වියළි අතරමැදි කලාපය පහතරට අතරමැදි තෙත් කලාපය තෙත් කඳු කලාපය තෙත් උස්බිම් කලාපය ආණ්ඩුව ප්රධාන ලිපිය ශ්රී ලංකා ප්රජාතාන්ත්රික සමාජවාදී ජනරජය ශ්රී ලංකාව ඒකීය රාජ්යයක් වන අතර එහි ආණ්ඩුව ශ්රී ලංකා ප්රජාතාන්ත්රික සමාජවාදී ජනරජය නම් වේ එතෙක් සිලෝන් හෙවත් ලංකා නම් වූ රාජධානිය අහෝසි කොට මැයි දින ශ්රී ලංකා සමාජවාදී ජනරජය පිහිටුවන ලදී දී ශ්රී ලංකා ප්රජාතාන්ත්රික සමාජවාදී ජනරජය පිහිටුවන ලදී අගනුවර අග නගරය ශ්රී ජයවර්ධනපුර කෝට්ටේ වේ එහි වාණිජ අග නගරය වන්නේ කොළඹ නගරයයි වර්ග ප්රමාණය ප්රධාන ලංකා දූපත අභ්යන්තර සමුද්ර ජල ප්රදේශය ඓතිහාසික මුහුද රාෂ්ට්රීය මුහුද යාබද මුහුද පරම ආර්ථික කලාපය සමස්ථ වර්ගඵලය ශ්රී ලංකාවේ ජාතික සංකේත ජාතික පක්ෂියා ශ්රී ලංකා වලිකුකුලා ය්ජ් ජාතික සත්ත්වයා ශ්රී ලංකා දඩුලේනා ජාතික වෘක්ෂය නා ගස ජාතික පුෂ්පය මානෙල් මල ජාතික මාණික්යය නිල් මැණික මෙහි වැඩිදුර අධ්යයනයක් සදහා ශ්රී ලංකාවේ ජාතික සංකේත වෙත පිවිසෙන්න ශ්රී ලංකාවේ අතීතය ප්රධාන ලිපිය ශ්රී ලංකාවේ අතීතය ප්රාග් ඓතිහාසික යුගය ලංකාවේ ප්රාග් ඓතිහාසික යුගය අධ්යයනය කිරීමේ පහසු ව සඳහා පහත පරිදි යුග වලට බෙදා අධ්යයනය කරනු ලැබේ පුරාශිලා යුගය මධ්යශිලා යුගය නවශිලා යුගය සිදුකර ඇති පුරාවිද්යා පර්යේෂණ අනුව ලංකාවේ මානව යටගියාව පිළිබඳ සාධක අදින් වසර දක්වා ඈතට දිවයයි ලංකාවේ වයඹදිග හා ගිණිකොණදිග ප්රදේශයන්ගේ වෙරළාශ්රීත ප්රදේශවල ව්යාප්තව ඇති ඉරණමඩු පාංශු සංකීර්ණයට අයත් බූන්දල වැල්ලෙගංගොඩ හා පතිරාජවෙල යන ස්ථානයන්ගේ සිදුකරන ලද පුරාවිද්යා පර්යේෂණ අනුව මෙම කරුණු තහවුරු වී ඇත ඓතිහාසික යුගය ප්රථම නවීන අගනුවර ලෙස අනුරාධපුරය සැලකෙන අතර රාජ්ය පරපුරේ අවසානය සෙංකඩගල නගරය විය යටත් විජිත යුගය වර්ෂ දී පෘතුගීසීන් ලංකාව ආක්රමණය කරන ලදී පරංගින්ගේ මුලික අවශ්යතාව වූයේ ඔවූන්ගේ ආගම හා වෙළඳාම පැතිරවීමයි පසුව ඕලන්ද ලන්දේසීන් හා ඉංග්රීසි අධිරාජ්යවාදීන්ගේ ද තාඩන පීඩනවලට ලක්විය මෙම ආකාරයෙන් වූ තාඩන පීඩනයන්ගෙන් මීදීම සදහා උඩරට ගිවිසුම නමින් දී ඉංග්රිසීන් සමඟ අත්සන් කරන ලද ගිවිසුම ඔවුන් විසින් ම උල්ලංඝනය එහි ජනතාව පිට යටත් විජිත මානසිකත්වයක් මවමින් දක්වා දරුණු පාලනයක් ගෙන ගියහ මේ අතරතුර කාලයේදී ලාංකික ජනතාව දී සහ දී කැරලි දියත් කලේය ශ්රී ලංකා සමාජවාදී ජනරජය ප්රධාන ලිපිය ශ්රී ලංකා සමාජවාදී ජනරජය කොටි ත්රස්තවාදය අවුරුදු කට ආසන්න කාලයක් තුල රටේ බෙදීමක් ඇති කිරීමට ත්රස්තවාදී කණ්ඩායමක් වන දෙමළ ඊලාම් කොටි එල්ටීටීඊ සංවිධානය තැත් කළද වසරේදී එම සංවිධානය රටින් මුලිනුපුටා දමා රටට සාමය ඇතිවී ඇත ශ්රී ලංකාවේ පුරාවස්තු ප්රධාන ලිපිය ශ්රී ලංකාවේ පුරාවිද්යා ආරක්ෂිත ස්මාරක ලැයිස්තුව භූගෝලය ප්රධාන ලිපිය ශ්රී ලංකාවෙහි භූගෝලය ශ්රී ලංකාවෙහි භූ ලාක්ෂණික සිතියම ස්වභාවික ව්යසන ශ්රී ලංකාව ස්වභාවික ව්යසන අවම රටකි නමුත් වර්ෂාව නිසා ඇතිවන ව්යසන නිතර දැකිය හැක ක්රි ව වසරේ දෙසැම්බර් වනදා බලපෑ සුනාමිය ව්යසනය ශ්රී ලංකාවේ වාර්තාගත දරුණුතම ස්වභාවික ව්යසනය වේ ශාක සහ සත්ත්ව සංහතිය ප්රධාන ලිපිය ලංකා දූපතේ ශාක සහ සත්ත්ව සංහතිය විවිධත්වය සහ ආවේණිකත්ය අතින් ශ්රී ලංකාවේ ශාක සංහතිය ඉහළ අගයක් ගනී ශ්රී ලංකාවේ ගණ කට අයත් සපුෂ්පක ශාක ක් ඇත්තේය විශේෂ සහ ගණ ක් දිවයිනට ආවේණික වේ මීට අමතරව දිවයිනෙහි ඇති හොර කුලයේ ශාක විශේෂ න් එකක් හැර අනෙක්වා සියල්ලම ශ්රී ලංකාවට සීමා වේ මෑතකදී අගය නො කරන ලද මුත් ශ්රී ලංකාවේ මීවන ප්රමාණය ක් පමණ වේ සියළු ජීවී කාණ්ඩවල විවිධත්වය සාරවත්භාවය සහ ආවේණිකත්ය අතින් තෙත් කලාපය වියළි කලාපයට වඩා ඉතා ඉදිරියෙන් සිටියි තෙත් කලාපය භූමි ප්රමාණයෙන් දිවයිනෙන් හතරෙන් එකක් වන නමුත් සපුෂ්පක ශාක විශේෂවලින් සියයට කට සහ ආවේණික සපුෂ්පක ශාක විශේෂවලින් සියයට කට රැකවරණය සළසයි ශ්රී ලංකාවේ ස්වභාවික වනාන්තර කොටස් අටකට කාණ්ඩ කරයි ශ්රී ලංකාවේ උප බෙදීම් ප්රධාන ලිපිය ශ්රී ලංකාවේ උප බෙදීම් පළාත් ප්රධාන ලිපිය ශ්රී ලංකාවේ පළාත් ශ්රි ලංකාව පළාත් කට බෙදා දේශපාලන බලය විමධ්යගතකර ඇත ඒවා නම් උතුරු පළාත උතුරු මැද පළාත මධ්යම පළාත වයඹ පළාත බස්නාහිර පළාත සබරගමුව පළාත ඌව පළාත දකුණු පළාත නැගෙනහිර පළාත පරිපාලන දිස්ත්රික්ක ප්රධාන ලිපිය ශ්රී ලංකාවේ පරිපාලන දිස්ත්රික්ක ශ්රී ලංකාව පරිපාලනය දිස්ත්රික් ක් වශයෙනි ජනතාව ජනගහණය ජන සංගණනය අනුව සමාජය බහු සංස්කෘතිකමය රටකි ශ්රී ලංකාවේ බහුතරය සිංහල ජාතිකයෝ වේ රාජ්ය ආගම බුද්ධාගමය පෙරදිග සංස්කෘතියට අනුගත සමාජයකි ජාතීන් සිංහල දෙමළ මරක්කල බර්ගර් මැලේ වැදි ආදී විවිධ ජාතින් ජීවත්වේ ශ්රි ලංකාවෙහි ප්රධාන හා පාරම්පරික කර්මාන්තය ගොවිතැනය භාෂා ප්රධාන ලිපිය ශ්රී ලංකාවේ භාෂා සිංහල සහ දෙමළ රාජ්ය භාෂාවේ ඉංග්රීසි පිළිගත් සමිබන්ධීකරණ භාෂාවයි නිල තත්ත්වයක් නොමැති වුවද මලයාලම් වැදි බස මැලේ ආදී භාෂා අදාල ජාතීන් භාවිතා කරයි ආගම් ප්රධාන ලිපිය ශ්රී ලංකාවේ ආගමික විවිධත්වය ප්රධාන ආගම බුදු දහම වේ බුද්ධාගම සහ පුරාණ හෙල ඇදහිලි හින්දු රෝමානු කතෝලික ක්රිස්තියානි ඉස්ලාම් වර්ෂය බෞද්ධ හින්දු ඉස්ලාම් කතෝලික වෙනත් එකතුව සංඛ්යව සංඛ්යව සංඛ්යව සංඛ්යව සංඛ්යව සංඛ්යව සංගණනය සංගණනය සංගණනය සංගණනය සංගණනය තක්සේරුව සංගණනය සංගණනය සංගණනය සංගණනය සංගණනය බොජුන් ජාතික ආහාරය බත් වේ බත් සහ ව්යංජන දෙක ම මෙම වචනයෙන් අදහස් කෙරේ දේශපාලනය ප්රධාන දේශපාලන පක්ෂ තනි පක්ෂ ශ්රී ලංකා නිදහස් පක්ෂය එක්සත් ජාතික පක්ෂය ජනතා විමුකිති පෙරමුණ හවුල් සංධාන එක්සත් ජනතා නිදහස් සංධානය එක්සත් ජාතික පෙරමුණ ප්රජාතන්ත්රවාදී ජාතික සංධානය අධ්යාපනය ප්රධාන ලිපිය ශ්රී ලංකාවේ අධ්යාපනය ආර්ථිකය සමාජවාදී සහ ධනවාදී ලක්ෂණ මිශ්ර ආර්ථික ක්රමයක් පවතී මූලිකවම කෘෂිකාර්මික රටකි මහ බැංකු වාර්තාව අනුව වසරේදි ශ්රී ලංකාව සියයට ක ආර්ථික වර්ධනයක් වාර්තා කර ඇත කෘෂීකර්මය දේශීය පරිභෝජනය සඳහා වී ගොවිතැන පොල් වගාව අපනයන බෝග ශ්රී ලංකාවේ තේ රබර් කුළු බඩු කර්මාන්ත සාම්ප්රදායික කර්මාන්ත ශ්රී ලංකාවේ ධීවර කර්මාන්තය හස්ත කර්මාන්ත නව කර්මාන්ත ස්වභාවික පරිසරය ශ්රී ලංකාවේ ලෝක උරුමයන් ශ්රී ලංකාවට ආවේනික කුරුල්ලෝ ශ්රී ලංකාවට ආවේනික ක්ෂීරපායීන් ලැයිස්තුව දියඇලි ශ්රී ලංකා ක්රීඩා ශ්රි ලංකාව සහ එංගලන්තය අතර ටෙස්ට් තරඟය මාර්තු ක්රීඩාංගනය නිල වශයෙන් ශ්රී ලංකාවේ ජාතික ක්රීඩාව වොලිබෝල් වුවද ජනප්රියතම ක්රීඩාව ක්රිකට්ය ජල ක්රීඩා පාපන්දු සහ ටෙනිස් මෙන් ම රග්බි ද බොහෝ ජනප්රිය ක්රීඩාවන් වෙයි ශ්රී ලංකාවේ පාසල් උසස් අධ්යාපන ආයතන යනාදිය ක්රීඩා සහ මලල ක්රීඩා කණ්ඩායම් සංවිධානය කරමින් පළාත් හා ජාතික මට්ටමින් ක්රීඩා තරඟ වලට සහභාගී වෙති ඉතාම දුර්වල තත්වයක සිටි ශ්රී ලංකා ක්රිකට් කණ්ඩායම ගණන් වල සිට සැළකිය යුතු ජයග්රහණ අත්පත් කරගනිමින් ඉදිරියට පැමිණ ලෝක කුසලානයද සහ වර්ෂ වල ආසීයානු කුසලානය ද දිනා ගත්තේය ලෝකයේ ක්රිකට් ක්රීඩා කරන ප්රධාන රටවල් වලින් එකක් ලෙස ඉදිරියට පැමිණි ශ්රී ලංකාව ලෝක කුසලාන තරඟාවලියේ අවසාන මහා තරඟය දක්වා පැමිණියේය එහිදි ඔව්හු ඕස්ට්රේලීයාවට පරාද වූහ ලන්ඩන් ඔලිම්පික් උළෙලේ මීටර් පිරිමි කඩුලු මතින් දිවීමේ තරගයෙදි ඩන්කන් වයිට් මහතා විසින් රිදී පදක්කමක් ජය ගෙන මුල්ම ඔලිම්පික් පදක්කම ශ්රි ලංකාවට ගෙන එනු ලැබුවා තවද වසරේ සිඩ්නි ඔලිම්පික් කාන්තා මීටර් තරගයෙදි සුසන්තිකා ජයසිංහ විසින් එක් රිදී පදක්කමක් ජය ගෙන තිබේ සිංහල ස්පෝට්ස් ක්ලබ් ආර් ප්රේමදාස ක්රීඩාංගනය සහ රන්ගිරි දඹුලු ක්රීඩාංගනය මෙන්ම ගාල්ල ජාත්යන්තර ක්රීඩාංගනය වැනි ක්රීඩාංගන රාශියක් ශ්රී ලංකාවේ තිබේ ලෝක කුසලාන තරඟාවලියේදී ශ්රි ලංකාව ඉන්දියාව සහ පාකිස්ථානය සමග තරඟ වැදුනු අතර ආසීයානු කුසලාන තරඟාවලී කීපයකටද සහභාගී වූහ එමෙන්ම එය දී පැවැත්වෙන ලෝක කුසලාන තරඟාවලියටද සහභාගී වෙයි වෙරළ අසබඩ ද නිසල ජල තටාකවල ද පැවැත්වෙන බෝට්ටු තරඟ දිය මත ලිස්සා යාම පිහිනීම දියට පැනීමේ සහ කිමිදීමේ ක්රීඩා ආදී ජල ක්රීඩා ශ්රී ලාංකිකයන්ගේ මෙන් ම විදේශ සංචාරකයන්ගේ ද සිත් පැහැර ගනී ආශ්රිත ලිපි ජාතික ගීය ශ්රී ලංකාවේ උප බෙදීම් ශ්රී ලාංකිකයෝ මූලාශ්ර සෙන්සස් ඔෆ් පොපියුලේෂන් ඇන්ඩ් හවුසිං එනියුමරේෂන් ස්ටේජ් ෆෙබ්රැවරි මාර්ච් ශ්රී ලංකා ජන සංගණන හා සංඛ්යාලේඛන දෙපාර්තමේන්තුව දෙසැම්බර් දින මුල් පිටපත වෙතින් සංරක්ෂණය කරන ලදී සම්ප්රවේශය ජූලි වර්ල්ඩ් ඉකොනොමික් අවුට්ලුක් ඩේටාබේස් ඔක්තෝම්බර් ජාත්යන්තර මූල්ය අරමුදල සම්ප්රවේශය ඔක්තෝම්බර් ලෝක බැංකුව සම්ප්රවේශය මාර්තු හියුමන් ඩිවලොප්මන්ට් රිපෝර්ට් ස්ටැටිස්ටිකල් ඇනෙක්ස් එක්සත් ජාතීන්ගේ සංවර්ධන වැඩසටහන සම්ප්රවේශය දෙසැම්බර් සම්ප්රවේශය සම්ප්රවේශය ශ්රී ලංකාව මාතෘකා දළ විශ්ලේෂණය සංක්ෂිප්තය සුචිය ග්රන්ථාවලිය කාලරේඛාව වර්ෂ ඉතිහාසය යුග ප්රාග්ඉතිහාසය මුල්කාලීන රාජධානි යුගය අනුරාධපුර යුගය පොළොන්නරු යුගය සංක්රාන්ති යුගය දහසයවන සියවසේ අර්බුදය මහනුවර යුගය බ්රිතාන්ය ලංකාවේ ඉතිහාසය ශ්රී ලංකාවේ ඉතිහාසය වර්තමානය වැදත් කාලපරිච්ඡේද මහාවංසය විජය තම්බපණ්ණි උපතිස්ස නුවර අනුරාධපුර පොළොන්නරුව යාපනය දඹදෙණිය ගම්පොළ කෝට්ටේ සීතාවක මහනුවර පෘතුගීසී ලංකාව ලන්දේසි ලංකාව බ්රිතාන්ය ලංකාව මහනුවර යුද්ධ ඌව කැරැල්ල මාතලේ කැරැල්ල නිදහස් ව්යාපාරය ලංකා විජිතය සිවිල් යුද්ධය මාතෘකා වංශකථා පුරාතන අගනුවරවල් රජවරු ජන විකාශන අර්ථික අධ්යාපනය යුධ රජය නීතිය ආණ්ඩුක්රම ව්යවස්ථාව ව්යවස්ථාදායක මණ්ඩලය විධායකය ජනාධිපති විධායක කාර්යාලය කැබිනට් මණ්ඩලය අමාත්යාංශ පරිපාලන සේවාව ජාතික ආරක්ෂක මණ්ඩලය නීතිය බලායනය අධිකරණය ශ්රේෂ්ඨාධිකරණය අභියාචනාධිකරණය මහාධිකරණ දිස්ත්රික් අධිකරණ මහේස්ත්රාත් අධිකරණ ප්රාථමික අධිකරණ කම්කරු උසාවිය ව්යවස්ථාදායකය පාර්ලිමේන්තුව අග්රාමාත්ය කාර්යාලය කථානායක නියෝජ්ය කථානායක සහ කමිටු සභාපති නියෝජ්ය කමිටු සභාපති සභා නායක විපක්ෂ නායක ලේකම් ජනරාල් වන පාර්ලිමේන්තුව සාමාජිකයින් ජාතික ආරක්ෂාව ආරක්ෂක හමුදා ගුවන් හමුදාව යුද්ධ හමුදාව නාවික හමුදාව වෙරළාරක්ෂක සේවය බුද්ධි අංශ රාජ්ය බුද්ධිමය සේවාව හමුදා බුද්ධි අංශ අධ්යක්ෂක මණ්ඩලය අපරාධ පරීක්ෂණ දෙපාර්තමේන්තුව ශ්රී ලංකා පොලිස් සේවය දේශපාලන මැතිවරණ කොට්ඨාස මැතිවරණ විදේශ සබඳතා පක්ෂ ශ්රී ලංකා නිදහස් පක්ෂය එක්සත් ජාතික පක්ෂය අපවාද පළාත් රජය ප්රාදේශීය රජය භූගෝල විද්යාව පරිපාලන කොට්ඨාස පළාත් දිස්ත්රික්ක ප්රාදේශීය ලේකම් කොට්ඨාස නගර සභා පුරවර මහානගර ඡන්ද කොට්ඨාස ග්රාම නිලධාරී කොට්ඨාස නගර පාරිසරික කලාප පරිසරය අත්යන්ත ලක්ෂ්ය දූපත් කඳු පිදුරුතලාගල මධ්ය කඳුකරය හන්තාන කඳුකර කලාපය නකල්ස් කඳුකර ප්රදේශය ජාතික උද්යාන ආරක්ෂිත ප්රදේශ ගංගා මහවැලි මල්වතු කැලණි කලු ගිං දියඇළි වනජීවීන් ආර්ථිකය කෘෂිකර්මාන්තය බැංකුකරණය මහ බැංකුව සන්නිවේදනය සමාගම් බලශක්තිය තොරතුරු තාක්ෂණය රාජ්ය ණය පර්යේෂණ රුපියල කොටස් වෙළඳපොල බදු ක්රමය වෙළඳාම ප්රවාහනය විරැකියාව කර්මාන්ත බීර කුරුඳු පොල් කෝපි මැණික් සහල් රබර් සීනි තේ සංචාරක කර්මාන්තය සමාජය මාතෘකා උපත ජන විකාශනය අධ්යාපනය සෞඛ්යය භාෂා සිංහල දෙමළ මාධ්ය ජනයා මහජන නිවාඩු දින ආගම සමාජ පන්ති ක්රීඩා සංස්කෘතිය වාස්තු විද්යාව කලා සිනමාව සූපවේදය නර්තනය විලාසිතා ධජය ජනශ්රැතිය සාහිත්යය සංගීතය ජාතික සංකේත දර්ශනය ගුවන් විදුලිය රූපවාහිනිය වේදිකා නාට්ය ලෝක උරුම අඩවි වාද විෂයයන් මරණ දඬුවම අපරාධ ලිංග අසමානතාව මානව අයිතිවාසිකම් සංක්රමණය නීතිවිරෝධී සංක්රමණය අන්තර්ජාතික ශ්රේණිගත කිරීම් ඉතිහාසය අයිතීන් දරිද්රභාවය ත්රස්තවාදය ග්රන්ථය ප්රවර්ගය ද්වාරය විකිව්යාපෘතිය බාහිර යොමු ශ්රී ලංකා රජය රාජ්ය තොරතුරු කේන්ද්රය සංරක්ෂණය කළ පිටපත ජනලේඛන හා සංඛ්යාලේඛන දෙපාර්තමේන්තුව ශ්රී ලංකා රජයේ නිල පුවත් වෙබ් අඩවිය සංරක්ෂණය කළ පිටපත ග්රී ලාංකීය ඉතිහාසයේ පින්තූර ආසියාවේ රටවල් ස්වාධීන රාජ්යයන් අසර්බයිජාන් ආර්මේනියාව ඇෆ්ගනිස්ථානය ඉන්දුනීසියාව ඉරාකය ඉරානය ඊජිප්තුව ඊශ්රායලය උස්බෙකිස්ථානය එක්සත් අරාබි එමීර් රාජ්යය ඕමානය කටාර් කසක්ස්තානය කාම්බෝජය කීර්ගිස්තානය කුවේට් උතුරු කොරියාව දකුණු කොරියාව චීනය ජපානය ජෝර්ජියාව ජෝර්දානය ටජිකිස්ථාන් තායිලන්තය තුර්කිය නැගෙනහිර ටිමෝරය ටිමෝර් ලෙස්ටේ නේපාලය පලස්තීනය පාකිස්ථානය පිලිපීනය බංගලාදේශය බහරේන් මියන්මාරය බෲනායි ඉන්දියාව භූතානය මැලේසියාව මාලදිවයින මොංගෝලියාව යේමනය රුසියාව ලාඕසය ලෙබනනය වියට්නාමය ශ්රී ලංකාව සයිප්රස් සවුදි අරාබිය සිංගප්පූරුව සිරියාව සීමිත පිළිගැනීමක් ඇති රාජ්යයන් ඇබ්ඛසියාව උතුරු සයිප්රසය තායිවානය දකුණු ඔසීෂන්ස් නැගෝනෝ කැරබැක් යටත් ප්රදේශ සහ විශේෂ පාලන ප්රදේශ එක්සත් රාජධානිය ඇක්රෝටිරි සහ ඩෙකේලියා බ්රිතාන්ය ඉන්දීය සාගර ප්රදේශය ඔස්ට්රේලියාව නත්තල් දූපත කොකෝස් කීලින් දූපත චීනය හොංකොං මැකාවු ශ්රී ලංකාව වෙතින් සම්ප්රවේශනය කෙරිණි ප්රවර්ග ශ්රී ලංකාව සාර්ක් රටවල් පොදු රාජ්ය මණ්ඩලයේ රටවල් ආසියාතික රටවල් සැඟවුණු ප්රවර්ග විකිපීඩියාවෙහි වැරදි ආරක්ෂිත සැකිලි අඩංගු පිටු විශේෂයෙන් සඳහන් කොට ඇති සිංහල භාෂා පෙළ ඇතුළත් ලිපි ඉංග්රීසි භාෂා පෙළ ඇතුළත් ලිපි දෙමළ භාෂා පෙළ ඇතුළත් ලිපි",
        "ශ්රී ලංකා ප්රජාතාන්ත්රික සමාජවාදී ජනරජය දෙමළ කොඩිය රාජ්ය ලාංඡනය ජාතික ගීය ශ්රී ලංකා මාතා ඉංග්රීසි අගනුවර ශ්රී ජයවර්ධනපුර කෝට්ටේ පරිපාලන කොළඹ වාණිජ විශාලතම නගරය කොළඹ නිල භාෂා ව සිංහල දෙමළ ඉංග්රීසි ජනවාර්ගික කණ්ඩායම් සිංහල ශ්රි ලාංකීය දමිළ ඉන්දීය දමිළ ශ්රී ලාංකීය යෝනක බර්ගර් මැලේ වෙනත් ආගම බෞද්ධ හින්දු ඉස්ලාම් රෝමානු කතෝලික වෙනත් ක්රිස්තියානි වෙනත් ජාති නාම ය ශ්රී ලාංකික රජය ඒකීය අර්ධ ජනාධිපතිමය ප්රජාතාන්ත්රික ජනරජය කි ජනාධිපතිවරයා අනුර කුමාර දිසානායක අග්රාමාත්යවරයා හරිනි අමරසූරිය පාර්ලිමේන්තු කථානායක ජගත් වික්රමරත්න අගවිනිසුරු මුර්දු ප්රනාන්දු ව්යවස්ථාදායකය පාර්ලිමේන්තුව නිදහස මහා බ්රිතාන්යයෙන් වර්ග ප්රමාණය සම්පූර්ණ වන ස්ථානය ජලය ජනගහණය ජන සංගණනය වන ස්ථානය ඝණත්වය වන ස්ථානය දදේනි ක්රශසා ඇස්තමේන්තුව සම්පූර්ණ ඇ ඩො බි ඒක පුද්ගල ඇ ඩො දදේනි නාමික ඇස්තමේන්තුව සම්පූර්ණ ඇ ඩො බි ඒක පුද්ගල ඇ ඩො ගිනි පහළ මාසද ඉහළ වන ස්ථානය ව්යවහාර මුදල ශ්රී ලංකා රුපියල වේලා කලාපය දින ආකෘති ඉංග්රීසි සිංහල රිය ධාවන මං තීරුව වම ඇමතුම් කේතය අන්තර්ජාල ලංකා වෙබ් අඩවිය මෙම ලිපිය රට පිලිබඳ වේ වෙනත් භාවිතා සඳහා ලංකාව බලන්න ශ්රී ලංකාව බ්රිතාන්ය පාලන සමයේ දී සිලෝන් ලෙස හැඳින්වු අතර වර්තමානයේ නිල වශයෙන් ශ්රී ලංකා ප්රජාතාන්ත්රික සමාජවාදී ජනරජය ලෙස හදුන්වයි ශ්රී ලංකාව සෙරන්ඩිබ් සිලොන් දීප්තිමත් දිවයින ධර්ම දිවයින ඉන්දියන් සාගරයේ මුතු ඇටය නමින්ද හදුන්වයි විවිධ නම් ගණනාවකින් පුරාණයේ හැඳින්වූ මෙම දූපත නම් දහසක් ඇති දූපත ලෙස ප්රචලිත ද විය මෙය දකුණු ආසියානු දූපතකි එය ඉන්දියානු සාගරයේ බෙංගාල බොක්කෙහි නිරිත දෙසින් සහ අරාබි මුහුදේ ගිනිකොන දෙසින් පිහිටා ඇත එය ඉන්දියානු උප මහද්වීපය මන්නාරම් බොක්ක සහ පෝක් සමුද්ර සන්ධිය මගින් වෙන් කරනු ලැබේ ශ්රී ලංකාවේ පිහිටීම ප්රධාන මුහුදු මාර්ගවල පිහිටීම හේතුවෙන් බටහිර ආසියාව සහ අග්නිදිග ආසියාව අතර උපායමාර්ගික නාවික සම්බන්ධකයක් ලෙස එය පුරාණ කාලයේ සිටම භාවිතය ගැණුනි ඉන්දියානු ජනරජය සහ ශ්රී ලංකා ජනරජය මාර්තු වන දින මනාර් බොක්ක සහ බෙංගාල බොක්කෙහි සමුද්ර මායිම් ස්ථාපිත කරමින් ගිවිසුමක් අත්සන් කරන ලදී ශ්රී ලංකාවට ආසන්න ම රටවල් ලෙස ඉන්දියාව සහ මාලදිවයින හැදින්විය හැකි ය ශ්රී ලංකාවේ විශාලත්වය වර්ග කි මී වර්ග සැතපුම් වේ එය ලොව වැනි විශාලතම රට වන අතර විශාලතම දූපත් අතරින් වන ස්ථානයෙ සිටියි එහි භූමි ප්රදේශය පළාත් නවයකට සහ දිස්ත්රික්ක විසිහතරකට වෙන් කර ඇත රට පළාත් කින් දිස්ත්රික්ක හා ප්රදේශිය ලේකම් කොට්ටාශය හා ග්රාම නිලධාරි කොට්ටාශ කින් සමන්විත වේ අගනුවර ශ්රී ජයවර්ධනපුර කොට්ටේ වන අතර විශාලතම නගරය කොළඹ වේ කොළඹ ජාතියේ ආර්ථික දේශපාලන කේන්ද්රස්ථානයයි ශ්රී ලංකාව ලෝක උරුම ස්ථාන අටක් සැතපුම් ගණනක් පුරා විහිදුනු රන්වන් වැලි සහිත වෙරළ වල් වැසි වනාන්තර සහ කඳුකර තේ වතු සහිත ඉතා සුන්දර දූපතකි නිවර්තන වනාන්තර වෙරළ සහ භූ දර්ශනවල ස්වභාවික සුන්දරත්වය ජෛව විවිධත්වය මෙන්ම පොහොසත් සංස්කෘතික උරුමයන් සඳහා ප්රසිද්ධය එය ලෝක ප්රසිද්ධ සංචාරක ගමනාන්තයක් බවට පත් කළේය ශ්රී ලංකාවේ ජනගහනය මිලියන කට ආසන්න වේ එය දූපතක ජීවත් වන වන විශාලතම ජනගහනය යි ශ්රී ලංකාවේ ජනගහනයෙන් ථෙරවාද බෞද්ධ යන් වේ එනම් මිලියන ක් පමණ වේ එය ලොව හෝ වන විශාලතම බෞද්ධ ජනගහය ක් වෙසෙන රට වේ ශ්රී ලංකාවේ ජාතික ආගම ථෙරවාද බෞද්ධ වන අතර හින්දු භක්තිකයන් ඉස්ලාම් භක්තිකයන් ක්රිස්තියානි භක්තිකයන් නිරාගමිකයන් සහ වෙනත් ආගමිකයෝ වෙති බහුවිධ හා බහුසංස්කෘතික රාජ්යයක් වන ශ්රී ලංකාව බොහෝ ආගම් ජන වර්ග සහ භාෂා රැසකට නිවහන වේ දිවයිනෙහි බහුතරය වූ සිංහල ජනතාවට අමතරව එහි අනෙකුත් සුළු වාර්ගික කණ්ඩායම් ලෙස ශ්රී ලාංකික දෙමළ ඉන්දියානු දෙමළ මරක්කල බර්ගර් මැලේ කාපිරි සහ ස්වදේශීය වැදි ජනතාව වාසය කරනු ලබයි නිල භාෂාව සිංහල භාෂාව සහ දෙමළ භාෂාව වේ ශ්රී ලංකාව යනු පොහොසත් සංස්කෘතික උරුමයක් ඇති රටකි ශ්රී ලංකාවේ ලිඛිත ඉතිහාසය වසර ක් පමණ අතීතයට විහිදෙන අතර සහ සාක්ෂ්ය සහිත ප්රාග් ඓතිහාසික මානව ජනාවාසයන්ගේ ඉතිහාසය අවම වශයෙන් වසර ක් දක්වා විහිදේ ඉතා පොහොසත් බෞද්ධ උරුමය ක් සතු ශ්රී ලංකාවේ ප්රථම ඉතිහාසමය බෞද්ධ ලේඛනගත කිරීම වන පාලි ත්රිපිටකය ක්රි පූ සිව්වන ධර්ම සංගායනා සමය තෙක් දිවයයි කෝට්ටේ රාජධානියේ විශාල දේශපාලන අර්බුදකාරී කාල පරිච්ඡේදයක් තුළ පෘතුගීසීන් ශ්රී ලංකාවට පැමිණ දිවයිනේ සමුද්ර වෙළඳාම පාලනය කිරීමට උත්සාහ කළ අතර ශ්රී ලංකාවේ කොටසක් පසුව පෘතුගීසි සන්තකයක් බවට පත්විය සිංහල පෘතුගීසි යුද්ධයෙන් පසු ලන්දේසීන් සහ මහනුවර රාජධානිය එම ප්රදේශ පාලනය කර ගත්හ පසුව ලන්දේසි දේපල බ්රිතාන්යය න් විසින් අත්පත් කර ගත් අතර පසුව ඔවුන් මුළු දිවයිනම තම පාලනය ව්යාප්ත කර සිට දක්වා එය යටත් විජිතයක් බවට පත් කළහ ශ්රී ලංකාවේ වඩාත් මෑත ඉතිහාසය වසර ක සිවිල් යුද්ධය කින් විනාශ වූ අතර එය දී ආරම්භ වී දී තීරණාත්මක ලෙස අවසන් වූයේ ශ්රී ලංකා සන්නද්ධ හමුදාව දෙමළ ඊළාම් විමුක්ති කොටි සංවිධානය පරාජය කිරීමත් සමඟ ය ශ්රී ලංකාවේ චන්ද්රිකා ඡායාරූපයක් ශ්රී ලංකාව අර්ධ ජනාධිපතිමය ක්රමය යටතේ පාලනය වන ඒකීය ජනරජයක් වේ ශ්රී ලංකාව සතු විදේශ සබඳතා දිගු ඉතිහාසයකින් සමන්විතය ශ්රී ලංකාව දකුණු ආසියානු කලාපීය සහයෝගීතා සංවිධානයේ සාර්ක් සංවිධානය ආරම්භක සාමාජිකයෙකු වන අතර එක්සත් ජාතීන් පොදු රාජ්ය මණ්ඩලය ජී සහ නොබැඳි ජාතීන් යන සංවිධානවලද වත්මන් සාමාජිකයෙකු වේ කුරුඳු තේ කෝපි රබර් සහ පොල් නිෂ්පාදනය සහ අපනයනය සඳහා ප්රසිද්ධ ශ්රී ලංකාව ප්රගතිශීලී නවීන කාර්මික ආර්ථිකයක් දරයි ශ්රී ලංකාව සංවර්ධනය වෙමින් පවතින රට ක් වන අතර මානව සංවර්ධන දර්ශකයේ වැනි ස්ථානයට පත්ව ඇත එය සංවර්ධනය අතින් ඉහළම ශ්රේණිගත දකුණු ආසියානු ජාතිය වන අතර දකුණු ආසියාවේ දෙවැනි ඉහළම ඒක පුද්ගල ආදායම ද ඔවුනට හිමිය වෙනත් නම් විවිධ නම් ගණනාවකින් පුරාණයේ හැඳින්වූ මෙම දූපත නම් දහසක් ඇති දූපත ලෙස ප්රචලිත ද විය ශ්රී ලංකාව සෙරන්ඩිබ් සිලොන් දීප්තිමත් දිවයින ධර්ම දිවයින ඉන්දියන් සාගරයේ මුතු ඇටය ඉන්දියාවේ කඳුළු බිඳුව යන නමින්ද අතීතයේ දී අපරදිග විදේශිකයන් විසින් නිල වශයෙන් හෙලංකා ලංකා සිංහලේ යනුවෙන්ද අරාබිවරුන් සීලාන් සිලෝන් සෙරන්දිබ් සහ තැප්රෝබේන් යන නම්වලින් ද සිව් හෙළය හෙළය තම්බපන්නි සීලදීප රත්නදීප හා පෙරදිග ධාන්යාගාරය ආදී අන්වර්ථ නාමවලින් ද සහ විරුදාවලිවලින් ද හදුන්වයි දෑත් එක්කොට ආයුබෝවන් ආයිබෝං කීම ශ්රී ලාංකික සිංහලයන් අන් අය පිළි ගැනීමට භාවිතා කරන සාම්ප්රදායික ක්රමයයි එහි යටත් විජිත කාලය තුළ දිවයිනට සිලෝන් යන නම ලැබුණි එය පසුව යටත් විජිත කාලය අවසන් වන තුරුම දිගටම භාවිතා විය සිලෝන් නමින් වර්තමානයේ හැඳින්වූයේ නැතත් වර්තමානයේ විවිධ දේශීය ව්යාපාර සඳහා සිලෝන් යන නාමය භාවිත කිරීම සුලභ දෙයකි ඉන්දියාවේ කඳුළු බිඳුව ලෙස ශ්රී ලංකාව හැඳින්වීමට ශ්රී ලංකාවේ විශේෂ හැඩය සහ ඉන්දියාවට සමීප වීම හේතු විය ඉතිහාසය ප්රාග් ඓතිහාසික යුගය ශ්රී ලංකාවේ හෝමෝ ඉරෙක්ටස් මිනිසුන් තරම් ඈතක සිට ඇති බවට සාක්ෂි ඇත ගල් යුගය ගල් යුගය ආසන්න වශයෙන් වසර කට පෙර සිට ක්රි පූ දක්වා පැවතිණි පැලියොලිතික් යුගය ඉරණමඩු හි සොයාගැනීම්වලින් පෙනී යන්නේ ශ්රී ලංකාවේ තරම් ඈත අතීතයේ පැලියොලිතික් මිනිසුන් සිටි බවයි ශ්රී ලංකා භූමියේ පැලියොලිතික් යුගයට අයත් ප්රධාන ප්රදේශ ක පදිංචිකරුවන් සොයා ගත හැකි විය පහතරට වියළි කලාපය පහතරට අර්ධ ශුෂ්ක කලාපය පහතරට වියළි කලාපය පහතරට අතරමැදි වියළි කලාපය කඳුකර වියළි අතරමැදි කලාපය පහතරට අතරමැදි තෙත් කලාපය තෙත් කඳු කලාපය තෙත් උස්බිම් කලාපය ආණ්ඩුව ප්රධාන ලිපිය ශ්රී ලංකා ප්රජාතාන්ත්රික සමාජවාදී ජනරජය ශ්රී ලංකාව ඒකීය රාජ්යයක් වන අතර එහි ආණ්ඩුව ශ්රී ලංකා ප්රජාතාන්ත්රික සමාජවාදී ජනරජය නම් වේ එතෙක් සිලෝන් හෙවත් ලංකා නම් වූ රාජධානිය අහෝසි කොට මැයි දින ශ්රී ලංකා සමාජවාදී ජනරජය පිහිටුවන ලදී දී ශ්රී ලංකා ප්රජාතාන්ත්රික සමාජවාදී ජනරජය පිහිටුවන ලදී අගනුවර අග නගරය ශ්රී ජයවර්ධනපුර කෝට්ටේ වේ එහි වාණිජ අග නගරය වන්නේ කොළඹ නගරයයි වර්ග ප්රමාණය ප්රධාන ලංකා දූපත අභ්යන්තර සමුද්ර ජල ප්රදේශය ඓතිහාසික මුහුද රාෂ්ට්රීය මුහුද යාබද මුහුද පරම ආර්ථික කලාපය සමස්ථ වර්ගඵලය ශ්රී ලංකාවේ ජාතික සංකේත ජාතික පක්ෂියා ශ්රී ලංකා වලිකුකුලා ය්ජ් ජාතික සත්ත්වයා ශ්රී ලංකා දඩුලේනා ජාතික වෘක්ෂය නා ගස ජාතික පුෂ්පය මානෙල් මල ජාතික මාණික්යය නිල් මැණික මෙහි වැඩිදුර අධ්යයනයක් සදහා ශ්රී ලංකාවේ ජාතික සංකේත වෙත පිවිසෙන්න ශ්රී ලංකාවේ අතීතය ප්රධාන ලිපිය ශ්රී ලංකාවේ අතීතය ප්රාග් ඓතිහාසික යුගය ලංකාවේ ප්රාග් ඓතිහාසික යුගය අධ්යයනය කිරීමේ පහසු ව සඳහා පහත පරිදි යුග වලට බෙදා අධ්යයනය කරනු ලැබේ පුරාශිලා යුගය මධ්යශිලා යුගය නවශිලා යුගය සිදුකර ඇති පුරාවිද්යා පර්යේෂණ අනුව ලංකාවේ මානව යටගියාව පිළිබඳ සාධක අදින් වසර දක්වා ඈතට දිවයයි ලංකාවේ වයඹදිග හා ගිණිකොණදිග ප්රදේශයන්ගේ වෙරළාශ්රීත ප්රදේශවල ව්යාප්තව ඇති ඉරණමඩු පාංශු සංකීර්ණයට අයත් බූන්දල වැල්ලෙගංගොඩ හා පතිරාජවෙල යන ස්ථානයන්ගේ සිදුකරන ලද පුරාවිද්යා පර්යේෂණ අනුව මෙම කරුණු තහවුරු වී ඇත ඓතිහාසික යුගය ප්රථම නවීන අගනුවර ලෙස අනුරාධපුරය සැලකෙන අතර රාජ්ය පරපුරේ අවසානය සෙංකඩගල නගරය විය යටත් විජිත යුගය වර්ෂ දී පෘතුගීසීන් ලංකාව ආක්රමණය කරන ලදී පරංගින්ගේ මුලික අවශ්යතාව වූයේ ඔවූන්ගේ ආගම හා වෙළඳාම පැතිරවීමයි පසුව ඕලන්ද ලන්දේසීන් හා ඉංග්රීසි අධිරාජ්යවාදීන්ගේ ද තාඩන පීඩනවලට ලක්විය මෙම ආකාරයෙන් වූ තාඩන පීඩනයන්ගෙන් මීදීම සදහා උඩරට ගිවිසුම නමින් දී ඉංග්රිසීන් සමඟ අත්සන් කරන ලද ගිවිසුම ඔවුන් විසින් ම උල්ලංඝනය එහි ජනතාව පිට යටත් විජිත මානසිකත්වයක් මවමින් දක්වා දරුණු පාලනයක් ගෙන ගියහ මේ අතරතුර කාලයේදී ලාංකික ජනතාව දී සහ දී කැරලි දියත් කලේය ශ්රී ලංකා සමාජවාදී ජනරජය ප්රධාන ලිපිය ශ්රී ලංකා සමාජවාදී ජනරජය කොටි ත්රස්තවාදය අවුරුදු කට ආසන්න කාලයක් තුල රටේ බෙදීමක් ඇති කිරීමට ත්රස්තවාදී කණ්ඩායමක් වන දෙමළ ඊලාම් කොටි එල්ටීටීඊ සංවිධානය තැත් කළද වසරේදී එම සංවිධානය රටින් මුලිනුපුටා දමා රටට සාමය ඇතිවී ඇත ශ්රී ලංකාවේ පුරාවස්තු ප්රධාන ලිපිය ශ්රී ලංකාවේ පුරාවිද්යා ආරක්ෂිත ස්මාරක ලැයිස්තුව භූගෝලය ප්රධාන ලිපිය ශ්රී ලංකාවෙහි භූගෝලය ශ්රී ලංකාවෙහි භූ ලාක්ෂණික සිතියම ස්වභාවික ව්යසන ශ්රී ලංකාව ස්වභාවික ව්යසන අවම රටකි නමුත් වර්ෂාව නිසා ඇතිවන ව්යසන නිතර දැකිය හැක ක්රි ව වසරේ දෙසැම්බර් වනදා බලපෑ සුනාමිය ව්යසනය ශ්රී ලංකාවේ වාර්තාගත දරුණුතම ස්වභාවික ව්යසනය වේ ශාක සහ සත්ත්ව සංහතිය ප්රධාන ලිපිය ලංකා දූපතේ ශාක සහ සත්ත්ව සංහතිය විවිධත්වය සහ ආවේණිකත්ය අතින් ශ්රී ලංකාවේ ශාක සංහතිය ඉහළ අගයක් ගනී ශ්රී ලංකාවේ ගණ කට අයත් සපුෂ්පක ශාක ක් ඇත්තේය විශේෂ සහ ගණ ක් දිවයිනට ආවේණික වේ මීට අමතරව දිවයිනෙහි ඇති හොර කුලයේ ශාක විශේෂ න් එකක් හැර අනෙක්වා සියල්ලම ශ්රී ලංකාවට සීමා වේ මෑතකදී අගය නො කරන ලද මුත් ශ්රී ලංකාවේ මීවන ප්රමාණය ක් පමණ වේ සියළු ජීවී කාණ්ඩවල විවිධත්වය සාරවත්භාවය සහ ආවේණිකත්ය අතින් තෙත් කලාපය වියළි කලාපයට වඩා ඉතා ඉදිරියෙන් සිටියි තෙත් කලාපය භූමි ප්රමාණයෙන් දිවයිනෙන් හතරෙන් එකක් වන නමුත් සපුෂ්පක ශාක විශේෂවලින් සියයට කට සහ ආවේණික සපුෂ්පක ශාක විශේෂවලින් සියයට කට රැකවරණය සළසයි ශ්රී ලංකාවේ ස්වභාවික වනාන්තර කොටස් අටකට කාණ්ඩ කරයි ශ්රී ලංකාවේ උප බෙදීම් ප්රධාන ලිපිය ශ්රී ලංකාවේ උප බෙදීම් පළාත් ප්රධාන ලිපිය ශ්රී ලංකාවේ පළාත් ශ්රි ලංකාව පළාත් කට බෙදා දේශපාලන බලය විමධ්යගතකර ඇත ඒවා නම් උතුරු පළාත උතුරු මැද පළාත මධ්යම පළාත වයඹ පළාත බස්නාහිර පළාත සබරගමුව පළාත ඌව පළාත දකුණු පළාත නැගෙනහිර පළාත පරිපාලන දිස්ත්රික්ක ප්රධාන ලිපිය ශ්රී ලංකාවේ පරිපාලන දිස්ත්රික්ක ශ්රී ලංකාව පරිපාලනය දිස්ත්රික් ක් වශයෙනි ජනතාව ජනගහණය ජන සංගණනය අනුව සමාජය බහු සංස්කෘතිකමය රටකි ශ්රී ලංකාවේ බහුතරය සිංහල ජාතිකයෝ වේ රාජ්ය ආගම බුද්ධාගමය පෙරදිග සංස්කෘතියට අනුගත සමාජයකි ජාතීන් සිංහල දෙමළ මරක්කල බර්ගර් මැලේ වැදි ආදී විවිධ ජාතින් ජීවත්වේ ශ්රි ලංකාවෙහි ප්රධාන හා පාරම්පරික කර්මාන්තය ගොවිතැනය භාෂා ප්රධාන ලිපිය ශ්රී ලංකාවේ භාෂා සිංහල සහ දෙමළ රාජ්ය භාෂාවේ ඉංග්රීසි පිළිගත් සමිබන්ධීකරණ භාෂාවයි නිල තත්ත්වයක් නොමැති වුවද මලයාලම් වැදි බස මැලේ ආදී භාෂා අදාල ජාතීන් භාවිතා කරයි ආගම් ප්රධාන ලිපිය ශ්රී ලංකාවේ ආගමික විවිධත්වය ප්රධාන ආගම බුදු දහම වේ බුද්ධාගම සහ පුරාණ හෙල ඇදහිලි හින්දු රෝමානු කතෝලික ක්රිස්තියානි ඉස්ලාම් වර්ෂය බෞද්ධ හින්දු ඉස්ලාම් කතෝලික වෙනත් එකතුව සංඛ්යව සංඛ්යව සංඛ්යව සංඛ්යව සංඛ්යව සංඛ්යව සංගණනය සංගණනය සංගණනය සංගණනය සංගණනය තක්සේරුව සංගණනය සංගණනය සංගණනය සංගණනය සංගණනය බොජුන් ජාතික ආහාරය බත් වේ බත් සහ ව්යංජන දෙක ම මෙම වචනයෙන් අදහස් කෙරේ දේශපාලනය ප්රධාන දේශපාලන පක්ෂ තනි පක්ෂ ශ්රී ලංකා නිදහස් පක්ෂය එක්සත් ජාතික පක්ෂය ජනතා විමුකිති පෙරමුණ හවුල් සංධාන එක්සත් ජනතා නිදහස් සංධානය එක්සත් ජාතික පෙරමුණ ප්රජාතන්ත්රවාදී ජාතික සංධානය අධ්යාපනය ප්රධාන ලිපිය ශ්රී ලංකාවේ අධ්යාපනය ආර්ථිකය සමාජවාදී සහ ධනවාදී ලක්ෂණ මිශ්ර ආර්ථික ක්රමයක් පවතී මූලිකවම කෘෂිකාර්මික රටකි මහ බැංකු වාර්තාව අනුව වසරේදි ශ්රී ලංකාව සියයට ක ආර්ථික වර්ධනයක් වාර්තා කර ඇත කෘෂීකර්මය දේශීය පරිභෝජනය සඳහා වී ගොවිතැන පොල් වගාව අපනයන බෝග ශ්රී ලංකාවේ තේ රබර් කුළු බඩු කර්මාන්ත සාම්ප්රදායික කර්මාන්ත ශ්රී ලංකාවේ ධීවර කර්මාන්තය හස්ත කර්මාන්ත නව කර්මාන්ත ස්වභාවික පරිසරය ශ්රී ලංකාවේ ලෝක උරුමයන් ශ්රී ලංකාවට ආවේනික කුරුල්ලෝ ශ්රී ලංකාවට ආවේනික ක්ෂීරපායීන් ලැයිස්තුව දියඇලි ශ්රී ලංකා ක්රීඩා ශ්රි ලංකාව සහ එංගලන්තය අතර ටෙස්ට් තරඟය මාර්තු ක්රීඩාංගනය නිල වශයෙන් ශ්රී ලංකාවේ ජාතික ක්රීඩාව වොලිබෝල් වුවද ජනප්රියතම ක්රීඩාව ක්රිකට්ය ජල ක්රීඩා පාපන්දු සහ ටෙනිස් මෙන් ම රග්බි ද බොහෝ ජනප්රිය ක්රීඩාවන් වෙයි ශ්රී ලංකාවේ පාසල් උසස් අධ්යාපන ආයතන යනාදිය ක්රීඩා සහ මලල ක්රීඩා කණ්ඩායම් සංවිධානය කරමින් පළාත් හා ජාතික මට්ටමින් ක්රීඩා තරඟ වලට සහභාගී වෙති ඉතාම දුර්වල තත්වයක සිටි ශ්රී ලංකා ක්රිකට් කණ්ඩායම ගණන් වල සිට සැළකිය යුතු ජයග්රහණ අත්පත් කරගනිමින් ඉදිරියට පැමිණ ලෝක කුසලානයද සහ වර්ෂ වල ආසීයානු කුසලානය ද දිනා ගත්තේය ලෝකයේ ක්රිකට් ක්රීඩා කරන ප්රධාන රටවල් වලින් එකක් ලෙස ඉදිරියට පැමිණි ශ්රී ලංකාව ලෝක කුසලාන තරඟාවලියේ අවසාන මහා තරඟය දක්වා පැමිණියේය එහිදි ඔව්හු ඕස්ට්රේලීයාවට පරාද වූහ ලන්ඩන් ඔලිම්පික් උළෙලේ මීටර් පිරිමි කඩුලු මතින් දිවීමේ තරගයෙදි ඩන්කන් වයිට් මහතා විසින් රිදී පදක්කමක් ජය ගෙන මුල්ම ඔලිම්පික් පදක්කම ශ්රි ලංකාවට ගෙන එනු ලැබුවා තවද වසරේ සිඩ්නි ඔලිම්පික් කාන්තා මීටර් තරගයෙදි සුසන්තිකා ජයසිංහ විසින් එක් රිදී පදක්කමක් ජය ගෙන තිබේ සිංහල ස්පෝට්ස් ක්ලබ් ආර් ප්රේමදාස ක්රීඩාංගනය සහ රන්ගිරි දඹුලු ක්රීඩාංගනය මෙන්ම ගාල්ල ජාත්යන්තර ක්රීඩාංගනය වැනි ක්රීඩාංගන රාශියක් ශ්රී ලංකාවේ තිබේ ලෝක කුසලාන තරඟාවලියේදී ශ්රි ලංකාව ඉන්දියාව සහ පාකිස්ථානය සමග තරඟ වැදුනු අතර ආසීයානු කුසලාන තරඟාවලී කීපයකටද සහභාගී වූහ එමෙන්ම එය දී පැවැත්වෙන ලෝක කුසලාන තරඟාවලියටද සහභාගී වෙයි වෙරළ අසබඩ ද නිසල ජල තටාකවල ද පැවැත්වෙන බෝට්ටු තරඟ දිය මත ලිස්සා යාම පිහිනීම දියට පැනීමේ සහ කිමිදීමේ ක්රීඩා ආදී ජල ක්රීඩා ශ්රී ලාංකිකයන්ගේ මෙන් ම විදේශ සංචාරකයන්ගේ ද සිත් පැහැර ගනී ආශ්රිත ලිපි ජාතික ගීය ශ්රී ලංකාවේ උප බෙදීම් ශ්රී ලාංකිකයෝ මූලාශ්ර සෙන්සස් ඔෆ් පොපියුලේෂන් ඇන්ඩ් හවුසිං එනියුමරේෂන් ස්ටේජ් ෆෙබ්රැවරි මාර්ච් ශ්රී ලංකා ජන සංගණන හා සංඛ්යාලේඛන දෙපාර්තමේන්තුව දෙසැම්බර් දින මුල් පිටපත වෙතින් සංරක්ෂණය කරන ලදී සම්ප්රවේශය ජූලි වර්ල්ඩ් ඉකොනොමික් අවුට්ලුක් ඩේටාබේස් ඔක්තෝම්බර් ජාත්යන්තර මූල්ය අරමුදල සම්ප්රවේශය ඔක්තෝම්බර් ලෝක බැංකුව සම්ප්රවේශය මාර්තු හියුමන් ඩිවලොප්මන්ට් රිපෝර්ට් ස්ටැටිස්ටිකල් ඇනෙක්ස් එක්සත් ජාතීන්ගේ සංවර්ධන වැඩසටහන සම්ප්රවේශය දෙසැම්බර් සම්ප්රවේශය සම්ප්රවේශය ශ්රී ලංකාව මාතෘකා දළ විශ්ලේෂණය සංක්ෂිප්තය සුචිය ග්රන්ථාවලිය කාලරේඛාව වර්ෂ ඉතිහාසය යුග ප්රාග්ඉතිහාසය මුල්කාලීන රාජධානි යුගය අනුරාධපුර යුගය පොළොන්නරු යුගය සංක්රාන්ති යුගය දහසයවන සියවසේ අර්බුදය මහනුවර යුගය බ්රිතාන්ය ලංකාවේ ඉතිහාසය ශ්රී ලංකාවේ ඉතිහාසය වර්තමානය වැදත් කාලපරිච්ඡේද මහාවංසය විජය තම්බපණ්ණි උපතිස්ස නුවර අනුරාධපුර පොළොන්නරුව යාපනය දඹදෙණිය ගම්පොළ කෝට්ටේ සීතාවක මහනුවර පෘතුගීසී ලංකාව ලන්දේසි ලංකාව බ්රිතාන්ය ලංකාව මහනුවර යුද්ධ ඌව කැරැල්ල මාතලේ කැරැල්ල නිදහස් ව්යාපාරය ලංකා විජිතය සිවිල් යුද්ධය මාතෘකා වංශකථා පුරාතන අගනුවරවල් රජවරු ජන විකාශන අර්ථික අධ්යාපනය යුධ රජය නීතිය ආණ්ඩුක්රම ව්යවස්ථාව ව්යවස්ථාදායක මණ්ඩලය විධායකය ජනාධිපති විධායක කාර්යාලය කැබිනට් මණ්ඩලය අමාත්යාංශ පරිපාලන සේවාව ජාතික ආරක්ෂක මණ්ඩලය නීතිය බලායනය අධිකරණය ශ්රේෂ්ඨාධිකරණය අභියාචනාධිකරණය මහාධිකරණ දිස්ත්රික් අධිකරණ මහේස්ත්රාත් අධිකරණ ප්රාථමික අධිකරණ කම්කරු උසාවිය ව්යවස්ථාදායකය පාර්ලිමේන්තුව අග්රාමාත්ය කාර්යාලය කථානායක නියෝජ්ය කථානායක සහ කමිටු සභාපති නියෝජ්ය කමිටු සභාපති සභා නායක විපක්ෂ නායක ලේකම් ජනරාල් වන පාර්ලිමේන්තුව සාමාජිකයින් ජාතික ආරක්ෂාව ආරක්ෂක හමුදා ගුවන් හමුදාව යුද්ධ හමුදාව නාවික හමුදාව වෙරළාරක්ෂක සේවය බුද්ධි අංශ රාජ්ය බුද්ධිමය සේවාව හමුදා බුද්ධි අංශ අධ්යක්ෂක මණ්ඩලය අපරාධ පරීක්ෂණ දෙපාර්තමේන්තුව ශ්රී ලංකා පොලිස් සේවය දේශපාලන මැතිවරණ කොට්ඨාස මැතිවරණ විදේශ සබඳතා පක්ෂ ශ්රී ලංකා නිදහස් පක්ෂය එක්සත් ජාතික පක්ෂය අපවාද පළාත් රජය ප්රාදේශීය රජය භූගෝල විද්යාව පරිපාලන කොට්ඨාස පළාත් දිස්ත්රික්ක ප්රාදේශීය ලේකම් කොට්ඨාස නගර සභා පුරවර මහානගර ඡන්ද කොට්ඨාස ග්රාම නිලධාරී කොට්ඨාස නගර පාරිසරික කලාප පරිසරය අත්යන්ත ලක්ෂ්ය දූපත් කඳු පිදුරුතලාගල මධ්ය කඳුකරය හන්තාන කඳුකර කලාපය නකල්ස් කඳුකර ප්රදේශය ජාතික උද්යාන ආරක්ෂිත ප්රදේශ ගංගා මහවැලි මල්වතු කැලණි කලු ගිං දියඇළි වනජීවීන් ආර්ථිකය කෘෂිකර්මාන්තය බැංකුකරණය මහ බැංකුව සන්නිවේදනය සමාගම් බලශක්තිය තොරතුරු තාක්ෂණය රාජ්ය ණය පර්යේෂණ රුපියල කොටස් වෙළඳපොල බදු ක්රමය වෙළඳාම ප්රවාහනය විරැකියාව කර්මාන්ත බීර කුරුඳු පොල් කෝපි මැණික් සහල් රබර් සීනි තේ සංචාරක කර්මාන්තය සමාජය මාතෘකා උපත ජන විකාශනය අධ්යාපනය සෞඛ්යය භාෂා සිංහල දෙමළ මාධ්ය ජනයා මහජන නිවාඩු දින ආගම සමාජ පන්ති ක්රීඩා සංස්කෘතිය වාස්තු විද්යාව කලා සිනමාව සූපවේදය නර්තනය විලාසිතා ධජය ජනශ්රැතිය සාහිත්යය සංගීතය ජාතික සංකේත දර්ශනය ගුවන් විදුලිය රූපවාහිනිය වේදිකා නාට්ය ලෝක උරුම අඩවි වාද විෂයයන් මරණ දඬුවම අපරාධ ලිංග අසමානතාව මානව අයිතිවාසිකම් සංක්රමණය නීතිවිරෝධී සංක්රමණය අන්තර්ජාතික ශ්රේණිගත කිරීම් ඉතිහාසය අයිතීන් දරිද්රභාවය ත්රස්තවාදය ග්රන්ථය ප්රවර්ගය ද්වාරය විකිව්යාපෘතිය බාහිර යොමු ශ්රී ලංකා රජය රාජ්ය තොරතුරු කේන්ද්රය සංරක්ෂණය කළ පිටපත ජනලේඛන හා සංඛ්යාලේඛන දෙපාර්තමේන්තුව ශ්රී ලංකා රජයේ නිල පුවත් වෙබ් අඩවිය සංරක්ෂණය කළ පිටපත ග්රී ලාංකීය ඉතිහාසයේ පින්තූර ආසියාවේ රටවල් ස්වාධීන රාජ්යයන් අසර්බයිජාන් ආර්මේනියාව ඇෆ්ගනිස්ථානය ඉන්දුනීසියාව ඉරාකය ඉරානය ඊජිප්තුව ඊශ්රායලය උස්බෙකිස්ථානය එක්සත් අරාබි එමීර් රාජ්යය ඕමානය කටාර් කසක්ස්තානය කාම්බෝජය කීර්ගිස්තානය කුවේට් උතුරු කොරියාව දකුණු කොරියාව චීනය ජපානය ජෝර්ජියාව ජෝර්දානය ටජිකිස්ථාන් තායිලන්තය තුර්කිය නැගෙනහිර ටිමෝරය ටිමෝර් ලෙස්ටේ නේපාලය පලස්තීනය පාකිස්ථානය පිලිපීනය බංගලාදේශය බහරේන් මියන්මාරය බෲනායි ඉන්දියාව භූතානය මැලේසියාව මාලදිවයින මොංගෝලියාව යේමනය රුසියාව ලාඕසය ලෙබනනය වියට්නාමය ශ්රී ලංකාව සයිප්රස් සවුදි අරාබිය සිංගප්පූරුව සිරියාව සීමිත පිළිගැනීමක් ඇති රාජ්යයන් ඇබ්ඛසියාව උතුරු සයිප්රසය තායිවානය දකුණු ඔසීෂන්ස් නැගෝනෝ කැරබැක් යටත් ප්රදේශ සහ විශේෂ පාලන ප්රදේශ එක්සත් රාජධානිය ඇක්රෝටිරි සහ ඩෙකේලියා බ්රිතාන්ය ඉන්දීය සාගර ප්රදේශය ඔස්ට්රේලියාව නත්තල් දූපත කොකෝස් කීලින් දූපත චීනය හොංකොං මැකාවු ශ්රී ලංකාව වෙතින් සම්ප්රවේශනය කෙරිණි",
        "ශ්රී ලංකා ප්රජාතාන්ත්රික සමාජවාදී ජනරජය දෙමළ කොඩිය රාජ්ය ලාංඡනය ජාතික ගීය ශ්රී ලංකා මාතා ඉංග්රීසි අගනුවර ශ්රී ජයවර්ධනපුර කෝට්ටේ පරිපාලන කොළඹ වාණිජ විශාලතම නගරය කොළඹ නිල භාෂා ව සිංහල දෙමළ ඉංග්රීසි ජනවාර්ගික කණ්ඩායම් සිංහල ශ්රි ලාංකීය දමිළ ඉන්දීය දමිළ ශ්රී ලාංකීය යෝනක බර්ගර් මැලේ වෙනත් ආගම බෞද්ධ හින්දු ඉස්ලාම් රෝමානු කතෝලික වෙනත් ක්රිස්තියානි වෙනත් ජාති නාම ය ශ්රී ලාංකික රජය ඒකීය අර්ධ ජනාධිපතිමය ප්රජාතාන්ත්රික ජනරජය කි ජනාධිපතිවරයා අනුර කුමාර දිසානායක අග්රාමාත්යවරයා හරිනි අමරසූරිය පාර්ලිමේන්තු කථානායක ජගත් වික්රමරත්න අගවිනිසුරු මුර්දු ප්රනාන්දු ව්යවස්ථාදායකය පාර්ලිමේන්තුව නිදහස මහා බ්රිතාන්යයෙන් වර්ග ප්රමාණය සම්පූර්ණ වන ස්ථානය ජලය ජනගහණය ජන සංගණනය වන ස්ථානය ඝණත්වය වන ස්ථානය දදේනි ක්රශසා ඇස්තමේන්තුව සම්පූර්ණ ඇ ඩො බි ඒක පුද්ගල ඇ ඩො දදේනි නාමික ඇස්තමේන්තුව සම්පූර්ණ ඇ ඩො බි ඒක පුද්ගල ඇ ඩො ගිනි පහළ මාසද ඉහළ වන ස්ථානය ව්යවහාර මුදල ශ්රී ලංකා රුපියල වේලා කලාපය දින ආකෘති ඉංග්රීසි සිංහල රිය ධාවන මං තීරුව වම ඇමතුම් කේතය අන්තර්ජාල ලංකා වෙබ් අඩවිය මෙම ලිපිය රට පිලිබඳ වේ වෙනත් භාවිතා සඳහා ලංකාව බලන්න ශ්රී ලංකාව බ්රිතාන්ය පාලන සමයේ දී සිලෝන් ලෙස හැඳින්වු අතර වර්තමානයේ නිල වශයෙන් ශ්රී ලංකා ප්රජාතාන්ත්රික සමාජවාදී ජනරජය ලෙස හදුන්වයි ශ්රී ලංකාව සෙරන්ඩිබ් සිලොන් දීප්තිමත් දිවයින ධර්ම දිවයින ඉන්දියන් සාගරයේ මුතු ඇටය නමින්ද හදුන්වයි විවිධ නම් ගණනාවකින් පුරාණයේ හැඳින්වූ මෙම දූපත නම් දහසක් ඇති දූපත ලෙස ප්රචලිත ද විය මෙය දකුණු ආසියානු දූපතකි එය ඉන්දියානු සාගරයේ බෙංගාල බොක්කෙහි නිරිත දෙසින් සහ අරාබි මුහුදේ ගිනිකොන දෙසින් පිහිටා ඇත එය ඉන්දියානු උප මහද්වීපය මන්නාරම් බොක්ක සහ පෝක් සමුද්ර සන්ධිය මගින් වෙන් කරනු ලැබේ ශ්රී ලංකාවේ පිහිටීම ප්රධාන මුහුදු මාර්ගවල පිහිටීම හේතුවෙන් බටහිර ආසියාව සහ අග්නිදිග ආසියාව අතර උපායමාර්ගික නාවික සම්බන්ධකයක් ලෙස එය පුරාණ කාලයේ සිටම භාවිතය ගැණුනි ඉන්දියානු ජනරජය සහ ශ්රී ලංකා ජනරජය මාර්තු වන දින මනාර් බොක්ක සහ බෙංගාල බොක්කෙහි සමුද්ර මායිම් ස්ථාපිත කරමින් ගිවිසුමක් අත්සන් කරන ලදී ශ්රී ලංකාවට ආසන්න ම රටවල් ලෙස ඉන්දියාව සහ මාලදිවයින හැදින්විය හැකි ය ශ්රී ලංකාවේ විශාලත්වය වර්ග කි මී වර්ග සැතපුම් වේ එය ලොව වැනි විශාලතම රට වන අතර විශාලතම දූපත් අතරින් වන ස්ථානයෙ සිටියි එහි භූමි ප්රදේශය පළාත් නවයකට සහ දිස්ත්රික්ක විසිහතරකට වෙන් කර ඇත රට පළාත් කින් දිස්ත්රික්ක හා ප්රදේශිය ලේකම් කොට්ටාශය හා ග්රාම නිලධාරි කොට්ටාශ කින් සමන්විත වේ අගනුවර ශ්රී ජයවර්ධනපුර කොට්ටේ වන අතර විශාලතම නගරය කොළඹ වේ කොළඹ ජාතියේ ආර්ථික දේශපාලන කේන්ද්රස්ථානයයි ශ්රී ලංකාව ලෝක උරුම ස්ථාන අටක් සැතපුම් ගණනක් පුරා විහිදුනු රන්වන් වැලි සහිත වෙරළ වල් වැසි වනාන්තර සහ කඳුකර තේ වතු සහිත ඉතා සුන්දර දූපතකි නිවර්තන වනාන්තර වෙරළ සහ භූ දර්ශනවල ස්වභාවික සුන්දරත්වය ජෛව විවිධත්වය මෙන්ම පොහොසත් සංස්කෘතික උරුමයන් සඳහා ප්රසිද්ධය එය ලෝක ප්රසිද්ධ සංචාරක ගමනාන්තයක් බවට පත් කළේය ශ්රී ලංකාවේ ජනගහනය මිලියන කට ආසන්න වේ එය දූපතක ජීවත් වන වන විශාලතම ජනගහනය යි ශ්රී ලංකාවේ ජනගහනයෙන් ථෙරවාද බෞද්ධ යන් වේ එනම් මිලියන ක් පමණ වේ එය ලොව හෝ වන විශාලතම බෞද්ධ ජනගහය ක් වෙසෙන රට වේ ශ්රී ලංකාවේ ජාතික ආගම ථෙරවාද බෞද්ධ වන අතර හින්දු භක්තිකයන් ඉස්ලාම් භක්තිකයන් ක්රිස්තියානි භක්තිකයන් නිරාගමිකයන් සහ වෙනත් ආගමිකයෝ වෙති බහුවිධ හා බහුසංස්කෘතික රාජ්යයක් වන ශ්රී ලංකාව බොහෝ ආගම් ජන වර්ග සහ භාෂා රැසකට නිවහන වේ දිවයිනෙහි බහුතරය වූ සිංහල ජනතාවට අමතරව එහි අනෙකුත් සුළු වාර්ගික කණ්ඩායම් ලෙස ශ්රී ලාංකික දෙමළ ඉන්දියානු දෙමළ මරක්කල බර්ගර් මැලේ කාපිරි සහ ස්වදේශීය වැදි ජනතාව වාසය කරනු ලබයි නිල භාෂාව සිංහල භාෂාව සහ දෙමළ භාෂාව වේ ශ්රී ලංකාව යනු පොහොසත් සංස්කෘතික උරුමයක් ඇති රටකි ශ්රී ලංකාවේ ලිඛිත ඉතිහාසය වසර ක් පමණ අතීතයට විහිදෙන අතර සහ සාක්ෂ්ය සහිත ප්රාග් ඓතිහාසික මානව ජනාවාසයන්ගේ ඉතිහාසය අවම වශයෙන් වසර ක් දක්වා විහිදේ ඉතා පොහොසත් බෞද්ධ උරුමය ක් සතු ශ්රී ලංකාවේ ප්රථම ඉතිහාසමය බෞද්ධ ලේඛනගත කිරීම වන පාලි ත්රිපිටකය ක්රි පූ සිව්වන ධර්ම සංගායනා සමය තෙක් දිවයයි කෝට්ටේ රාජධානියේ විශාල දේශපාලන අර්බුදකාරී කාල පරිච්ඡේදයක් තුළ පෘතුගීසීන් ශ්රී ලංකාවට පැමිණ දිවයිනේ සමුද්ර වෙළඳාම පාලනය කිරීමට උත්සාහ කළ අතර ශ්රී ලංකාවේ කොටසක් පසුව පෘතුගීසි සන්තකයක් බවට පත්විය සිංහල පෘතුගීසි යුද්ධයෙන් පසු ලන්දේසීන් සහ මහනුවර රාජධානිය එම ප්රදේශ පාලනය කර ගත්හ පසුව ලන්දේසි දේපල බ්රිතාන්යය න් විසින් අත්පත් කර ගත් අතර පසුව ඔවුන් මුළු දිවයිනම තම පාලනය ව්යාප්ත කර සිට දක්වා එය යටත් විජිතයක් බවට පත් කළහ ශ්රී ලංකාවේ වඩාත් මෑත ඉතිහාසය වසර ක සිවිල් යුද්ධය කින් විනාශ වූ අතර එය දී ආරම්භ වී දී තීරණාත්මක ලෙස අවසන් වූයේ ශ්රී ලංකා සන්නද්ධ හමුදාව දෙමළ ඊළාම් විමුක්ති කොටි සංවිධානය පරාජය කිරීමත් සමඟ ය ශ්රී ලංකාවේ චන්ද්රිකා ඡායාරූපයක් ශ්රී ලංකාව අර්ධ ජනාධිපතිමය ක්රමය යටතේ පාලනය වන ඒකීය ජනරජයක් වේ ශ්රී ලංකාව සතු විදේශ සබඳතා දිගු ඉතිහාසයකින් සමන්විතය ශ්රී ලංකාව දකුණු ආසියානු කලාපීය සහයෝගීතා සංවිධානයේ සාර්ක් සංවිධානය ආරම්භක සාමාජිකයෙකු වන අතර එක්සත් ජාතීන් පොදු රාජ්ය මණ්ඩලය ජී සහ නොබැඳි ජාතීන් යන සංවිධානවලද වත්මන් සාමාජිකයෙකු වේ කුරුඳු තේ කෝපි රබර් සහ පොල් නිෂ්පාදනය සහ අපනයනය සඳහා ප්රසිද්ධ ශ්රී ලංකාව ප්රගතිශීලී නවීන කාර්මික ආර්ථිකයක් දරයි ශ්රී ලංකාව සංවර්ධනය වෙමින් පවතින රට ක් වන අතර මානව සංවර්ධන දර්ශකයේ වැනි ස්ථානයට පත්ව ඇත එය සංවර්ධනය අතින් ඉහළම ශ්රේණිගත දකුණු ආසියානු ජාතිය වන අතර දකුණු ආසියාවේ දෙවැනි ඉහළම ඒක පුද්ගල ආදායම ද ඔවුනට හිමිය වෙනත් නම් විවිධ නම් ගණනාවකින් පුරාණයේ හැඳින්වූ මෙම දූපත නම් දහසක් ඇති දූපත ලෙස ප්රචලිත ද විය ශ්රී ලංකාව සෙරන්ඩිබ් සිලොන් දීප්තිමත් දිවයින ධර්ම දිවයින ඉන්දියන් සාගරයේ මුතු ඇටය ඉන්දියාවේ කඳුළු බිඳුව යන නමින්ද අතීතයේ දී අපරදිග විදේශිකයන් විසින් නිල වශයෙන් හෙලංකා ලංකා සිංහලේ යනුවෙන්ද අරාබිවරුන් සීලාන් සිලෝන් සෙරන්දිබ් සහ තැප්රෝබේන් යන නම්වලින් ද සිව් හෙළය හෙළය තම්බපන්නි සීලදීප රත්නදීප හා පෙරදිග ධාන්යාගාරය ආදී අන්වර්ථ නාමවලින් ද සහ විරුදාවලිවලින් ද හදුන්වයි දෑත් එක්කොට ආයුබෝවන් ආයිබෝං කීම ශ්රී ලාංකික සිංහලයන් අන් අය පිළි ගැනීමට භාවිතා කරන සාම්ප්රදායික ක්රමයයි එහි යටත් විජිත කාලය තුළ දිවයිනට සිලෝන් යන නම ලැබුණි එය පසුව යටත් විජිත කාලය අවසන් වන තුරුම දිගටම භාවිතා විය සිලෝන් නමින් වර්තමානයේ හැඳින්වූයේ නැතත් වර්තමානයේ විවිධ දේශීය ව්යාපාර සඳහා සිලෝන් යන නාමය භාවිත කිරීම සුලභ දෙයකි ඉන්දියාවේ කඳුළු බිඳුව ලෙස ශ්රී ලංකාව හැඳින්වීමට ශ්රී ලංකාවේ විශේෂ හැඩය සහ ඉන්දියාවට සමීප වීම හේතු විය ඉතිහාසය ප්රාග් ඓතිහාසික යුගය ශ්රී ලංකාවේ හෝමෝ ඉරෙක්ටස් මිනිසුන් තරම් ඈතක සිට ඇති බවට සාක්ෂි ඇත ගල් යුගය ගල් යුගය ආසන්න වශයෙන් වසර කට පෙර සිට ක්රි පූ දක්වා පැවතිණි පැලියොලිතික් යුගය ඉරණමඩු හි සොයාගැනීම්වලින් පෙනී යන්නේ ශ්රී ලංකාවේ තරම් ඈත අතීතයේ පැලියොලිතික් මිනිසුන් සිටි බවයි ශ්රී ලංකා භූමියේ පැලියොලිතික් යුගයට අයත් ප්රධාන ප්රදේශ ක පදිංචිකරුවන් සොයා ගත හැකි විය පහතරට වියළි කලාපය පහතරට අර්ධ ශුෂ්ක කලාපය පහතරට වියළි කලාපය පහතරට අතරමැදි වියළි කලාපය කඳුකර වියළි අතරමැදි කලාපය පහතරට අතරමැදි තෙත් කලාපය තෙත් කඳු කලාපය තෙත් උස්බිම් කලාපය ආණ්ඩුව ප්රධාන ලිපිය ශ්රී ලංකා ප්රජාතාන්ත්රික සමාජවාදී ජනරජය ශ්රී ලංකාව ඒකීය රාජ්යයක් වන අතර එහි ආණ්ඩුව ශ්රී ලංකා ප්රජාතාන්ත්රික සමාජවාදී ජනරජය නම් වේ එතෙක් සිලෝන් හෙවත් ලංකා නම් වූ රාජධානිය අහෝසි කොට මැයි දින ශ්රී ලංකා සමාජවාදී ජනරජය පිහිටුවන ලදී දී ශ්රී ලංකා ප්රජාතාන්ත්රික සමාජවාදී ජනරජය පිහිටුවන ලදී අගනුවර අග නගරය ශ්රී ජයවර්ධනපුර කෝට්ටේ වේ එහි වාණිජ අග නගරය වන්නේ කොළඹ නගරයයි වර්ග ප්රමාණය ප්රධාන ලංකා දූපත අභ්යන්තර සමුද්ර ජල ප්රදේශය ඓතිහාසික මුහුද රාෂ්ට්රීය මුහුද යාබද මුහුද පරම ආර්ථික කලාපය සමස්ථ වර්ගඵලය ශ්රී ලංකාවේ ජාතික සංකේත ජාතික පක්ෂියා ශ්රී ලංකා වලිකුකුලා ය්ජ් ජාතික සත්ත්වයා ශ්රී ලංකා දඩුලේනා ජාතික වෘක්ෂය නා ගස ජාතික පුෂ්පය මානෙල් මල ජාතික මාණික්යය නිල් මැණික මෙහි වැඩිදුර අධ්යයනයක් සදහා ශ්රී ලංකාවේ ජාතික සංකේත වෙත පිවිසෙන්න ශ්රී ලංකාවේ අතීතය ප්රධාන ලිපිය ශ්රී ලංකාවේ අතීතය ප්රාග් ඓතිහාසික යුගය ලංකාවේ ප්රාග් ඓතිහාසික යුගය අධ්යයනය කිරීමේ පහසු ව සඳහා පහත පරිදි යුග වලට බෙදා අධ්යයනය කරනු ලැබේ පුරාශිලා යුගය මධ්යශිලා යුගය නවශිලා යුගය සිදුකර ඇති පුරාවිද්යා පර්යේෂණ අනුව ලංකාවේ මානව යටගියාව පිළිබඳ සාධක අදින් වසර දක්වා ඈතට දිවයයි ලංකාවේ වයඹදිග හා ගිණිකොණදිග ප්රදේශයන්ගේ වෙරළාශ්රීත ප්රදේශවල ව්යාප්තව ඇති ඉරණමඩු පාංශු සංකීර්ණයට අයත් බූන්දල වැල්ලෙගංගොඩ හා පතිරාජවෙල යන ස්ථානයන්ගේ සිදුකරන ලද පුරාවිද්යා පර්යේෂණ අනුව මෙම කරුණු තහවුරු වී ඇත ඓතිහාසික යුගය ප්රථම නවීන අගනුවර ලෙස අනුරාධපුරය සැලකෙන අතර රාජ්ය පරපුරේ අවසානය සෙංකඩගල නගරය විය යටත් විජිත යුගය වර්ෂ දී පෘතුගීසීන් ලංකාව ආක්රමණය කරන ලදී පරංගින්ගේ මුලික අවශ්යතාව වූයේ ඔවූන්ගේ ආගම හා වෙළඳාම පැතිරවීමයි පසුව ඕලන්ද ලන්දේසීන් හා ඉංග්රීසි අධිරාජ්යවාදීන්ගේ ද තාඩන පීඩනවලට ලක්විය මෙම ආකාරයෙන් වූ තාඩන පීඩනයන්ගෙන් මීදීම සදහා උඩරට ගිවිසුම නමින් දී ඉංග්රිසීන් සමඟ අත්සන් කරන ලද ගිවිසුම ඔවුන් විසින් ම උල්ලංඝනය එහි ජනතාව පිට යටත් විජිත මානසිකත්වයක් මවමින් දක්වා දරුණු පාලනයක් ගෙන ගියහ මේ අතරතුර කාලයේදී ලාංකික ජනතාව දී සහ දී කැරලි දියත් කලේය ශ්රී ලංකා සමාජවාදී ජනරජය ප්රධාන ලිපිය ශ්රී ලංකා සමාජවාදී ජනරජය කොටි ත්රස්තවාදය අවුරුදු කට ආසන්න කාලයක් තුල රටේ බෙදීමක් ඇති කිරීමට ත්රස්තවාදී කණ්ඩායමක් වන දෙමළ ඊලාම් කොටි එල්ටීටීඊ සංවිධානය තැත් කළද වසරේදී එම සංවිධානය රටින් මුලිනුපුටා දමා රටට සාමය ඇතිවී ඇත ශ්රී ලංකාවේ පුරාවස්තු ප්රධාන ලිපිය ශ්රී ලංකාවේ පුරාවිද්යා ආරක්ෂිත ස්මාරක ලැයිස්තුව භූගෝලය ප්රධාන ලිපිය ශ්රී ලංකාවෙහි භූගෝලය ශ්රී ලංකාවෙහි භූ ලාක්ෂණික සිතියම ස්වභාවික ව්යසන ශ්රී ලංකාව ස්වභාවික ව්යසන අවම රටකි නමුත් වර්ෂාව නිසා ඇතිවන ව්යසන නිතර දැකිය හැක ක්රි ව වසරේ දෙසැම්බර් වනදා බලපෑ සුනාමිය ව්යසනය ශ්රී ලංකාවේ වාර්තාගත දරුණුතම ස්වභාවික ව්යසනය වේ ශාක සහ සත්ත්ව සංහතිය ප්රධාන ලිපිය ලංකා දූපතේ ශාක සහ සත්ත්ව සංහතිය විවිධත්වය සහ ආවේණිකත්ය අතින් ශ්රී ලංකාවේ ශාක සංහතිය ඉහළ අගයක් ගනී ශ්රී ලංකාවේ ගණ කට අයත් සපුෂ්පක ශාක ක් ඇත්තේය විශේෂ සහ ගණ ක් දිවයිනට ආවේණික වේ මීට අමතරව දිවයිනෙහි ඇති හොර කුලයේ ශාක විශේෂ න් එකක් හැර අනෙක්වා සියල්ලම ශ්රී ලංකාවට සීමා වේ මෑතකදී අගය නො කරන ලද මුත් ශ්රී ලංකාවේ මීවන ප්රමාණය ක් පමණ වේ සියළු ජීවී කාණ්ඩවල විවිධත්වය සාරවත්භාවය සහ ආවේණිකත්ය අතින් තෙත් කලාපය වියළි කලාපයට වඩා ඉතා ඉදිරියෙන් සිටියි තෙත් කලාපය භූමි ප්රමාණයෙන් දිවයිනෙන් හතරෙන් එකක් වන නමුත් සපුෂ්පක ශාක විශේෂවලින් සියයට කට සහ ආවේණික සපුෂ්පක ශාක විශේෂවලින් සියයට කට රැකවරණය සළසයි ශ්රී ලංකාවේ ස්වභාවික වනාන්තර කොටස් අටකට කාණ්ඩ කරයි ශ්රී ලංකාවේ උප බෙදීම් ප්රධාන ලිපිය ශ්රී ලංකාවේ උප බෙදීම් පළාත් ප්රධාන ලිපිය ශ්රී ලංකාවේ පළාත් ශ්රි ලංකාව පළාත් කට බෙදා දේශපාලන බලය විමධ්යගතකර ඇත ඒවා නම් උතුරු පළාත උතුරු මැද පළාත මධ්යම පළාත වයඹ පළාත බස්නාහිර පළාත සබරගමුව පළාත ඌව පළාත දකුණු පළාත නැගෙනහිර පළාත පරිපාලන දිස්ත්රික්ක ප්රධාන ලිපිය ශ්රී ලංකාවේ පරිපාලන දිස්ත්රික්ක ශ්රී ලංකාව පරිපාලනය දිස්ත්රික් ක් වශයෙනි ජනතාව ජනගහණය ජන සංගණනය අනුව සමාජය බහු සංස්කෘතිකමය රටකි ශ්රී ලංකාවේ බහුතරය සිංහල ජාතිකයෝ වේ රාජ්ය ආගම බුද්ධාගමය පෙරදිග සංස්කෘතියට අනුගත සමාජයකි ජාතීන් සිංහල දෙමළ මරක්කල බර්ගර් මැලේ වැදි ආදී විවිධ ජාතින් ජීවත්වේ ශ්රි ලංකාවෙහි ප්රධාන හා පාරම්පරික කර්මාන්තය ගොවිතැනය භාෂා ප්රධාන ලිපිය ශ්රී ලංකාවේ භාෂා සිංහල සහ දෙමළ රාජ්ය භාෂාවේ ඉංග්රීසි පිළිගත් සමිබන්ධීකරණ භාෂාවයි නිල තත්ත්වයක් නොමැති වුවද මලයාලම් වැදි බස මැලේ ආදී භාෂා අදාල ජාතීන් භාවිතා කරයි ආගම් ප්රධාන ලිපිය ශ්රී ලංකාවේ ආගමික විවිධත්වය ප්රධාන ආගම බුදු දහම වේ බුද්ධාගම සහ පුරාණ හෙල ඇදහිලි හින්දු රෝමානු කතෝලික ක්රිස්තියානි ඉස්ලාම් වර්ෂය බෞද්ධ හින්දු ඉස්ලාම් කතෝලික වෙනත් එකතුව සංඛ්යව සංඛ්යව සංඛ්යව සංඛ්යව සංඛ්යව සංඛ්යව සංගණනය සංගණනය සංගණනය සංගණනය සංගණනය තක්සේරුව සංගණනය සංගණනය සංගණනය සංගණනය සංගණනය බොජුන් ජාතික ආහාරය බත් වේ බත් සහ ව්යංජන දෙක ම මෙම වචනයෙන් අදහස් කෙරේ දේශපාලනය ප්රධාන දේශපාලන පක්ෂ තනි පක්ෂ ශ්රී ලංකා නිදහස් පක්ෂය එක්සත් ජාතික පක්ෂය ජනතා විමුකිති පෙරමුණ හවුල් සංධාන එක්සත් ජනතා නිදහස් සංධානය එක්සත් ජාතික පෙරමුණ ප්රජාතන්ත්රවාදී ජාතික සංධානය අධ්යාපනය ප්රධාන ලිපිය ශ්රී ලංකාවේ අධ්යාපනය ආර්ථිකය සමාජවාදී සහ ධනවාදී ලක්ෂණ මිශ්ර ආර්ථික ක්රමයක් පවතී මූලිකවම කෘෂිකාර්මික රටකි මහ බැංකු වාර්තාව අනුව වසරේදි ශ්රී ලංකාව සියයට ක ආර්ථික වර්ධනයක් වාර්තා කර ඇත කෘෂීකර්මය දේශීය පරිභෝජනය සඳහා වී ගොවිතැන පොල් වගාව අපනයන බෝග ශ්රී ලංකාවේ තේ රබර් කුළු බඩු කර්මාන්ත සාම්ප්රදායික කර්මාන්ත ශ්රී ලංකාවේ ධීවර කර්මාන්තය හස්ත කර්මාන්ත නව කර්මාන්ත ස්වභාවික පරිසරය ශ්රී ලංකාවේ ලෝක උරුමයන් ශ්රී ලංකාවට ආවේනික කුරුල්ලෝ ශ්රී ලංකාවට ආවේනික ක්ෂීරපායීන් ලැයිස්තුව දියඇලි ශ්රී ලංකා ක්රීඩා ශ්රි ලංකාව සහ එංගලන්තය අතර ටෙස්ට් තරඟය මාර්තු ක්රීඩාංගනය නිල වශයෙන් ශ්රී ලංකාවේ ජාතික ක්රීඩාව වොලිබෝල් වුවද ජනප්රියතම ක්රීඩාව ක්රිකට්ය ජල ක්රීඩා පාපන්දු සහ ටෙනිස් මෙන් ම රග්බි ද බොහෝ ජනප්රිය ක්රීඩාවන් වෙයි ශ්රී ලංකාවේ පාසල් උසස් අධ්යාපන ආයතන යනාදිය ක්රීඩා සහ මලල ක්රීඩා කණ්ඩායම් සංවිධානය කරමින් පළාත් හා ජාතික මට්ටමින් ක්රීඩා තරඟ වලට සහභාගී වෙති ඉතාම දුර්වල තත්වයක සිටි ශ්රී ලංකා ක්රිකට් කණ්ඩායම ගණන් වල සිට සැළකිය යුතු ජයග්රහණ අත්පත් කරගනිමින් ඉදිරියට පැමිණ ලෝක කුසලානයද සහ වර්ෂ වල ආසීයානු කුසලානය ද දිනා ගත්තේය ලෝකයේ ක්රිකට් ක්රීඩා කරන ප්රධාන රටවල් වලින් එකක් ලෙස ඉදිරියට පැමිණි ශ්රී ලංකාව ලෝක කුසලාන තරඟාවලියේ අවසාන මහා තරඟය දක්වා පැමිණියේය එහිදි ඔව්හු ඕස්ට්රේලීයාවට පරාද වූහ ලන්ඩන් ඔලිම්පික් උළෙලේ මීටර් පිරිමි කඩුලු මතින් දිවීමේ තරගයෙදි ඩන්කන් වයිට් මහතා විසින් රිදී පදක්කමක් ජය ගෙන මුල්ම ඔලිම්පික් පදක්කම ශ්රි ලංකාවට ගෙන එනු ලැබුවා තවද වසරේ සිඩ්නි ඔලිම්පික් කාන්තා මීටර් තරගයෙදි සුසන්තිකා ජයසිංහ විසින් එක් රිදී පදක්කමක් ජය ගෙන තිබේ සිංහල ස්පෝට්ස් ක්ලබ් ආර් ප්රේමදාස ක්රීඩාංගනය සහ රන්ගිරි දඹුලු ක්රීඩාංගනය මෙන්ම ගාල්ල ජාත්යන්තර ක්රීඩාංගනය වැනි ක්රීඩාංගන රාශියක් ශ්රී ලංකාවේ තිබේ ලෝක කුසලාන තරඟාවලියේදී ශ්රි ලංකාව ඉන්දියාව සහ පාකිස්ථානය සමග තරඟ වැදුනු අතර ආසීයානු කුසලාන තරඟාවලී කීපයකටද සහභාගී වූහ එමෙන්ම එය දී පැවැත්වෙන ලෝක කුසලාන තරඟාවලියටද සහභාගී වෙයි වෙරළ අසබඩ ද නිසල ජල තටාකවල ද පැවැත්වෙන බෝට්ටු තරඟ දිය මත ලිස්සා යාම පිහිනීම දියට පැනීමේ සහ කිමිදීමේ ක්රීඩා ආදී ජල ක්රීඩා ශ්රී ලාංකිකයන්ගේ මෙන් ම විදේශ සංචාරකයන්ගේ ද සිත් පැහැර ගනී ආශ්රිත ලිපි ජාතික ගීය ශ්රී ලංකාවේ උප බෙදීම් ශ්රී ලාංකිකයෝ මූලාශ්ර සෙන්සස් ඔෆ් පොපියුලේෂන් ඇන්ඩ් හවුසිං එනියුමරේෂන් ස්ටේජ් ෆෙබ්රැවරි මාර්ච් ශ්රී ලංකා ජන සංගණන හා සංඛ්යාලේඛන දෙපාර්තමේන්තුව දෙසැම්බර් දින මුල් පිටපත වෙතින් සංරක්ෂණය කරන ලදී සම්ප්රවේශය ජූලි වර්ල්ඩ් ඉකොනොමික් අවුට්ලුක් ඩේටාබේස් ඔක්තෝම්බර් ජාත්යන්තර මූල්ය අරමුදල සම්ප්රවේශය ඔක්තෝම්බර් ලෝක බැංකුව සම්ප්රවේශය මාර්තු හියුමන් ඩිවලොප්මන්ට් රිපෝර්ට් ස්ටැටිස්ටිකල් ඇනෙක්ස් එක්සත් ජාතීන්ගේ සංවර්ධන වැඩසටහන සම්ප්රවේශය දෙසැම්බර් සම්ප්රවේශය සම්ප්රවේශය ශ්රී ලංකාව මාතෘකා දළ විශ්ලේෂණය සංක්ෂිප්තය සුචිය ග්රන්ථාවලිය කාලරේඛාව වර්ෂ ඉතිහාසය යුග ප්රාග්ඉතිහාසය මුල්කාලීන රාජධානි යුගය අනුරාධපුර යුගය පොළොන්නරු යුගය සංක්රාන්ති යුගය දහසයවන සියවසේ අර්බුදය මහනුවර යුගය බ්රිතාන්ය ලංකාවේ ඉතිහාසය ශ්රී ලංකාවේ ඉතිහාසය වර්තමානය වැදත් කාලපරිච්ඡේද මහාවංසය විජය තම්බපණ්ණි උපතිස්ස නුවර අනුරාධපුර පොළොන්නරුව යාපනය දඹදෙණිය ගම්පොළ කෝට්ටේ සීතාවක මහනුවර පෘතුගීසී ලංකාව ලන්දේසි ලංකාව බ්රිතාන්ය ලංකාව මහනුවර යුද්ධ ඌව කැරැල්ල මාතලේ කැරැල්ල නිදහස් ව්යාපාරය ලංකා විජිතය සිවිල් යුද්ධය මාතෘකා වංශකථා පුරාතන අගනුවරවල් රජවරු ජන විකාශන අර්ථික අධ්යාපනය යුධ රජය නීතිය ආණ්ඩුක්රම ව්යවස්ථාව ව්යවස්ථාදායක මණ්ඩලය විධායකය ජනාධිපති විධායක කාර්යාලය කැබිනට් මණ්ඩලය අමාත්යාංශ පරිපාලන සේවාව ජාතික ආරක්ෂක මණ්ඩලය නීතිය බලායනය අධිකරණය ශ්රේෂ්ඨාධිකරණය අභියාචනාධිකරණය මහාධිකරණ දිස්ත්රික් අධිකරණ මහේස්ත්රාත් අධිකරණ ප්රාථමික අධිකරණ කම්කරු උසාවිය ව්යවස්ථාදායකය පාර්ලිමේන්තුව අග්රාමාත්ය කාර්යාලය කථානායක නියෝජ්ය කථානායක සහ කමිටු සභාපති නියෝජ්ය කමිටු සභාපති සභා නායක විපක්ෂ නායක ලේකම් ජනරාල් වන පාර්ලිමේන්තුව සාමාජිකයින් ජාතික ආරක්ෂාව ආරක්ෂක හමුදා ගුවන් හමුදාව යුද්ධ හමුදාව නාවික හමුදාව වෙරළාරක්ෂක සේවය බුද්ධි අංශ රාජ්ය බුද්ධිමය සේවාව හමුදා බුද්ධි අංශ අධ්යක්ෂක මණ්ඩලය අපරාධ පරීක්ෂණ දෙපාර්තමේන්තුව ශ්රී ලංකා පොලිස් සේවය දේශපාලන මැතිවරණ කොට්ඨාස මැතිවරණ විදේශ සබඳතා පක්ෂ ශ්රී ලංකා නිදහස් පක්ෂය එක්සත් ජාතික පක්ෂය අපවාද පළාත් රජය ප්රාදේශීය රජය භූගෝල විද්යාව පරිපාලන කොට්ඨාස පළාත් දිස්ත්රික්ක ප්රාදේශීය ලේකම් කොට්ඨාස නගර සභා පුරවර මහානගර ඡන්ද කොට්ඨාස ග්රාම නිලධාරී කොට්ඨාස නගර පාරිසරික කලාප පරිසරය අත්යන්ත ලක්ෂ්ය දූපත් කඳු පිදුරුතලාගල මධ්ය කඳුකරය හන්තාන කඳුකර කලාපය නකල්ස් කඳුකර ප්රදේශය ජාතික උද්යාන ආරක්ෂිත ප්රදේශ ගංගා මහවැලි මල්වතු කැලණි කලු ගිං දියඇළි වනජීවීන් ආර්ථිකය කෘෂිකර්මාන්තය බැංකුකරණය මහ බැංකුව සන්නිවේදනය සමාගම් බලශක්තිය තොරතුරු තාක්ෂණය රාජ්ය ණය පර්යේෂණ රුපියල කොටස් වෙළඳපොල බදු ක්රමය වෙළඳාම ප්රවාහනය විරැකියාව කර්මාන්ත බීර කුරුඳු පොල් කෝපි මැණික් සහල් රබර් සීනි තේ සංචාරක කර්මාන්තය සමාජය මාතෘකා උපත ජන විකාශනය අධ්යාපනය සෞඛ්යය භාෂා සිංහල දෙමළ මාධ්ය ජනයා මහජන නිවාඩු දින ආගම සමාජ පන්ති ක්රීඩා සංස්කෘතිය වාස්තු විද්යාව කලා සිනමාව සූපවේදය නර්තනය විලාසිතා ධජය ජනශ්රැතිය සාහිත්යය සංගීතය ජාතික සංකේත දර්ශනය ගුවන් විදුලිය රූපවාහිනිය වේදිකා නාට්ය ලෝක උරුම අඩවි වාද විෂයයන් මරණ දඬුවම අපරාධ ලිංග අසමානතාව මානව අයිතිවාසිකම් සංක්රමණය නීතිවිරෝධී සංක්රමණය අන්තර්ජාතික ශ්රේණිගත කිරීම් ඉතිහාසය අයිතීන් දරිද්රභාවය ත්රස්තවාදය ග්රන්ථය ප්රවර්ගය ද්වාරය විකිව්යාපෘතිය බාහිර යොමු ශ්රී ලංකා රජය රාජ්ය තොරතුරු කේන්ද්රය සංරක්ෂණය කළ පිටපත ජනලේඛන හා සංඛ්යාලේඛන දෙපාර්තමේන්තුව ශ්රී ලංකා රජයේ නිල පුවත් වෙබ් අඩවිය සංරක්ෂණය කළ පිටපත ග්රී ලාංකීය ඉතිහාසයේ පින්තූර ආසියාවේ රටවල් ස්වාධීන රාජ්යයන් අසර්බයිජාන් ආර්මේනියාව ඇෆ්ගනිස්ථානය ඉන්දුනීසියාව ඉරාකය ඉරානය ඊජිප්තුව ඊශ්රායලය උස්බෙකිස්ථානය එක්සත් අරාබි එමීර් රාජ්යය ඕමානය කටාර් කසක්ස්තානය කාම්බෝජය කීර්ගිස්තානය කුවේට් උතුරු කොරියාව දකුණු කොරියාව චීනය ජපානය ජෝර්ජියාව ජෝර්දානය ටජිකිස්ථාන් තායිලන්තය තුර්කිය නැගෙනහිර ටිමෝරය ටිමෝර් ලෙස්ටේ නේපාලය පලස්තීනය පාකිස්ථානය පිලිපීනය බංගලාදේශය බහරේන් මියන්මාරය බෲනායි ඉන්දියාව භූතානය මැලේසියාව මාලදිවයින මොංගෝලියාව යේමනය රුසියාව ලාඕසය ලෙබනනය වියට්නාමය ශ්රී ලංකාව සයිප්රස් සවුදි අරාබිය සිංගප්පූරුව සිරියාව සීමිත පිළිගැනීමක් ඇති රාජ්යයන් ඇබ්ඛසියාව උතුරු සයිප්රසය තායිවානය දකුණු ඔසීෂන්ස් නැගෝනෝ කැරබැක් යටත් ප්රදේශ සහ විශේෂ පාලන ප්රදේශ එක්සත් රාජධානිය ඇක්රෝටිරි සහ ඩෙකේලියා බ්රිතාන්ය ඉන්දීය සාගර ප්රදේශය ඔස්ට්රේලියාව නත්තල් දූපත කොකෝස් කීලින් දූපත චීනය හොංකොං මැකාවු",
        "ජාතික ගීය ශ්රී ලංකා මාතා ඉංග්රීසි",
        "ශ්රි ලාංකීය දමිළ ඉන්දීය දමිළ ශ්රී ලාංකීය යෝනක බර්ගර් මැලේ",
        "හින්දු ඉස්ලාම් රෝමානු කතෝලික වෙනත් ක්රිස්තියානි",
        "මෙම ලිපිය රට පිලිබඳ වේ වෙනත් භාවිතා සඳහා ලංකාව බලන්න",
        "ශ්රී ලංකාව බ්රිතාන්ය පාලන සමයේ දී සිලෝන් ලෙස හැඳින්වු අතර වර්තමානයේ නිල වශයෙන් ශ්රී ලංකා ප්රජාතාන්ත්රික සමාජවාදී ජනරජය ලෙස හදුන්වයි ශ්රී ලංකාව සෙරන්ඩිබ් සිලොන් දීප්තිමත් දිවයින ධර්ම දිවයින ඉන්දියන් සාගරයේ මුතු ඇටය නමින්ද හදුන්වයි විවිධ නම් ගණනාවකින් පුරාණයේ හැඳින්වූ මෙම දූපත නම් දහසක් ඇති දූපත ලෙස ප්රචලිත ද විය මෙය දකුණු ආසියානු දූපතකි එය ඉන්දියානු සාගරයේ බෙංගාල බොක්කෙහි නිරිත දෙසින් සහ අරාබි මුහුදේ ගිනිකොන දෙසින් පිහිටා ඇත එය ඉන්දියානු උප මහද්වීපය මන්නාරම් බොක්ක සහ පෝක් සමුද්ර සන්ධිය මගින් වෙන් කරනු ලැබේ ශ්රී ලංකාවේ පිහිටීම ප්රධාන මුහුදු මාර්ගවල පිහිටීම හේතුවෙන් බටහිර ආසියාව සහ අග්නිදිග ආසියාව අතර උපායමාර්ගික නාවික සම්බන්ධකයක් ලෙස එය පුරාණ කාලයේ සිටම භාවිතය ගැණුනි ඉන්දියානු ජනරජය සහ ශ්රී ලංකා ජනරජය මාර්තු වන දින මනාර් බොක්ක සහ බෙංගාල බොක්කෙහි සමුද්ර මායිම් ස්ථාපිත කරමින් ගිවිසුමක් අත්සන් කරන ලදී ශ්රී ලංකාවට ආසන්න ම රටවල් ලෙස ඉන්දියාව සහ මාලදිවයින හැදින්විය හැකි ය",
        "ශ්රී ලංකාවේ විශාලත්වය වර්ග කි මී වර්ග සැතපුම් වේ එය ලොව වැනි විශාලතම රට වන අතර විශාලතම දූපත් අතරින් වන ස්ථානයෙ සිටියි එහි භූමි ප්රදේශය පළාත් නවයකට සහ දිස්ත්රික්ක විසිහතරකට වෙන් කර ඇත රට පළාත් කින් දිස්ත්රික්ක හා ප්රදේශිය ලේකම් කොට්ටාශය හා ග්රාම නිලධාරි කොට්ටාශ කින් සමන්විත වේ අගනුවර ශ්රී ජයවර්ධනපුර කොට්ටේ වන අතර විශාලතම නගරය කොළඹ වේ කොළඹ ජාතියේ ආර්ථික දේශපාලන කේන්ද්රස්ථානයයි",
        "ශ්රී ලංකාව ලෝක උරුම ස්ථාන අටක් සැතපුම් ගණනක් පුරා විහිදුනු රන්වන් වැලි සහිත වෙරළ වල් වැසි වනාන්තර සහ කඳුකර තේ වතු සහිත ඉතා සුන්දර දූපතකි නිවර්තන වනාන්තර වෙරළ සහ භූ දර්ශනවල ස්වභාවික සුන්දරත්වය ජෛව විවිධත්වය මෙන්ම පොහොසත් සංස්කෘතික උරුමයන් සඳහා ප්රසිද්ධය එය ලෝක ප්රසිද්ධ සංචාරක ගමනාන්තයක් බවට පත් කළේය",
        "ශ්රී ලංකාවේ ජනගහනය මිලියන කට ආසන්න වේ එය දූපතක ජීවත් වන වන විශාලතම ජනගහනය යි ශ්රී ලංකාවේ ජනගහනයෙන් ථෙරවාද බෞද්ධ යන් වේ එනම් මිලියන ක් පමණ වේ එය ලොව හෝ වන විශාලතම බෞද්ධ ජනගහය ක් වෙසෙන රට වේ ශ්රී ලංකාවේ ජාතික ආගම ථෙරවාද බෞද්ධ වන අතර හින්දු භක්තිකයන් ඉස්ලාම් භක්තිකයන් ක්රිස්තියානි භක්තිකයන් නිරාගමිකයන් සහ වෙනත් ආගමිකයෝ වෙති",
        "බහුවිධ හා බහුසංස්කෘතික රාජ්යයක් වන ශ්රී ලංකාව බොහෝ ආගම් ජන වර්ග සහ භාෂා රැසකට නිවහන වේ දිවයිනෙහි බහුතරය වූ සිංහල ජනතාවට අමතරව එහි අනෙකුත් සුළු වාර්ගික කණ්ඩායම් ලෙස ශ්රී ලාංකික දෙමළ ඉන්දියානු දෙමළ මරක්කල බර්ගර් මැලේ කාපිරි සහ ස්වදේශීය වැදි ජනතාව වාසය කරනු ලබයි නිල භාෂාව සිංහල භාෂාව සහ දෙමළ භාෂාව වේ",
        "ශ්රී ලංකාව යනු පොහොසත් සංස්කෘතික උරුමයක් ඇති රටකි ශ්රී ලංකාවේ ලිඛිත ඉතිහාසය වසර ක් පමණ අතීතයට විහිදෙන අතර සහ සාක්ෂ්ය සහිත ප්රාග් ඓතිහාසික මානව ජනාවාසයන්ගේ ඉතිහාසය අවම වශයෙන් වසර ක් දක්වා විහිදේ ඉතා පොහොසත් බෞද්ධ උරුමය ක් සතු ශ්රී ලංකාවේ ප්රථම ඉතිහාසමය බෞද්ධ ලේඛනගත කිරීම වන පාලි ත්රිපිටකය ක්රි පූ සිව්වන ධර්ම සංගායනා සමය තෙක් දිවයයි කෝට්ටේ රාජධානියේ විශාල දේශපාලන අර්බුදකාරී කාල පරිච්ඡේදයක් තුළ පෘතුගීසීන් ශ්රී ලංකාවට පැමිණ දිවයිනේ සමුද්ර වෙළඳාම පාලනය කිරීමට උත්සාහ කළ අතර ශ්රී ලංකාවේ කොටසක් පසුව පෘතුගීසි සන්තකයක් බවට පත්විය සිංහල පෘතුගීසි යුද්ධයෙන් පසු ලන්දේසීන් සහ මහනුවර රාජධානිය එම ප්රදේශ පාලනය කර ගත්හ පසුව ලන්දේසි දේපල බ්රිතාන්යය න් විසින් අත්පත් කර ගත් අතර පසුව ඔවුන් මුළු දිවයිනම තම පාලනය ව්යාප්ත කර සිට දක්වා එය යටත් විජිතයක් බවට පත් කළහ ශ්රී ලංකාවේ වඩාත් මෑත ඉතිහාසය වසර ක සිවිල් යුද්ධය කින් විනාශ වූ අතර එය දී ආරම්භ වී දී තීරණාත්මක ලෙස අවසන් වූයේ ශ්රී ලංකා සන්නද්ධ හමුදාව දෙමළ ඊළාම් විමුක්ති කොටි සංවිධානය පරාජය කිරීමත් සමඟ ය",
        "ශ්රී ලංකාව අර්ධ ජනාධිපතිමය ක්රමය යටතේ පාලනය වන ඒකීය ජනරජයක් වේ",
        "ශ්රී ලංකාව සතු විදේශ සබඳතා දිගු ඉතිහාසයකින් සමන්විතය ශ්රී ලංකාව දකුණු ආසියානු කලාපීය සහයෝගීතා සංවිධානයේ සාර්ක් සංවිධානය ආරම්භක සාමාජිකයෙකු වන අතර එක්සත් ජාතීන් පොදු රාජ්ය මණ්ඩලය ජී සහ නොබැඳි ජාතීන් යන සංවිධානවලද වත්මන් සාමාජිකයෙකු වේ කුරුඳු තේ කෝපි රබර් සහ පොල් නිෂ්පාදනය සහ අපනයනය සඳහා ප්රසිද්ධ ශ්රී ලංකාව ප්රගතිශීලී නවීන කාර්මික ආර්ථිකයක් දරයි ශ්රී ලංකාව සංවර්ධනය වෙමින් පවතින රට ක් වන අතර මානව සංවර්ධන දර්ශකයේ වැනි ස්ථානයට පත්ව ඇත එය සංවර්ධනය අතින් ඉහළම ශ්රේණිගත දකුණු ආසියානු ජාතිය වන අතර දකුණු ආසියාවේ දෙවැනි ඉහළම ඒක පුද්ගල ආදායම ද ඔවුනට හිමිය",
        "විවිධ නම් ගණනාවකින් පුරාණයේ හැඳින්වූ මෙම දූපත නම් දහසක් ඇති දූපත ලෙස ප්රචලිත ද විය ශ්රී ලංකාව සෙරන්ඩිබ් සිලොන් දීප්තිමත් දිවයින ධර්ම දිවයින ඉන්දියන් සාගරයේ මුතු ඇටය ඉන්දියාවේ කඳුළු බිඳුව යන නමින්ද අතීතයේ දී අපරදිග විදේශිකයන් විසින් නිල වශයෙන් හෙලංකා ලංකා සිංහලේ යනුවෙන්ද අරාබිවරුන් සීලාන් සිලෝන් සෙරන්දිබ් සහ තැප්රෝබේන් යන නම්වලින් ද සිව් හෙළය හෙළය තම්බපන්නි සීලදීප රත්නදීප හා පෙරදිග ධාන්යාගාරය ආදී අන්වර්ථ නාමවලින් ද සහ විරුදාවලිවලින් ද හදුන්වයි දෑත් එක්කොට ආයුබෝවන් ආයිබෝං කීම ශ්රී ලාංකික සිංහලයන් අන් අය පිළි ගැනීමට භාවිතා කරන සාම්ප්රදායික ක්රමයයි",
        "එහි යටත් විජිත කාලය තුළ දිවයිනට සිලෝන් යන නම ලැබුණි එය පසුව යටත් විජිත කාලය අවසන් වන තුරුම දිගටම භාවිතා විය සිලෝන් නමින් වර්තමානයේ හැඳින්වූයේ නැතත් වර්තමානයේ විවිධ දේශීය ව්යාපාර සඳහා සිලෝන් යන නාමය භාවිත කිරීම සුලභ දෙයකි ඉන්දියාවේ කඳුළු බිඳුව ලෙස ශ්රී ලංකාව හැඳින්වීමට ශ්රී ලංකාවේ විශේෂ හැඩය සහ ඉන්දියාවට සමීප වීම හේතු විය",
        "ශ්රී ලංකාවේ හෝමෝ ඉරෙක්ටස් මිනිසුන් තරම් ඈතක සිට ඇති බවට සාක්ෂි ඇත",
        "ගල් යුගය ආසන්න වශයෙන් වසර කට පෙර සිට ක්රි පූ දක්වා පැවතිණි",
        "ඉරණමඩු හි සොයාගැනීම්වලින් පෙනී යන්නේ ශ්රී ලංකාවේ තරම් ඈත අතීතයේ පැලියොලිතික් මිනිසුන් සිටි බවයි ශ්රී ලංකා භූමියේ පැලියොලිතික් යුගයට අයත් ප්රධාන ප්රදේශ ක පදිංචිකරුවන් සොයා ගත හැකි විය"
      ],
      "fetch_time": 6.559832811355591,
      "error": null
    },
    {
      "url": "https://www.uda.gov.lk/attachments/devplan_detailed/Development%20Plans%202019-2030/Salalihiniya.pdf",
      "title": "Untitled",
      "snippet": "පණගන්වමින් ශ්‍රී ලංකාවේ නව අගනුවර වන ශ්‍රී ජයවර්ධනපුරය සෞභාග්‍යමත් වේවා! ... ඓතිහාසික අගනුවර හා කොළඹ ඉතිහාසය. ගැන කරුණු සැපයීම ...",
      "paragraphs": [],
      "fetch_time": 177.14873242378235,
      "error": null
    },
    {
      "url": "https://www.adb.org/sites/default/files/publication/31161/civil-society-briefs-sri-lanka-si_0.pdf",
      "title": "Civil Society Briefs: Sri Lanka (Sinhala)",
      "snippet": "ශ්‍රී ලංකාව වර්ග කිලෝමිටර් 66,000 ක භූමි ප්‍රදේශයකින්. යුත්, ඉන්දියානු සාගරයේ පිහිටි දිවයිනකි. එය 1948 දී. නිදහස ලැබීය. අවුරුදු 26 ක අභ්‍යන්තර අරගලය 2009 දී. අවසන් විය. අගනුවර ශ්‍රී ජයවර්ධනපුර කෝට්ටේය.",
      "paragraphs": [],
      "fetch_time": 0.0,
      "error": "403 Client Error: Forbidden for url: https://www.adb.org/sites/default/files/publication/31161/civil-society-briefs-sri-lanka-si_0.pdf"
    },
    {
      "url": "https://myschool.lk/%E0%B6%BD%E0%B7%92%E0%B6%B4%E0%B7%92/%E0%B7%83%E0%B6%B8%E0%B7%8F%E0%B6%A2-%E0%B7%80%E0%B7%92%E0%B6%AF%E0%B7%8A%E2%80%8D%E0%B6%BA%E0%B7%8F%E0%B7%80-%E0%B7%81%E0%B7%8A%E2%80%8D%E0%B6%BB%E0%B7%93-%E0%B6%BD%E0%B6%82%E0%B6%9A%E0%B7%8F%E0%B7%80%E0%B7%99%E0%B7%84%E0%B7%92-%E0%B7%83%E0%B6%B8%E0%B7%8F%E0%B6%A2-%E0%B6%86%E0%B6%BB%E0%B7%8A%E0%B6%AE%E0%B7%92%E0%B6%9A-%E0%B6%B4%E0%B7%83%E0%B7%94%E0%B6%B6%E0%B7%92%E0%B6%B8-%E0%B6%B1%E0%B7%92%E0%B6%BB%E0%B7%8A%E0%B6%B8%E0%B7%8F%E0%B6%AB%E0%B6%BA%E0%B7%99%E0%B7%84%E0%B7%92%E0%B6%BD%E0%B7%8F-%E0%B6%B7%E0%B7%9E%E0%B6%AD%E0%B7%92%E0%B6%9A%E0%B6%B7%E0%B7%96%E0%B6%9C%E0%B7%9D%E0%B6%BD%E0%B7%93%E0%B6%BA-%E0%B6%B4%E0%B7%92%E0%B7%84%E0%B7%92%E0%B6%A7%E0%B7%93%E0%B6%B8-%E0%B6%B6%E0%B6%BD%E0%B6%B4%E0%B7%8F-%E0%B6%87%E0%B6%AD%E0%B7%92-%E0%B6%86%E0%B6%9A%E0%B7%8F%E0%B6%BB%E0%B6%BA",
      "title": "සමාජ විද්‍යාව (ශ්‍රී ලංකාවෙහි සමාජ ,ආර්ථික ...",
      "snippet": "වර්ග කිලෝමීටර 65610 කින් යුක්ත ලංකාව උතුරු අක්ෂාංශ පහයි 05° 55' සහ 9°51' අතර පිහිටා ඇත.ලංකාව ඉන්දියාවෙන් වෙන්ව එහෙත් ඉන්දියාවට ආසන්නව ඉන්දියානු සාගරයේ කේන්ද්‍රස්ථානයක පිහිටා ඇත .එනම් පෙර අපර දෙදිග මුහුදු වෙන වෙලද මාර්ගය ...",
      "paragraphs": [
        "වෙනත් වසර වසර වසර වසර වසර වසර වසර වසර වසර උසස්පෙළ වෙනත් සමාජ විද්යාව පුරාවිද්යාව පාඨමාලාව බුද්ධි පරීක්ෂණය සහ අභියෝගතාව සංගීත අපරදිග රියදුරු පුහුණුව පරිපාලන සේවා බැංකුකරණය සහ මූල්ය සේවා සමාජ විද්යාව ඉංග්රීසි භාෂාව අපරාධ විද්යාව මානව විද්යාව මනෝවිද්යාව සාමාන්ය දැනුම කොරියන් භාෂාව දෙමළ භාෂාව පුරාවිද්යාව පාඨමාලාව බුද්ධි පරීක්ෂණය සහ අභියෝගතාව සංගීත අපරදිග රියදුරු පුහුණුව පරිපාලන සේවා බැංකුකරණය සහ මූල්ය සේවා සමාජ විද්යාව ඉංග්රීසි භාෂාව අපරාධ විද්යාව මානව විද්යාව මනෝවිද්යාව සාමාන්ය දැනුම කොරියන් භාෂාව දෙමළ භාෂාව කරන්න වෙනත් සමාජ විද්යාව",
        "වෙනත් වසර වසර වසර වසර වසර වසර වසර වසර වසර උසස්පෙළ වෙනත් සමාජ විද්යාව පුරාවිද්යාව පාඨමාලාව බුද්ධි පරීක්ෂණය සහ අභියෝගතාව සංගීත අපරදිග රියදුරු පුහුණුව පරිපාලන සේවා බැංකුකරණය සහ මූල්ය සේවා සමාජ විද්යාව ඉංග්රීසි භාෂාව අපරාධ විද්යාව මානව විද්යාව මනෝවිද්යාව සාමාන්ය දැනුම කොරියන් භාෂාව දෙමළ භාෂාව",
        "වෙනත් වසර වසර වසර වසර වසර වසර වසර වසර වසර උසස්පෙළ වෙනත්",
        "සමාජ විද්යාව පුරාවිද්යාව පාඨමාලාව බුද්ධි පරීක්ෂණය සහ අභියෝගතාව සංගීත අපරදිග රියදුරු පුහුණුව පරිපාලන සේවා බැංකුකරණය සහ මූල්ය සේවා සමාජ විද්යාව ඉංග්රීසි භාෂාව අපරාධ විද්යාව මානව විද්යාව මනෝවිද්යාව සාමාන්ය දැනුම කොරියන් භාෂාව දෙමළ භාෂාව",
        "පුරාවිද්යාව පාඨමාලාව බුද්ධි පරීක්ෂණය සහ අභියෝගතාව සංගීත අපරදිග රියදුරු පුහුණුව පරිපාලන සේවා බැංකුකරණය සහ මූල්ය සේවා සමාජ විද්යාව ඉංග්රීසි භාෂාව අපරාධ විද්යාව මානව විද්යාව මනෝවිද්යාව සාමාන්ය දැනුම කොරියන් භාෂාව දෙමළ භාෂාව කරන්න වෙනත් සමාජ විද්යාව",
        "පුරාවිද්යාව පාඨමාලාව බුද්ධි පරීක්ෂණය සහ අභියෝගතාව සංගීත අපරදිග රියදුරු පුහුණුව පරිපාලන සේවා බැංකුකරණය සහ මූල්ය සේවා සමාජ විද්යාව ඉංග්රීසි භාෂාව අපරාධ විද්යාව මානව විද්යාව මනෝවිද්යාව සාමාන්ය දැනුම කොරියන් භාෂාව දෙමළ භාෂාව"
      ],
      "fetch_time": 3.337826728820801,
      "error": null
    },
    {
      "url": "https://elections.gov.lk/web/wp-content/uploads/2018/09/Strategic-Plan-2017-Si.pdf",
      "title": "උපාය මාර්ගික සැලැස්ම 2017 - 2020",
      "snippet": "පෘතුගීසි, ලන්දේසි හා ඉංග්‍රීසි පාලන යුගවල සිට 1972 වර්ෂය දක්වා ලංකාව (Ceylon) යනුවෙන් හැඳින්වුණු. ශ්‍රී ලංකාව, දැන් නිල වශයෙන් හැඳින්වෙන ශ්‍රී ලංකා ප්‍රජාතාන්ත්‍රික සමාජවාදී ජනරජය ව. ... ඉන්දියානු සාගරයේ පිහිටි දිවයිනකි. මෙය ...",
      "paragraphs": [],
      "fetch_time": 64.3283257484436,
      "error": null
    }
  ]
}